[
  {
    "title": "AI Cheating?, O, Canada, npms, passkeys, Exchange, Solaris, the amazing Rob Allen - SWN #525",
    "summary": "AI Cheating?, O, Canada, npms, passkeys, Exchange, Solaris, the amazing Rob Allen of Threatlocker, and More on this edition of the Security Weekly News. Segment Resources: Ingram Micro Working Through Ransomware Attack by SafePay Group | MSSP Alert: https://www.msspalert.com/news/ingram-micro-working-through-ransomware-attack-by-safepay-group This segment is sponsored by ThreatLocker. Visit https://securityweekly.com/threatlocker to learn more about them! Visit https://www.securityweekly.com/swn for all the latest episodes! Show Notes: https://securityweekly.com/swn-525",
    "link": "https://www.youtube.com/watch?v=rZphHTJXNjc",
    "source": "Security Weekly News (YouTube)",
    "type": "podcasts",
    "type_label": "Podcasts & YouTube",
    "published": "2025-10-31T21:01:08+00:00",
    "published_ts": 1761944468,
    "smart_groups": [
      "Ransomware",
      "Vulnerabilities / CVEs"
    ]
  },
  {
    "title": "‘Pattern of Extreme Brutality’: Tear Gas, Pepper Balls Among Weapons Deployed Against Protesters in Illinois",
    "summary": "To stay up to date on our latest investigations, join Bellingcat’s new WhatsApp channel here. This investigation is part of a collaboration between Bellingcat and Evident. You can watch Evident’s video here. Children in Chicago’s Old Irving Park neighbourhood were preparing for a Halloween parade on Oct. 25 when federal agents reportedly deployed tear gas on […] The post ‘Pattern of Extreme Brutality’: Tear Gas, Pepper Balls Among Weapons Deployed Against Protesters in Illinois appeared first on bellingcat .",
    "link": "https://www.bellingcat.com/news/2025/10/31/illinois-immigration-protests/",
    "source": "Bellingcat",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2025-10-31T18:58:48+00:00",
    "published_ts": 1761937128,
    "smart_groups": []
  },
  {
    "title": "Detect russian Attacks Targeting Ukraine: Hackers Apply the Custom Sandworm-Linked Webshell and Living-off-the-Land Tactics for Persistence",
    "summary": "Since a full-fledged war in Ukraine, russia-backed hacking collectives have intensified their malicious activity against Ukraine and its allies in the cyber front line to conduct espionage operations and cripple the critical systems. For instance, a nefarious Sandworm APT group (aka UAC-0082, UAC-0145, APT44) has been attacking Ukrainian organizations for over a decade, primarily targeting […] The post Detect russian Attacks Targeting Ukraine: Hackers Apply the Custom Sandworm-Linked Webshell and Living-off-the-Land Tactics for Persistence appeared first on SOC Prime .",
    "link": "https://socprime.com/blog/russian-hackers-target-ukrainian-organizations/",
    "source": "SOC Prime Blog",
    "type": "vendors",
    "type_label": "Vendors & Product Blogs",
    "published": "2025-10-31T16:50:15+00:00",
    "published_ts": 1761929415,
    "smart_groups": [
      "Threat Actors / APT"
    ]
  },
  {
    "title": "BGP zombies and excessive path hunting",
    "summary": "A BGP “zombie” is essentially a route that has become stuck in the Default-Free Zone (DFZ) of the Internet, potentially due to a missed or lost prefix withdrawal. We’ll walk through some situations where BGP zombies are more likely to rise from the dead and wreak havoc.",
    "link": "https://blog.cloudflare.com/going-bgp-zombie-hunting/",
    "source": "The Cloudflare Blog",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2025-10-31T15:30:00+00:00",
    "published_ts": 1761924600,
    "smart_groups": []
  },
  {
    "title": "Landmark civil penalty of AU$5.8 million issued under Australia’s Privacy Act",
    "summary": "Charmian Aw, Melissa B. Levine, and Ciara O’Leary of Hogan Lovells write: On 9 October 2025 the Federal Court of Australia (the Court) imposed an AU$5.8 million civil penalty on Australian Clinical Labs Limited, one of Australia’s largest private hospital pathology service providers (the Company), for systemic failures that led to the unauthorised access to... Source",
    "link": "https://databreaches.net/2025/10/31/landmark-civil-penalty-of-au5-8-million-issued-under-australias-privacy-act/?pk_campaign=feed&pk_kwd=landmark-civil-penalty-of-au5-8-million-issued-under-australias-privacy-act",
    "source": "DataBreaches.net",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2025-10-31T14:17:59+00:00",
    "published_ts": 1761920279,
    "smart_groups": [
      "Vulnerabilities / CVEs"
    ]
  },
  {
    "title": "How many courts have had sealed and sensitive files exposed by one vendor’s error?",
    "summary": "‏DataBreaches recently reported that researchers had discovered two courts had sealed filings and court records exposed, but the vendor responsible wasn’t responding to notifications. Despite months of trying to get a software vendor to respond to alerts that their clients’ files are exposed on the internet — including confidential and sealed court records — the... Source",
    "link": "https://databreaches.net/2025/10/31/how-many-courts-have-had-sealed-and-sensitive-files-exposed-by-one-vendors-error/?pk_campaign=feed&pk_kwd=how-many-courts-have-had-sealed-and-sensitive-files-exposed-by-one-vendors-error",
    "source": "DataBreaches.net",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2025-10-31T14:17:38+00:00",
    "published_ts": 1761920258,
    "smart_groups": [
      "Vulnerabilities / CVEs",
      "Data Breaches / Leaks"
    ]
  },
  {
    "title": "Ukrainian Conti Ransomware Suspect Extradited to US from Ireland",
    "summary": "Waqas reports: A Ukrainian national accused of helping run one of the world’s most damaging ransomware operations, Conti, is now in US custody. After being extradited from Ireland, 43-year-old Oleksii Oleksiyovych Lytvynenko made his first court appearance in the Middle District of Tennessee to face charges tied to the Conti ransomware group. Prosecutors allege that... Source",
    "link": "https://databreaches.net/2025/10/31/ukrainian-conti-ransomware-suspect-extradited-to-us-from-ireland/?pk_campaign=feed&pk_kwd=ukrainian-conti-ransomware-suspect-extradited-to-us-from-ireland",
    "source": "DataBreaches.net",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2025-10-31T13:51:05+00:00",
    "published_ts": 1761918665,
    "smart_groups": [
      "Ransomware",
      "Vulnerabilities / CVEs"
    ]
  },
  {
    "title": "Legal Aid Agency chief admits difficulties understanding impact of cyberattack",
    "summary": "Jim Dunton reports: The chief executive of the Legal Aid Agency has told MPs that the organisation is still working out the extent of a cyberattack that was uncovered back in the spring. Jane Harbottle told members of parliament’s Public Accounts Committee that a team of analysts is still exploring how much of the compromised... Source",
    "link": "https://databreaches.net/2025/10/31/legal-aid-agency-chief-admits-difficulties-understanding-impact-of-cyberattack/?pk_campaign=feed&pk_kwd=legal-aid-agency-chief-admits-difficulties-understanding-impact-of-cyberattack",
    "source": "DataBreaches.net",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2025-10-31T13:49:57+00:00",
    "published_ts": 1761918597,
    "smart_groups": [
      "Vulnerabilities / CVEs"
    ]
  },
  {
    "title": "Transnational Organized Crime Gang Steals $1 Million from Ontario Couple",
    "summary": "Today my LinkedIn feed and Google News filter is showing me several stories that illustrate how we are failing to stop online scammers from stealing from our elderly. It starts with the headlines. CTVNews : Ontario seniors GIVE AWAY MORE THAN $1 MILLION to scammers. CTVNews: Ontario couple LOSES MORE THAN $1 MILLION DOLLARS to fraud. Toronto Only : A couple ... LOST MORE THAN $1 MILLION Daily Mail : Elderly couple transfer $1m to online scammers despite warning from bank The tone of several of these stories, is victim shaming and leads with the wrong headline. They didn't \"Give away\" or \"Lose\" or \"Transfer\" these funds. They were STOLEN FROM THEM. Illicit Call Centers: \"Facebook Pop-Ups\" One of the ways that we learn about how these scams play out is that we engage with scammers. I'm not a professional scam baiter or anything close to it, but it is a useful research tool. When I read the story of the Ontario couple, I knew exactly the type of script that was being followed, because I experienced it last month. Usually when I call an illicit call center on purpose, I am asked very quickly to give remote control of my computer to the scammers. But one day last month, the call followed a very different script than the primary ones to which I am accustomed. It started with a Facebook advertisement. In the top right corner of my Facebook homepage, I had two advertisements displayed: The goal of these advertisements is to make a less than wary Facebook user believe that they have unread messages that need to be attended to. I actually wrote a longer piece for LinkedIn about this type of advertisement about six months ago. See: \" Dangerous Facebook Ads and Call Center Scams \" on my LinkedIn page. In this case, the \"vendor\" who is providing the Facebook Ads portion of this scam is almost certainly operating from Vietnam. Crime is global. Who knew? Clicking the ad, in the incident that I experience on October 17, 2025, led to exactly the same next steps as the ones I reported on April 24, 2025. A fake \"Facebook Suspended\" page (hosted on web.core.windows[.]net) Whether you choose \"Accept\" or \"Ignore\" on this page, the next thing that happens is that your browser goes \"Full Screen\" and begins to play an audio warning on loop while displaying this Warning Page: Mouse clicking is disabled while an audio warning tells us our Facebook account is going to be deleted if we don't call the indicated number immediately. I know that I can \"Alt-F4\" out of this message, but many users would not know how to do so. According to our friends at URLScan.io, they have received reports of the \"Facebook Suspended\" intermediate page in the scam delivery using 933 different URLs, most recently, today. After a huge spike from November 2024 to January 2025, there has been a constant trickle of these nearly every day since ... often using Microsoft Azure nodes. URLScan.io statistics on this page. Checking the Meta Ad Library, it is easy to see that a new round of these ads launched on October 29, 2025 (two days ago): The new ads redirect through a slightly different intermediary page (I have an incoming call from a pretty girl) and then tell me that \"Microsoft Care has temporarily disabled your Internet connection\" and that I need to call or my \"Facebook and Internet accounts will be permanently disabled.\" new intermediary page new BSOD page as of 31OCT2025 Illicit Call Centers: Qualifying and \"Recruiting\" When I placed my call to the scammers on October 17th, I have to admit to being a bit inspired by \" Scammer Payback \" as I had recently written about his work in breaking up a $65 Million Crime Ring . I wrote about it in my post \" Indian Call Center Scammers Partner with Chinese Money Launderers \" on this blog. Following Pierogi's lead, I answered the scammers questions as if I were a retiree. (Don't let the grey beard fool you, I'm not!) The first thing the scammers had me do was to power off my computer. (I was playing an MP3 of their scam audio so they believed I was still on their \"lock screen.\") They asked me \"Is this your own computer? or a work computer?\" I answered \"Work computer? Heavens no! I haven't worked in years!\" Then they asked me \"Do you know what an IP address is?\" I answered \"No, I've never heard of an IT address, but my grandson works in IT ... is this related to him?\" They gave me a very poor explanation of what an IP address is and then asked who my Internet carrier was. I lied and told them a carrier that doesn't even offer services in my area. They \"put me on a brief hold\" during which I could hear people talking in Hindi to one another. Then they came back and said \"Yes, I see that your IP address is under investigation by (imaginary carrier)!\" Then they asked me where I banked (I lied again) and whether I had an investment account (I lied again.) After putting me on another hold, they came back and said that my bank account was also under investigation. After a few minutes, they came back and said (in a very grave voice) that unfortunately, I was under suspicion for distributing \"child pornography\" (an obsolete and inappropriate term for Child Sexual Abuse Materials). Unfortunately, they had no choice but to turn this matter over to the FBI. Please hold as they were going to transfer me to the FBI Agent then. As I denied having any involvement in CSAM materials, the FBI Agent very sternly yelled at me and asked me for my ZIP Code. Unfortunately I had a meeting to attend about then, so I disengaged, but I know the rest of that script. The ZIP Code is so that they can look up the address of the nearest Bitcoin ATM from my house. This is the BEGINNING of what happened to \"the Ontario Couple\" (only of course they were speaking to a Royal Canadian Mounted Police Agent, rather than an FBI Agent.) We have assisted in several of these cases -- twice involving the elderly relatives of my own students -- who were convinced over the course of many phone calls over many days -- that they needed to withdraw their cash from the bank, and in one case, put the cash in an overnight delivery box and ship it to a CVS store in the Chicago area. Why would they do that? Because the FBI, convinced of their innocence, had asked their permission to use their bank account for a \"sting\" against a Mexican Drug Cartel. The \"FBI Agent\" in one case made them take an imaginary oath, similar to the oath one would take when being sworn into military service, that as part of the FBI's Undercover Operation, they were not allowed to speak to anyone about their secret mission. Doing so would result in them being arrested and charged with Obstruction of Justice. So when the bank says \"Why are you withdrawing this money?\" and they reply \"Because I've decided to invest in Gold Bars\" they are not \"ignoring the warning of the bank\" they are \"following their orders as a sworn undercover agent assisting the FBI in breaking up a drug cartel!\" In the Ontario couple's case, the psychological oppression and manipulation continued for FIVE MONTHS as they had their money slowly stolen by a TransNational Organized Crime group who has perfected the art of manipulation. And in that scenario, the Daily Mail and CTV want to broadcast that these fools gave their money away to criminals despite the bank's warning and they want YOU to believe that is what happened. Shame on them! Illicit Call Centers: Crime-As-A-Service (via Facebook) How do these types of crimes begin? To understand, it is necessary to start taking apart the illicit call center Crime-as-a-Service model that operates via Facebook Groups. We've been talking about these for nearly a decade now and they are more active now than ever before. Here's an example of a scammer boasting that he offers calls on a \"Pay Per Call\" model for a variety of fraud types. Facebook, Blue Screen of Death, Amazon, and PayPal. His point in sharing the Call Duration is to indicate that his calls are \"sticky.\" That is, they are likely to have a long enough conversation to \"sink the hook.\" Calls from 1308 seconds (21 minutes) to 4765 seconds (79 minutes!) are likely to have been believable enough that there is time to have taken the scam to a financially rewarding level. \"Sounds\" posted their advertisements in groups such as: all about tech support Genuine Techsupport calls and blocking Tech support calls PPC Expert for Tech Support PPC Services for Tech Support Tech Support Genuine Calls Kolkata/Delhi Tech Support Calls Delhi/Noida/Chandigarh Every piece of the criminal infrastructure needed to run these scams is available in this Crime-as-a-Service Facebook groups. Whatever your Illicit Call Center needs, they can provide it. Toll Free Numbers? Fake invoices sent via PayPal? Cash Pickup services in USA and Canada? Zelle accounts to use for money laundering? And of course as we have already mentioned, the Chinese Money Laundering Organizations are now offering their services inside the Indian Call Center CaaS Facebook groups as well ... (+852 = Hong Kong) \"Kevin\" is in the Facebook groups that are more dedicated to the money laundering side of these transnational organized crime operations. Groups like: Venmo,varo,paypal,zelle,cash PayPal, Venmo And Cash App Verification - 11,400 members Paypal | Venmo | Zelle | G-Pay 24/7 Support - 2,100 members That largest group has been \"frozen by Admin\" after we reported the popular \"BuyAccounts\" service that was offering to sell stolen bank accounts and advertiser accounts: \"Norman Mike\" was advertising an Indian telephone number despite attending the University of Johannesburg, living in London, and having an American flag as their cover image. https://www.facebook.com/norman.mike.7528/ I'll be sure to post an update on what happens when we suggest to Facebook that Norman Mike may be a fake account! Illicit Call Centers: STOP BLAMING THE VICTIM! In this Crime-as-a-Service Infrastructure, criminals like the Vietnamese programmers who place the Facebook ads work with Indian \"Lead Generators\" who promise to send \"Facebook Pay Per Call\" telephone calls from potential victims to Illicit call centers in India and Pakistan, who use Pakistani-provided Toll Free Numbers to make connection, and then use Chinese Money Laundering Organizations to pick up their cash, could we agree that perhaps things are a bit more complicated than our average Ontario pensioner is able to tackle by themselves? When the Illicit Call Center's scripts and practices qualify the victim as an elderly high wealth pensioner and they are \"recruited by the FBI or RCMP\" it is entirely insufficient for the bank to say \"Sir, this may be a scam\" and then boast to the media how they provided an adequate warning!",
    "link": "https://garwarner.blogspot.com/2025/10/transnational-organized-crime-gang.html",
    "source": "CyberCrime & Doing Time",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2025-10-31T13:20:00+00:00",
    "published_ts": 1761916800,
    "smart_groups": [
      "Windows / Microsoft",
      "Cloud / SaaS"
    ]
  },
  {
    "title": "New! Magnet Certification Preparation",
    "summary": "We’re excited to announce the launch of Magnet Certification Preparation —a new series of reinforcement training designed to help qualified students confidently prepare for their certification exams. The post New! Magnet Certification Preparation appeared first on Magnet Forensics .",
    "link": "https://www.magnetforensics.com/blog/new-magnet-certification-preparation/",
    "source": "Magnet Forensics",
    "type": "dfir",
    "type_label": "DFIR & Forensics",
    "published": "2025-10-31T13:17:44+00:00",
    "published_ts": 1761916664,
    "smart_groups": [
      "Vulnerabilities / CVEs"
    ]
  },
  {
    "title": "Go and enhance your calm: demolishing an HTTP/2 interop problem",
    "summary": "HTTP/2 implementations often respond to suspected attacks by closing the connection with an ENHANCE_YOUR_CALM error code. Learn how a common pattern of using Go's HTTP/2 client can lead to unintended errors and the solution to avoiding them.",
    "link": "https://blog.cloudflare.com/go-and-enhance-your-calm/",
    "source": "The Cloudflare Blog",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2025-10-31T13:00:00+00:00",
    "published_ts": 1761915600,
    "smart_groups": []
  },
  {
    "title": "How are you managing cloud risk?",
    "summary": "Learn why managing cloud risk demands unified visibility, continuous risk assessment, and efficient security operations. Discover how a full-featured CNAPP like Trend Vision One™ Cloud Security enables organizations to move from reactive to proactive cloud protection.",
    "link": "https://www.trendmicro.com/en_us/research/25/j/manage-cloud-risk.html",
    "source": "Trend Micro Simply Security",
    "type": "vendors",
    "type_label": "Vendors & Product Blogs",
    "published": "2025-10-31T00:00:00+00:00",
    "published_ts": 1761868800,
    "smart_groups": []
  }
]