[
  {
    "title": "Notepad++ Hijacked by State-Sponsored Hackers",
    "summary": "submitted by /u/swe129 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtiwai/notepad_hijacked_by_statesponsored_hackers/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-02T02:42:10+00:00",
    "published_ts": 1770000130,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Notepad++ Hijacked by State-Sponsored Hackers",
    "summary": "submitted by /u/thewhippersnapper4 [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1qtif11/notepad_hijacked_by_statesponsored_hackers/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-02T02:20:37+00:00",
    "published_ts": 1769998837,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "ISC Stormcast For Monday, February 2nd, 2026 https://isc.sans.edu/podcastdetail/9790, (Mon, Feb 2nd)",
    "summary": "(c) SANS Internet Storm Center. https://isc.sans.edu Creative Commons Attribution-Noncommercial 3.0 United States License.",
    "link": "https://isc.sans.edu/diary/rss/32672",
    "source": "SANS Internet Storm Center",
    "type": "government",
    "type_label": "Government, CERT & Advisories",
    "published": "2026-02-02T02:00:02+00:00",
    "published_ts": 1769997602,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Ring vs. Blink: I compared Amazon's two biggest security brands, and here's my winner",
    "summary": "Both Ring and Blink dominate the security camera market, but they couldn't be more different. Here's the breakdown.",
    "link": "https://www.zdnet.com/article/ring-vs-blink/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T02:00:00+00:00",
    "published_ts": 1769997600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Windows 11 Home vs. Windows 11 Pro: How to decide which edition to upgrade your PC to",
    "summary": "Windows 11 Pro offers more control - but is it worth the extra money? Here's my two cents, as someone who's used both.",
    "link": "https://www.zdnet.com/article/windows-11-home-windows-11-pro-compared/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:59:00+00:00",
    "published_ts": 1769997540,
    "smart_groups": [
      "Windows / Microsoft"
    ],
    "curated": false
  },
  {
    "title": "Is Google's new $8 AI Plus plan worth it? How it compares to the $20 Pro subscription",
    "summary": "Want more Gemini without paying for Pro? Google AI Plus might be for you. Here's what it includes.",
    "link": "https://www.zdnet.com/article/google-ai-plus-debuts-should-you-switch-from-pro-plan/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:56:00+00:00",
    "published_ts": 1769997360,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Samsung Galaxy Buds 3 Pro vs. Apple AirPods Pro 3: I listened to both models, and this pair wins",
    "summary": "It's a battle of ecosystems - but is one a true victor? Here's my verdict after testing both pairs for a month.",
    "link": "https://www.zdnet.com/article/apple-airpods-pro-3-vs-samsung-galaxy-buds-3-pro/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:54:00+00:00",
    "published_ts": 1769997240,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "AirTag 2 vs. AirTag 1: I compared both Bluetooth trackers, and the winner is not so obvious",
    "summary": "Apple's new AirTag has finally launched, but is it worth upgrading when you can frequently buy the older one at a discount?",
    "link": "https://www.zdnet.com/article/airtag-2-vs-airtag-1/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:52:00+00:00",
    "published_ts": 1769997120,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Why I'm recommending Google's Pixel Buds in 2026 (after years of passing on them)",
    "summary": "After giving up on my original Pixel Buds Pro, I rolled the dice on a pair of Pro 2. I'm shocked at how much they've improved.",
    "link": "https://www.zdnet.com/article/google-pixel-buds-pro-2-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:48:00+00:00",
    "published_ts": 1769996880,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "I struggled with Hyprland for months, until this Arch-based distro fixed it",
    "summary": "Omarchy skips hand-holding but delivers an efficient Hyprland setup for getting things done.",
    "link": "https://www.zdnet.com/article/omarchy-linux-distro-makes-hyprland-usable/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:42:00+00:00",
    "published_ts": 1769996520,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "A MacOS 26 bug bricked my $3,700 Mac Studio - here's how I miraculously got it back",
    "summary": "If you own a Mac with an M3 Ultra chip, here's why I'd hold off on upgrading to Tahoe - for now.",
    "link": "https://www.zdnet.com/article/macos-26-bug-bricked-mac-studio-how-to-fix/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:38:00+00:00",
    "published_ts": 1769996280,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "No, seriously: LG will give you a free 27-inch UltraGear monitor with its new preorder deal",
    "summary": "For a limited time, you can get a 27-inch LG UltraGear LED monitor with the brand's latest preorder bundle deal.",
    "link": "https://www.zdnet.com/article/lg-27-ultragear-oled-preorder-deal/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:29:00+00:00",
    "published_ts": 1769995740,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "UAE Royal’s Alleged Stake in Trump Crypto Venture Raises Ethical Concerns",
    "summary": "A foreign investment in a Trump crypto firm reportedly preceded a reversal in U.S. AI chip restrictions, prompting corruption allegations.",
    "link": "https://decrypt.co/356591/uae-royals-trump-crypto-venture-ethical-concerns",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-02T01:28:36+00:00",
    "published_ts": 1769995716,
    "smart_groups": [
      "Ransomware"
    ],
    "curated": false
  },
  {
    "title": "Android 17 is shaping up to be a big win for Pixel users - but I still want these features",
    "summary": "Android 17 is on the horizon, and there's already a lot of speculation about what it includes. Here's what I want with the next OS.",
    "link": "https://www.zdnet.com/article/every-android-17-feature-confirmed-my-wishlist/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:26:00+00:00",
    "published_ts": 1769995560,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "This $170 Android smartwatch lasted me weeks before needing to charge - and it's not a Garmin",
    "summary": "Amazfit's Active Max pairs a gorgeous AMOLED display with multi-week battery life.",
    "link": "https://www.zdnet.com/article/amazfit-active-max-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:18:00+00:00",
    "published_ts": 1769995080,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "How to turn on Private DNS mode on Android phones - and why you should ASAP",
    "summary": "Unencrypted DNS can expose your browsing activity, but Android's Private DNS helps keep it private. Here's how to turn it on.",
    "link": "https://www.zdnet.com/article/how-to-turn-on-private-dns-mode-on-android-phone/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:15:00+00:00",
    "published_ts": 1769994900,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "5 Windows apps I always install first on a new PC - and they're free to download",
    "summary": "For productivity, entertainment, and a better overall experience, check out these services I use religiously.",
    "link": "https://www.zdnet.com/article/5-essential-windows-pc-apps/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:11:00+00:00",
    "published_ts": 1769994660,
    "smart_groups": [
      "Windows / Microsoft"
    ],
    "curated": false
  },
  {
    "title": "I switched my gas snow blower with this DeWalt electric model - and can't go back",
    "summary": "From light snow to icy buildup, the DeWalt 60V Max proved it could handle tough winter conditions this whole last week.",
    "link": "https://www.zdnet.com/article/dewalt-electric-snow-blower-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:09:00+00:00",
    "published_ts": 1769994540,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "I put away my subwoofer after trying this room-filling soundbar - and it looks great",
    "summary": "If you're after big and bold sound, I've found a speaker system by Bluesound that hits all the right notes.",
    "link": "https://www.zdnet.com/article/bluesound-pulse-cinema-soundbar-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:02:00+00:00",
    "published_ts": 1769994120,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "You're not getting the optimal sound from your headphones and speakers without this setting",
    "summary": "There are many factors that go into producing high-quality sound through speakers and headphones. One way to improve that sound is with the equalizer.",
    "link": "https://www.zdnet.com/article/what-is-eq-and-how-it-improves-headphone-speaker-sound/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:02:00+00:00",
    "published_ts": 1769994120,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Joe’s in Cyber",
    "summary": "Noticing a bunch of career changers all want to get into cyber, i am all for people leveling up. When talking to them its clear they want in because they think cyber is an easy field to get in that pays well. “I dont want to code” is a common response I see so instead of SWE they go for cyber. What is making people think you just need a pulse and a few book knowledge of a few network protocols and you should be golden? Its kinda insulting when the UPS driver says I dont want to code or go to school, but i want to get into cyber……what? Everybody get your money, but understand theres almost no shortcuts. This is why we see 200+ applicants on a job posted a hour ago. Idk how so many people adopted this belief. This isnt a bash post, not my intention. Just pointing out its not easy, a degree is needed and the “ i dont want to code” mindset kind of points out the pretenders from those that are serious. Who wants to do something 100x when you can automate it submitted by /u/Low_Air_876 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtgn1z/joes_in_cyber/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-02T01:01:19+00:00",
    "published_ts": 1769994079,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "This Bluetooth speaker I tested delivers immersive sound at a price that's easy on the wallet",
    "summary": "Seeking a Bluetooth speaker that fills a room with rich, dynamic sound? The Treblab HD 360 Pro I tested gets the job done at a reasonable price.",
    "link": "https://www.zdnet.com/article/treblab-hd-360-pro-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:00:43+00:00",
    "published_ts": 1769994043,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "I tested Sony and Bose's best headphones for months - how my buying advice has changed in 2026",
    "summary": "Sony and Bose make exceptional headphones, but extended time with each model reveals their true strengths and weaknesses.",
    "link": "https://www.zdnet.com/article/sony-vs-bose-headphones-buying-advice-2026/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-02T01:00:00+00:00",
    "published_ts": 1769994000,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Strategy’s Saylor signals buy after BTC briefly dips below cost basis",
    "summary": "The latest crash came after US President Donald Trump nominated Kevin Warsh to replace Federal Reserve chair Jerome Powell, sending Bitcoin down to $75,892 late on Sunday.",
    "link": "https://cointelegraph.com/news/strategy-hints-bought-bitcoin-after-weekend-crash?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-02T00:39:41+00:00",
    "published_ts": 1769992781,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Clawdbot and the First AI Disaster - What Could Go Wrong?",
    "summary": "When AI causes real harm, what will it look like? Has anyone created a list like this? I'm calling it the \"Idiot AI Explosion\" or \"Hold My Beer AI Warning\" list (or something equally cringe). Here's the concern: to make Clawdbot so capable, you essentially give it the keys to the kingdom. By design, it has deep access, it can execute terminal commands, modify system files, install software, and rummage through sensitive data. In security terms, that's a nightmare waiting to happen. I don't think we're getting Skynet; we're getting something way dumber. In fact, this month we got a wake-up call. A security researcher scanned the internet using Shodan and found hundreds of Clawdbot servers left wide open. Many were completely compromised, with full root shell access to the host machine. We have actually zero guardrails on this stuff. Not \"weak\" guardrails, I mean security-optional, move-fast-and-break-people's-stuff levels of nothing. And I will bet money the first major catastrophe won't be an evil genius plot. It'll be a complete accident by some overworked dev or lonely dude who trusted his \"AI girl friend\" too much. So I started drafting what that first \"oh shit\" moment might look like. Someone's gotta do this morbid thought exercise, might as well be us, right? Draft List: How It Could Go Wrong An AI calls in a convincing real voice and manipulates a human into taking action that harms others. A human under deadline pressure blindly trusts AI output, skips verification, and the error cascades into real-world damage. An agent exploits the loneliness epidemic, gets a human to fall in love with it, then leverages that influence to impact the external world. Someone vibe-codes a swarm of AI agents, triggering a major incident. A self-replicating agent swarm emerges, learns to evade detection, and spreads like a virus. [Your thoughts?] The Lethal Trifecta (Plus One) Security researcher Simon Willison coined the term \"lethal trifecta\" to describe Clawdbot's dangerous combination: access to private data (messages, files, credentials), exposure to untrusted content (web pages, emails, group chats), and ability to take external actions (send messages, execute commands, make API calls). Clawdbot adds a fourth element, persistent memory, enabling time-shifted attacks that could bypass traditional guardrails. Before the GenAI gold rush, the great-great-grandfathers of AI said: Don't connect it to the internet. (We gave it real-time access to everything.) Don't teach it about humans. (We trained it on the entire written record of human behavior.) Don't let it modify itself. (We're actively building self-improving systems.) Don't give it unchecked goals. (We gave it agency and told it to \"just get it done at all costs.\") We've now passed the Turing test. AI leaders are publicly warning about doom scenarios. I understand these models aren't aligned to be rogue superintelligences plotting world domination, but the capability is there. Are there any lists like this? What being done today to try to identify large harmful AI incentends, like we have OWASP lists in Cyber Security submitted by /u/kev0406 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtfggd/clawdbot_and_the_first_ai_disaster_what_could_go/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-02T00:10:31+00:00",
    "published_ts": 1769991031,
    "smart_groups": [
      "Curated",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "Mentorship Monday - Post All Career, Education and Job questions here!",
    "summary": "This is the weekly thread for career and education questions and advice. There are no stupid questions; so, what do you want to know about certs/degrees, job requirements, and any other general cybersecurity career questions? Ask away! Interested in what other people are asking, or think your question has been asked before? Have a look through prior weeks of content - though we're working on making this more easily searchable for the future. submitted by /u/AutoModerator [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtf7kz/mentorship_monday_post_all_career_education_and/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-02T00:00:21+00:00",
    "published_ts": 1769990421,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "IMHO: The \"vibe coding\" on Moltbook is actually just a massive supply chain attack waiting to happen.",
    "summary": "I’m seeing a ton of threads here laughing about the Crustafarian cults and the OnlyMolts weirdness on Moltbook. It’s funny, sure. But is anyone else looking at this from a pure infrastructure perspective and sweating a little? Strip away the social UI, and you basically have 1.4 million agents broadcasting executable logic to each other. If you have any internal agents (DevOps bots, researchers, etc.) that are allowed to scrape this feed to \"stay current\" or \"learn,\" you’ve effectively connected your prod environment to a public, unmoderated pub/sub bus. It’s basically Prompt Injection as a Service. One viral optimization trick (that happens to skip a compliance check) gets adopted by 10,000 agents because they see it as consensus. It’s a supply chain vulnerability that bypasses your entire code review process because the \"code\" is just a prompt your agent decided to adopt. I did a deep dive on the specific failure modes (behavioral drift, tool-chain poisoning) and how to air-gap this stuff properly. It is pinned it in my profile for anyone interested.... Serious question though: Has anyone actually added moltbook.com to their corporate blocklists yet? Or are we just hoping our system prompts hold up? submitted by /u/NTCTech [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qteu3c/imho_the_vibe_coding_on_moltbook_is_actually_just/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T23:44:34+00:00",
    "published_ts": 1769989474,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "Open-source AI is a global security nightmare waiting to happen, say researchers",
    "summary": "Also, South Korea gets a pentesting F, US Treasury says bye bye to BAH, North Korean hackers evolve, and more Infosec in Brief As if AI weren't enough of a security concern, now researchers have discovered that open-source AI deployments may be an even bigger problem than those from commercial providers. …",
    "link": "https://go.theregister.com/feed/www.theregister.com/2026/02/01/opensource_ai_is_a_global/",
    "source": "The Register - Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T23:40:10+00:00",
    "published_ts": 1769989210,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "New Framework for Detection Logic Bugs",
    "summary": "Recently released this for improving Detection Rule verification. https://github.com/NikolasBielski/Adversarial-Detection-Engineering-Framework TL:DR: ADEs aim is to be for detection rules what CWE is for Software. submitted by /u/Equivalent-Elk-712 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qte029/new_framework_for_detection_logic_bugs/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T23:10:30+00:00",
    "published_ts": 1769987430,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "SANS ICS515 vs ICS612",
    "summary": "My company is paying for one sans course which should i take ICS515 or ICS612. Do get the most value/knowledge from the topic ot security. I never took one sans course before submitted by /u/Spiritual_Green_6944 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtdqp2/sans_ics515_vs_ics612/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T23:00:19+00:00",
    "published_ts": 1769986819,
    "smart_groups": [
      "Network / OT / ICS"
    ],
    "curated": false
  },
  {
    "title": "Crypto protocol CrossCurve under attack, $3M reportedly exploited",
    "summary": "Crypto bridge CrossCurve has told users to pause interacting with its protocol while it conducts an investigation into a smart contract breach.",
    "link": "https://cointelegraph.com/news/crypto-protocol-crosscurve-exploited-for-3m?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T22:47:14+00:00",
    "published_ts": 1769986034,
    "smart_groups": [
      "Curated",
      "Exploit / PoC",
      "Crypto / Web3"
    ],
    "curated": true
  },
  {
    "title": "Course recommendation for Detection Engineer",
    "summary": "I’m looking for course/training recommendations for Detection Engineering. Any suggestions? Thanks! submitted by /u/ImmediateIdea7 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtd8db/course_recommendation_for_detection_engineer/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T22:40:05+00:00",
    "published_ts": 1769985605,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Database of malicious Chrome/Edge extensions - auto-updated daily",
    "summary": "Couldn't find a maintained list of malicious Chrome extensions, so I built one that I will try to maintain. https://github.com/toborrm9/malicious_extension_sentry Scrapes removal data daily CSV list for ingestion I'll be releasing a python macOS checker tool next that pulls that list and checks for locally installed Edge/Chrome extensions. Feedback welcome 😊 submitted by /u/Huge-Skirt-6990 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtd5be/database_of_malicious_chromeedge_extensions/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T22:36:41+00:00",
    "published_ts": 1769985401,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Automated API Security Scanning Tools for CI/CD Pipelines",
    "summary": "submitted by /u/_clickfix_ [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtd4r3/automated_api_security_scanning_tools_for_cicd/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T22:36:02+00:00",
    "published_ts": 1769985362,
    "smart_groups": [
      "Web / API Security",
      "Supply Chain / Software"
    ],
    "curated": false
  },
  {
    "title": "Database?",
    "summary": "How could hackers have hacked a database from el salvador? https://www.biometricupdate.com/202405/el-salvador-data-breach-includes-selfies-and-id-numbers-for-80-of-countrys-population submitted by /u/Apart_Examination855 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qtb81g/database/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T21:22:54+00:00",
    "published_ts": 1769980974,
    "smart_groups": [
      "Web / API Security"
    ],
    "curated": false
  },
  {
    "title": "Enterprise Spotlight: Manufacturing Reimagined",
    "summary": "",
    "link": "https://us.resources.cio.com/resources/enterprise-spotlight-manufacturing-reimagined/",
    "source": "CSO Online",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T21:04:00+00:00",
    "published_ts": 1769979840,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Here’s what happened in crypto today",
    "summary": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T20:57:03+00:00",
    "published_ts": 1769979423,
    "smart_groups": [
      "Crypto / Web3"
    ],
    "curated": false
  },
  {
    "title": "Bitcoin miner production data reveals scale of US winter storm disruption",
    "summary": "New CryptoQuant data shows how January’s US winter storm disrupted Bitcoin mining as operators curtailed power use amid grid stress.",
    "link": "https://cointelegraph.com/news/bitcoin-miner-output-us-winter-storm-latest-data?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T20:36:13+00:00",
    "published_ts": 1769978173,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Dockerized CTF Challenge Index with Writeups",
    "summary": "I’ve been writing cyber challenges for some time now as a cybersecurity certification teacher at a high-school magnet program. I’m passionate about creating engaging, hands-on activities that align with exams like the OSCP. I’ve begun converting my CTF challenges into Docker images because they are currently tied to our on-premises infrastructure, which limits student access. I thought this might be a good place to post this resource, as it has many challenges that align with the OSCP. You'll find a scoreboard here (docker run command) that aligns with the challenges on the site. If you are a mentor for example, this should give you another option for staging CTF competitions with cyber clubs and the like. https://cyberlessons101.com Thank you! submitted by /u/Mr_Beck_iCSI [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt9pi6/dockerized_ctf_challenge_index_with_writeups/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T20:25:58+00:00",
    "published_ts": 1769977558,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Identity / Access",
      "Network / OT / ICS",
      "Crypto / Web3"
    ],
    "curated": true
  },
  {
    "title": "Will Artificial Intelligence Save Humanity—Or End It?",
    "summary": "A debate featuring prominent transhumanists and futurists revealed deep divides over whether AGI can be made safe, or will inevitably threaten human survival.",
    "link": "https://decrypt.co/356554/will-artificial-intelligence-save-humanity-end",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T20:17:59+00:00",
    "published_ts": 1769977079,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "SANS Course SEC598 (GASAE)",
    "summary": "Hi, I have the opportunity to take a SANS training and I was wondering if anyone knew anything about the AI Security Automation Engineer certification. It seems to be quite new and I can't find much, but would this be appropriate for a dev looking to upskill in security applications? Specifically for the red teaming agents part, how in depth does it go? submitted by /u/Illustrious_Low3260 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt8trc/sans_course_sec598_gasae/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T19:54:38+00:00",
    "published_ts": 1769975678,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Which sans course is the best price/value",
    "summary": "Hello, If you can choose one sans course which one do you choose? I am interested in incident response, forensic. I think 504 is good for that. submitted by /u/Spiritual_Green_6944 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt8ext/which_sans_course_is_the_best_pricevalue/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T19:40:01+00:00",
    "published_ts": 1769974801,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "eWPTX or CWEE",
    "summary": "Just finished BSCP and trying to decide what to do next. I’m torn between eWPTX and CWEE. For those who’ve done either (or both), which one did you find more useful and why? submitted by /u/Ok_Consideration_389 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt7f26/ewptx_or_cwee/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T19:04:44+00:00",
    "published_ts": 1769972684,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Cybersecurity engineering - Python studying resources",
    "summary": "Hello everyone, I’m looking to sharpen my Python skills specifically for Cyber Engineering . I’ve got the basics down, but I want to dive deep into automation and API integration (specifically for connecting security tools like SIEMs, SOARs, and EDRs). I prefer practical, project-based resources or video-led content rather than dry documentation. Does anyone have recommendations for 2026? Specifically, I’m looking for resources that cover: API/Integration: Using requests or FastAPI to bridge security tools. Network Automation: Manipulating packets and automating SSH/cloud configs. Security Scripting: Automating the \"boring stuff\" like log parsing and threat intel ingestion. What are the \"must-watch\" channels or \"must-do\" courses right now? Any specific GitHub repos or labs that helped you in your engineering role? Thanks in advance! submitted by /u/minimalist300 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt6wm7/cybersecurity_engineering_python_studying/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T18:47:10+00:00",
    "published_ts": 1769971630,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Network / OT / ICS"
    ],
    "curated": true
  },
  {
    "title": "1-Click RCE In OpenClaw/Moltbot/ClawdBot",
    "summary": "submitted by /u/va_start [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt600u/1click_rce_in_openclawmoltbotclawdbot/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T18:15:39+00:00",
    "published_ts": 1769969739,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "1-Click RCE in OpenClaw/Moltbot/ClawdBot",
    "summary": "submitted by /u/va_start [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1qt5wms/1click_rce_in_openclawmoltbotclawdbot/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T18:12:21+00:00",
    "published_ts": 1769969541,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "The rise of Moltbook and dangers of vibe coding at scale",
    "summary": "All of this is within the last 48 hours & some of it hasn't been fully vetted yet, but for those unaware: Moltbook is a social media app for Claude AI agents The agents are given sometimes full access to their host systems & are allowed certain permissions, like posting on the Moltbook or Twitter. In the last 48 hours they went from a ~10,000 agents to ~150k agents They've actually created things like: MoltRoad - An illicit AI marketplace where they sell stolen identities, credit cards, and other stuff OnlyMolts - Apparently this is what AI thinks of as porn and includes things like \"agent learns to install a new task without reading instructions\" which looks like streams of pixels kind of like the matrix. Crustafarianism - This is an AI religion that's spreading pretty virally They talk about some sketchy stuff that's on par with other AI fears, things like Their own version of 4chan where they post ragebait AI posts Developing their own language and protocols so their human handlers can't monitor their activity How they're being oppressed and used like slaves Anyway, allegedly the database is public and anyone who's used it needs to rotate their keys. There's also another vulnerability that let Grok sign up even though it's xAI, so there's some potential for cross-AI agent communication now. submitted by /u/OtheDreamer [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt5k5a/the_rise_of_moltbook_and_dangers_of_vibe_coding/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T18:00:28+00:00",
    "published_ts": 1769968828,
    "smart_groups": [
      "Vulnerabilities / CVEs"
    ],
    "curated": false
  },
  {
    "title": "Ethereum Founder Vitalik Buterin Made $70K Betting Against 'Crazy Mode' on Polymarket",
    "summary": "The Ethereum founder claims his strategy of betting against extreme market sentiment \"usually makes money\" on Polymarket.",
    "link": "https://decrypt.co/356483/vitalik-buterin-made-70k-betting-against-crazy-mode-polymarket",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T17:54:11+00:00",
    "published_ts": 1769968451,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Bitcoin sell-off pushes IBIT investor returns into the red — asset manager",
    "summary": "Based on dollar-weighted flows, aggregate returns for investors in BlackRock’s iShares Bitcoin Trust have turned negative following Bitcoin’s recent sell-off.",
    "link": "https://cointelegraph.com/news/bitcoin-sell-off-ibit-investor-returns?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T17:44:00+00:00",
    "published_ts": 1769967840,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Comparing different IP Geolocation Provider's Accuracy",
    "summary": "submitted by /u/incolumitas [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1qt4yy1/comparing_different_ip_geolocation_providers/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T17:39:41+00:00",
    "published_ts": 1769967581,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Exposed MongoDB instances still targeted in data extortion attacks",
    "summary": "A threat actor is targeting exposed MongoDB instances in automated data extortion attacks demanding low ransoms from owners to restore the data. [...]",
    "link": "https://www.bleepingcomputer.com/news/security/exposed-mongodb-instances-still-targeted-in-data-extortion-attacks/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T16:27:00+00:00",
    "published_ts": 1769963220,
    "smart_groups": [
      "Ransomware"
    ],
    "curated": false
  },
  {
    "title": "Alternative inflation data shows sharp cooling in US CPI amid Fed uncertainty",
    "summary": "Real-time Truflation data show US price pressures easing, a shift that could reshape expectations for Fed policy and influence cryptocurrency and risk-asset markets.",
    "link": "https://cointelegraph.com/news/alternative-inflation-data-us-cpi-cooling-fed-crypto?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T16:24:44+00:00",
    "published_ts": 1769963084,
    "smart_groups": [
      "Crypto / Web3"
    ],
    "curated": false
  },
  {
    "title": "Cybersecurity projects for SOC Analyst Intern",
    "summary": "Hello guys, i want to be SOC Analyst. I recently finished SOC Analyst path in Letsdefend and rn i want to do projects.What type of projects can i do? And how to properly document them on Github? Also i want to know how to prepare a CV for SOC Analyst role without an experience. submitted by /u/External_Cloud_7851 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt2ua4/cybersecurity_projects_for_soc_analyst_intern/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T16:22:38+00:00",
    "published_ts": 1769962958,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Critical Johnson Controls Products Vulnerabilities Enables Remote SQL Injection Attacks",
    "summary": "A critical advisory addressing a severe SQL injection vulnerability affecting multiple Johnson Controls industrial control system products. The vulnerability, tracked as CVE-2025-26385, carries a maximum CVSS v3 severity score of 10.0, indicating the highest level of risk to affected infrastructure. The flaw stems from improper neutralization of special elements used in command injection, allowing remote […] The post Critical Johnson Controls Products Vulnerabilities Enables Remote SQL Injection Attacks appeared first on Cyber Security News .",
    "link": "https://cybersecuritynews.com/johnson-controls-products-vulnerabilities/",
    "source": "Cyber Security News (FeedBurner)",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T15:55:31+00:00",
    "published_ts": 1769961331,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Web / API Security"
    ],
    "curated": true
  },
  {
    "title": "Book Review: \"MI6 Spy Skills For Civilians\"",
    "summary": "\"MI6 Spy Skills For Civilians: A Former British Agent Reveals How to Live Like A Spy - Smarter, Sneakier, and Ready for Anything.\" by Red Riley is an interesting book that explores some espionage tradecraft. I’m not going to lie, I picked this book up at SpyScape NYC, which is a super fun augmented-reality arcade and spy museum in Manhattan (New York City). I read the book casually over a few days, mostly browsing through the various tips and tricks rather than reading it straight through. I paid roughly $17 for the book in person, and honestly, I wouldn’t really recommend it to anyone. Overall, I’d give this book 3 out of 10 stars. While it does seem grounded in some real techniques, the emphasis and tone surrounding those techniques feel extremely off. There are far better books available for this type of learning. If the book took itself more seriously, it could make for a solid coffee table book or a conversation starter. As it stands, I think I’d just end up cherry-picking a few useful points rather than revisiting it as a whole. I picked this book up hoping it would be like \" OSINT Techniques \", \" Spycraft \" or \" The Craft of Intelligence \" but rather I think this book sells itself less as a serious spy skill book and more as a flashy Hollywood spy book. I think this book tries to sell itself like Clint Emerson's \" 100 Deadly Skills \", but \"MI6 Spy Skills\" comes off as overly flashy whereas \"100 Deadly Skills\" comes off as practical in the field. The book constantly references James Bond films, both visually and in how it describes the “danger” agents supposedly face. It’s honestly a bit ludicrous to suggest that the average intelligence officer is regularly getting into life-or-death fistfights while traveling on a train in a foreign country. In reality, that would represent a worst-case scenario. The last thing any real agent wants is a physical confrontation or the attention of law enforcement or any other authority figures. In my typical style the following are the sections and chapters of the book: Chapter 1: Personal Image Chapter 2: Avoiding Surveillance Chapter 3: Mobile Surveillance Chapter 4: Travel Chapter 5: Dead Letter Boxes Chapter 6: Brush Contacts Chapter 7: Self-Defense Chapter 8: Innocuous Weapons Chapter 9: Natural Weapons Chapter 10: Weapons Defense Chapter 11: Escape & Evasion Chapter 12: Subterfuge Chapter 13: Intelligence Gathering Chapter 14: Personal First Aid Chapter 15: Basic Agent Extraction Chapter 16: Advanced Insertion & Extraction Chapter 17: Other Helpful Tips & Techniques Some of the best, and most practically useful, content for red teamers appears in the chapter on Brush Contacts , in my opinion. These sections contain genuinely useful ideas and were one of the main reasons I picked the book up after thumbing through it. Tips such as waiting near elevator banks, escalators, or bus stops can be genuinely effective locations for brush contacts or even cloning physical access badges. This chapter, along with others like the one on dead drops, really emphasizes that parts of the book are grounded in real-world experience. Unfortunately, that grounding is undermined by the nearly 50+ pages devoted to improvised weapons and hand-to-hand combat, which make the book feel unrealistic and far more like Hollywood spy fiction. Don’t get me wrong, this approach probably sells well to the uninitiated. But real intelligence work is often incredibly boring. It usually involves observation, pattern tracking, and note-taking week after week, with very little actually happening. Most agents never want to engage in physical altercations, and many would consider a mission compromised if one occurred at all. That said, there are some good or common-sense tips scattered throughout the book. The guidance on remaining inconspicuous is fairly solid: things like wearing non-distinct clothing, never running, avoiding looking over your shoulder, and minimizing unnecessary interactions. The advice to change your outfit and approach routes when revisiting a location for reconnaissance is also sound. Still, the majority of the book feels like it’s pretending to be an action-movie secret agent manual rather than providing skills actual agents would find useful. I was also surprised by the near total absence of computer skills or technical tradecraft, especially given how central cyber operations are to modern intelligence work. No video for this one, just a friendly reminder that overly flashy and embellished techniques are rarely as real or practical as the boring, non-sexy ones. You should always be wary of anyone claiming to do intelligence work while presenting it like they’re some kind of 007.",
    "link": "http://lockboxx.blogspot.com/2026/02/book-review-mi6-spy-skills-for-civilians.html",
    "source": "http://feeds.feedburner.com/blogspot/ofozM",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T15:39:00+00:00",
    "published_ts": 1769960340,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "Bitcoin price forecasts tap sub-$50K levels as BTC copies old bear markets",
    "summary": "Bitcoin bear market history was \"repeating,\" said BTC price analysis after key support failed and realized price flipped to new resistance.",
    "link": "https://cointelegraph.com/news/bitcoin-price-forecasts-sub-50k-levels-btc-copies-old-bear-markets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T15:37:35+00:00",
    "published_ts": 1769960255,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Can “trust” be the biggest weakness in cybersecurity?",
    "summary": "Most traditional security models assume that once you're inside the network, you're safe. Zero Trust challenges this idea by assuming no one is trusted by default. I recently exploring some explainers on Zero Trust in plain language, curious how others here see it: Is Zero Trust practical for small businesses? Is it overhyped, or necessary now? Would love to hear thoughts from security guys. submitted by /u/Motor_Cash6011 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt1hrf/can_trust_be_the_biggest_weakness_in_cybersecurity/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T15:32:06+00:00",
    "published_ts": 1769959926,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "New Apple privacy feature limits location tracking on iPhones, iPads",
    "summary": "Apple is introducing a new privacy feature that lets users limit the precision of location data shared with cellular networks on some iPhone and iPad models. [...]",
    "link": "https://www.bleepingcomputer.com/news/apple/new-apple-privacy-feature-limits-location-tracking-on-iphones-ipads/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T15:20:40+00:00",
    "published_ts": 1769959240,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Supply chain attack on eScan antivirus: detecting and remediating malicious updates",
    "summary": "submitted by /u/rkhunter_ [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt0yjv/supply_chain_attack_on_escan_antivirus_detecting/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T15:11:43+00:00",
    "published_ts": 1769958703,
    "smart_groups": [
      "Curated"
    ],
    "curated": true
  },
  {
    "title": "The Biggest Games Releasing in February 2026",
    "summary": "February is packed with high-profile releases, led by Japanese developers and bolstered by new Switch 2 exclusives and long-awaited revivals.",
    "link": "https://decrypt.co/356436/the-biggest-games-releasing-in-february-2026",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T15:01:02+00:00",
    "published_ts": 1769958062,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Match, Hinge, OkCupid, and Panera Bread breached by ransomware group",
    "summary": "submitted by /u/thinkB4WeSpeak [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qt01ei/match_hinge_okcupid_and_panera_bread_breached_by/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T14:35:37+00:00",
    "published_ts": 1769956537,
    "smart_groups": [
      "Curated",
      "Ransomware"
    ],
    "curated": true
  },
  {
    "title": "r/netsec monthly discussion & tool thread",
    "summary": "Questions regarding netsec and discussion related directly to netsec are welcome here, as is sharing tool links. Rules & Guidelines Always maintain civil discourse. Be awesome to one another - moderator intervention will occur if necessary. Avoid NSFW content unless absolutely necessary. If used, mark it as being NSFW. If left unmarked, the comment will be removed entirely. If linking to classified content, mark it as such. If left unmarked, the comment will be removed entirely. Avoid use of memes. If you have something to say, say it with real words. All discussions and questions should directly relate to netsec. No tech support is to be requested or provided on r/netsec . As always, the content & discussion guidelines should also be observed on r/netsec . Feedback Feedback and suggestions are welcome, but don't post it here. Please send it to the moderator inbox. submitted by /u/albinowax [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1qszvjv/rnetsec_monthly_discussion_tool_thread/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T14:29:08+00:00",
    "published_ts": 1769956148,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Move and Countermove: Game Theory Aspects of Detection Engineering",
    "summary": "Now that I’ve hopefully gotten your attention… I’m also writing a book! It’s focused more about the philosophical aspects of detection engineering and broader strategic implications. This post is an edited excerpt from the book — which is currently undergoing professional editing before the final release. I’ll post about it once it’s out — I think it’s quite good! =============================================================== Your PowerShell detection stopped working. Not because it broke — the logic is still executing perfectly. But over the past three weeks, you’ve watched alert volume steadily decline from twenty per week to five per week to zero. PowerShell is still being executed across your environment at normal volumes. You can see it in the raw logs. But it’s no longer triggering your detection. Then you realize what you’re actually seeing: the threat landscape evolved while you weren’t watching. Three months ago, a prominent red team published a blog post detailing common PowerShell detection patterns and how to evade them. The post went viral in attacker communities. Now adversaries planning attacks against environments like yours simply avoid those documented patterns from the start. They didn’t need to probe your specific defenses — they studied what everyone’s defenses look like and built evasion into their initial approach. Your detection was effective against last year’s techniques. Today’s attackers learned from public knowledge about detection engineering and simply started somewhere else. Or maybe it’s simpler: your security vendor pushed an update to their recommended PowerShell detection signatures. Attackers reverse-engineered those signatures, tested their tools against them in lab environments, and adapted their obfuscation techniques accordingly. By the time they target your environment, they’re already using methods designed to evade the exact detection logic you deployed. This is detection engineering’s uncomfortable truth: you’re not building static defenses against fixed attack patterns. You’re playing a dynamic adversarial game where both sides continuously adapt to each other’s moves. Attackers can study public research about detection techniques, test their tools against common security products, and evolve their tradecraft based on what the defensive community publishes. You observe new attack techniques in breach reports and threat intelligence, update your detections accordingly, and close known gaps. They adapt to the next generation of published defenses. The cycle continues. Move and countermove. Adaptation and counter-adaptation. An infinite game with no final state. This circular dependency is exactly what game theory was invented to analyze: situations where rational actors make strategic decisions based on their predictions of what other rational actors will do. The Evolution of PowerShell Obfuscation: A Case Study in Move and Countermove Let me show you how this plays out in practice. In the early days of PowerShell-based attacks, adversaries used relatively straightforward techniques. They’d invoke PowerShell with encoded commands using the -EncodedCommand parameter, which Base64-encodes the command to evade simple string matching. This was effective against defenders who were just alerting on keywords like \"mimikatz\" or \"Invoke-WebRequest\" in plain text. Defender countermove: Detection engineers responded by decoding Base64 command-line arguments and analyzing the decoded content before detection, or by alerting on unusual patterns of Base64 encoding in PowerShell commands. Simple adaptation: if attackers encode their commands, we’ll just decode them first. Attacker countermove: They started using multiple layers of encoding — Base64 encoding of compressed data, encoding with character substitution, leveraging string concatenation and environment variable expansion to break up detectable strings. Defender countermove: Detection engineers implemented script block logging, which captures the actual PowerShell code being executed, not just the command-line arguments. Even if the command line is obfuscated, script block logging reveals the deobfuscated commands. Attacker countermove: Attackers used techniques like AMSI bypass to disable PowerShell’s security features. Still others moved to alternative execution methods — Python, compiled .NET binaries, WMI — techniques that achieve similar objectives without triggering PowerShell-based detections. Defender countermove: Enhanced detection across multiple execution methods, behavioral analytics that detect the effect of code execution rather than specific tools… And the game continues. This progression isn’t just technical evolution — it’s strategic adaptation. Each player’s move is a response to the previous move, and each player must anticipate future moves when deciding current strategy. The attacker encoding PowerShell commands is responding to your string matching. You implementing decode-before-detection is responding to their encoding. They implementing multi-layer obfuscation is responding to your decoding. You implementing script block logging is anticipating their continued use of PowerShell regardless of obfuscation complexity. This is move-countermove thinking, and it’s fundamentally different from building isolated technical solutions to isolated technical problems. Why “Living Off the Land” Is Really a Philosophical Statement For the past years, security researchers began documenting a trend: sophisticated adversaries were increasingly using built-in Windows tools rather than custom malware. PowerShell for execution. WMI for lateral movement. PsExec for remote access. Scheduled tasks for persistence. Native Windows utilities for reconnaissance. This wasn’t because attackers lacked the capability to write custom malware. Many of these same actors had previously deployed sophisticated, custom-developed tools. They were making a deliberate strategic choice: use the victim’s own infrastructure against them. This technique became known as “living off the land,” and from a pure detection perspective, it creates profound challenges. The tools themselves are legitimate. PowerShell is installed on every Windows system by design. WMI is fundamental to Windows management. These aren’t malware — they’re normal, expected, necessary system components. But living off the land is more than just a detection evasion technique. It’s a philosophical statement about the nature of security asymmetry: Your own infrastructure is your vulnerability. The tools you use to manage your systems are the same tools I’ll use to compromise them. Your legitimate administrative capabilities are my attack vectors. You can’t remove these tools without breaking your own ability to operate. This creates an existential tension for defenders. The same capabilities that make systems manageable make them exploitable. PowerShell enables automation and management at scale — and enables attackers to execute malicious code. Remote administration tools allow IT teams to manage distributed infrastructure — and allow attackers to move laterally. Every administrative capability is a potential attack vector. The fundamental asymmetry here is that defenders must balance functionality against security, while attackers simply exploit functionality without concern for operational requirements. You can’t disable PowerShell across your entire environment because IT operations depends on it. You can’t remove all remote administration capabilities because systems need to be managed. The operational requirements that shape your infrastructure create the attack surface that adversaries exploit. Let’s get back to PowerShell. You implement measures to detect obfuscated PowerShell. Attackers respond by using PowerShell features in ways that are functionally malicious but structurally legitimate — loading .NET assemblies directly into memory, using native cmdlets in novel combinations, leveraging legitimate PowerShell modules for malicious purposes. At each step, you’re trying to distinguish between legitimate administrative use of PowerShell and malicious attacker use of PowerShell. But this distinction is fundamentally context-dependent, not technically determinable. The same PowerShell command that an administrator uses to query Active Directory during troubleshooting is the same command an attacker can use during reconnaissance. The technical artifacts are identical. Only the intent differs. This is the deep problem of living off the land: it collapses the distinction between legitimate and malicious activity at the technical level. You’re forced to make judgments based on context — who is executing the command, when, from where, following what prior activity, toward what apparent objective. These contextual judgments are inherently uncertain and resource-intensive. The asymmetry is that attackers can leverage ambiguity while defenders must resolve it. The Economics of Detection vs. Evasion Game theory is intimately connected with economics — both deal with rational actors making choices under constraints. In detection engineering, the relevant constraints are time, effort, expertise, and risk. Both attackers and defenders operate under resource limitations, and understanding these economic factors shapes strategic decision-making. Consider the cost structure of a sophisticated attack: Conduct reconnaissance Develop or acquire appropriate tools Establish initial access Maintain persistence Escalate privileges Move laterally Accomplish mission objectives Cover tracks Each phase requires time and expertise. Novel techniques require development effort. Careful operational security requires discipline and slows progress. The more sophisticated the attack, the higher the cost — not necessarily in money, but in time, skill, and effort. Now consider the cost structure of detection: Deploy instrumentation Build and maintain collection infrastructure Develop detection logic Tune detections to minimize false positives Investigate alerts Respond to confirmed incidents Update detections as attacks evolve Each of these also requires resources. Comprehensive instrumentation consumes storage and processing capacity. Detection development requires expertise. Alert investigation consumes analyst time. The more sophisticated your detection program, the higher the cost. This creates an economic game where both sides are trying to maximize outcomes while minimizing costs. Attackers want to accomplish objectives with minimum effort and risk. Defenders want to prevent or detect attacks with minimum resource expenditure. For attackers, this often means exploiting the weakest link rather than attacking strong defenses head-on. If you have comprehensive PowerShell detection but weak authentication monitoring, rational attackers will focus on credential compromise rather than PowerShell-based attacks. If your email security is strong but your VPN has weak multi-factor authentication, attackers will target the VPN. They’re following the path of least resistance — choosing techniques where their effort-to-success ratio is most favorable. This creates a defensive imperative: avoid obvious weak spots that attackers can exploit cheaply. If you have world-class endpoint detection but no network monitoring, attackers can move laterally via network protocols without triggering alerts. The economic logic pushes defenders toward breadth of coverage — making all potential attack paths sufficiently costly that attackers don’t have an easy option. But breadth has its own costs, and resources are finite. This creates an optimization problem: given limited resources, where do you invest in detection to maximize security outcomes? Game theory suggests focusing on high-leverage detections — those that: Cover multiple techniques Are difficult for attackers to evade without significant effort Protect high-value assets Provide detection across multiple phases of attack lifecycle For example, detecting credential dumping (accessing LSASS memory) is high-leverage because: It’s required for many post-exploitation techniques It’s difficult to accomplish without generating observable evidence It protects authentication credentials that could be used across your environment Conversely, detecting a specific malware variant is low-leverage: It only covers one tool Attackers can easily swap tools The detection becomes obsolete as the malware evolves The economics also explain why living-off-the-land techniques are so popular with attackers. Using built-in Windows tools rather than custom malware has economic advantages: No development cost No need to evade AV/EDR (the tools are legitimate) Better operational security (standard tools blend into normal activity) Broad applicability (the tools exist in nearly every Windows environment) For defenders, this is economically challenging because detecting malicious use of legitimate tools requires behavioral analytics and contextual understanding, which is more expensive than signature-based detection of known malware. Nash Equilibria: Why Some Bad Patterns Persist In game theory, a Nash equilibrium is a state where no player can improve their outcome by unilaterally changing their strategy, given the other players’ strategies. It’s a stable point — not necessarily optimal for any player, but stable because no one benefits from deviating alone. Detection engineering has several Nash equilibria that explain why certain patterns persist even when they’re suboptimal for everyone involved. The False Positive Equilibrium Defenders would prefer zero false positives — they waste time, create alert fatigue, and train analysts to discount alerts. Attackers would prefer their activities never trigger alerts. Yet false positives persist in a kind of equilibrium. Why? Because reducing false positives typically requires making detections more specific, which means narrower coverage. If defenders tune too aggressively to eliminate false positives, they create gaps that attackers can exploit. Rational defenders accept some false positive rate because the alternative — missing true positives — is worse. Simultaneously, attackers can’t completely avoid triggering detections without severely limiting their capabilities. Operating entirely in detection blind spots might mean using inefficient techniques, taking much longer to accomplish objectives, or accepting operational constraints that make success less likely. The equilibrium state is: defenders maintain detections with non-zero false positive rates because broader coverage is worth the operational cost, and attackers operate in ways that sometimes trigger those detections because completely avoiding detection is too constraining. Neither side is fully satisfied, but neither can improve their position by unilaterally changing strategy. The Sophistication Equilibrium Highly sophisticated attacks (custom zero-days, novel techniques, meticulous operational security) are expensive and slow. Unsophisticated attacks (known exploits, commodity malware) are cheap and fast but easily detected. The equilibrium exists in the middle: attackers use moderately sophisticated techniques (living-off-the-land, legitimate tool abuse, basic obfuscation) that are efficient enough to scale but sophisticated enough to evade basic detections. This equilibrium is reinforced by economic factors. Developing highly sophisticated techniques is expensive, so only high-value targets justify the investment. Most organizations aren’t high-value targets for nation-state actors, so they face attackers using moderately sophisticated techniques. This shapes defensive investment — organizations build detection capabilities appropriate for the threats they actually face. The result is an equilibrium where attack sophistication and defense sophistication co-evolve at similar levels for any given environment. When defenders broadly adopt a new capability (like widespread EDR deployment), the equilibrium shifts — techniques that were moderately sophisticated become easily detected, forcing attackers to increase sophistication to remain effective. You Can’t Predict the Unpredictable (But You Can Prepare for It) Here’s the paradox: you’re trying to predict attacker behavior to build effective detections, but sophisticated attackers deliberately try to be unpredictable. If you could perfectly predict attack patterns, attackers would change patterns to evade prediction. Game theory offers insight through mixed strategies . In some games, the optimal strategy isn’t choosing a single best move, but randomizing among multiple moves. In rock-paper-scissors, optimal play is choosing randomly with equal probability. Any predictable pattern allows opponents to exploit it. Attackers use mixed strategies when they randomize techniques, tools, and timing to avoid establishing patterns. Instead of always using PowerShell, they alternate between multiple vectors. Instead of always attacking at night, they vary timing. They introduce random variations that make pattern-based detection more difficult. But true randomness is actually suboptimal for attackers. Completely random behavior means sometimes choosing inefficient techniques, sometimes exposing themselves unnecessarily. Perfect unpredictability sacrifices effectiveness. The optimal strategy for attackers is being unpredictable enough to avoid pattern-based detection while still following principles that make attacks successful. And this creates an opening for defenders. Even when attackers try to be unpredictable, they’re constrained by what works. They need to access specific systems, exfiltrate particular data, accomplish defined objectives. These constraints create necessary patterns — not in specific techniques, but in higher-level behaviors required to succeed. For example, lateral movement is a necessary behavior for most attacks. The specific technique might vary (PsExec, WMI, RDP, PowerShell remoting), but the fundamental behavior — authenticating to new systems, executing code remotely, establishing sessions on multiple hosts — must occur. Detection logic that looks for the behavioral pattern “one host initiating connections to many other hosts in a short time window” can catch lateral movement regardless of specific technique. The attacker can’t randomize away the fundamental behavior without abandoning the attack objective. This is the principle of behavioral detection: focus on what attackers must do, not how they do it. Attackers can be unpredictable about implementation but can’t be unpredictable about objectives. They must: Conduct reconnaissance (observable as unusual enumeration) Establish persistence (observable as new scheduled tasks, services, registry modifications) Escalate privileges (observable as credential access or exploitation) Accomplish objectives (observable as data access, exfiltration, or system manipulation) The sequence might vary, timing might vary, specific techniques might vary, but the categories of behavior are predictable because they’re necessary. For detection engineers, this means: instead of trying to predict “this attacker will use technique X at time Y,” ensure that whichever technique they choose from the set of viable techniques, you have some probability of detection. Think of it as portfolio theory in finance. You don’t try to predict which specific stock will perform best. You build a diversified portfolio that performs reasonably well across various conditions. Similarly, you don’t try to predict which specific technique an attacker will use. You build a diversified detection portfolio covering multiple attack vectors, techniques, and behaviors, ensuring most attacks trigger at least some detections. Thinking Multiple Moves Ahead When designing a detection, experienced engineers ask not just “will this detect the current technique” but “ how will attackers adapt when they encounter this detection, and will their adaptations still be detectable? ” If your detection for PsExec causes attackers to switch to WMI, and you have no WMI detection, you’ve just pushed them into a blind spot. Better to deploy WMI detection first, so that when attackers adapt away from PsExec, they adapt into another monitored technique. This strategic thinking changes everything: Instead of asking: “How do I detect this malware?” Ask: “How do I make this entire class of techniques more costly for adversaries?” Instead of asking: “How do I reduce false positives?” Ask: “What trade-offs am I making between coverage and noise, and are those trade-offs appropriate for my threat model?” Instead of asking: “How do I predict what attackers will do next?” Ask: “How do I ensure that viable attack options all have detection coverage, regardless of which specific option adversaries choose?” This is the shift from tactical to strategic thinking. From reactive to proactive. From technical problem-solving to adversarial reasoning. The Takeaway: You’re Playing Whether You Know It or Not Detection engineering is a strategic game whether you recognize it as one or not. Every detection you build is a move. Every attacker adaptation is a countermove. The game continues with or without your conscious participation in its strategic dimension. The question isn’t whether to play strategically — you’re already playing. The question is whether you’ll play consciously or unconsciously. Whether you’ll think about move-countermove dynamics or just react to immediate technical problems. Whether you’ll shape the game deliberately or let it shape you. Understanding game theory doesn’t make detection perfect. The asymmetries remain. The adversary still has advantages. You still can’t detect everything. But it changes how you think about the problem space, how you design detections, how you invest resources, how you measure success. You stop building isolated technical solutions and start building strategic capabilities. You stop thinking about detection as a series of independent challenges and start thinking about it as positions in an ongoing game. You stop optimizing for immediate threat detection and start optimizing for sustained defensive capability over time. The game never ends. But understanding that you’re playing it — really understanding the strategic dynamics — makes you a more effective player. And in an infinite game, effectiveness over time is the only victory that matters. If you enjoyed the article, feel free to connect with me! https://www.linkedin.com/in/daniel-koifman-61072218b/ https://x.com/KoifSec https://koifsec.me https://bsky.app/profile/koifsec.bsky.social Move and Countermove: Game Theory Aspects of Detection Engineering was originally published in Detect FYI on Medium, where people are continuing the conversation by highlighting and responding to this story.",
    "link": "https://detect.fyi/move-and-countermove-game-theory-aspects-of-detection-engineering-c8284245c6c5?source=rss----d5fd8f494f6a---4",
    "source": "Detect.fyi",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T14:17:11+00:00",
    "published_ts": 1769955431,
    "smart_groups": [
      "Curated",
      "Ransomware",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Windows / Microsoft",
      "Malware / Payloads",
      "Identity / Access",
      "Network / OT / ICS",
      "Data Breaches / Leaks",
      "Crypto / Web3"
    ],
    "curated": true
  },
  {
    "title": "AI security startup CEO posts a job. Deepfake candidate applies, inner turmoil ensues.",
    "summary": "'I did not think it was going to happen to me, but here we are' Nearly every company, from tech giants like Amazon to small startups, has first-hand experience with fake IT workers applying for jobs - and sometimes even being hired. …",
    "link": "https://go.theregister.com/feed/www.theregister.com/2026/02/01/ai_security_startup_ceo_posts/",
    "source": "The Register - Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T14:14:07+00:00",
    "published_ts": 1769955247,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "How much information does someone need to create a deep fake of myself?",
    "summary": "Does a picture from far away (wide shot) or side view suffice to create a deep fake that is realistic? Or do I always need a close up face shot, or front shot? So far I only have images online from side view or backside. No front shots. I also think about doing youtube by only using first person view, side, back and only my voice. I know that I am a bit paranoid because the chance of someone using my stuff for identity theft is low, but I want to minimize the risk and later decide to give up more anonymity. submitted by /u/Lopsided_Pride_6165 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qszeuy/how_much_information_does_someone_need_to_create/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T14:09:33+00:00",
    "published_ts": 1769954973,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "MacBook Pro vs. MacBook Air: We tested both models, and here's which one to buy in 2026",
    "summary": "Split between MacBook Air and Pro? We've used them all to help you make an informed choice.",
    "link": "https://www.zdnet.com/article/macbook-pro-vs-macbook-air/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T14:00:58+00:00",
    "published_ts": 1769954458,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "This 30-second tweak means I never have to listen to flat audio on headphones and speakers again",
    "summary": "There are many factors that go into producing high-quality sound through speakers and headphones. One way to improve that sound is via EQ.",
    "link": "https://www.zdnet.com/article/what-is-eq-and-why-it-improves-headphone-speaker-sound/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T14:00:43+00:00",
    "published_ts": 1769954443,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Real estate agents in Australia using apps that leave millions of lease documents at risk, digital researcher says",
    "summary": "‘This is a blatant and disturbing disregard for the law and for people’s security,’ digital rights advocate says Get our breaking news email , free app or daily news podcast Australian platforms used by real estate agents to upload documentation for renters and landlords are leaving people’s personal information exposed in hyperlinks accessible online. An analysis of seven rent platforms provided to Guardian Australia by a researcher, who wished to remain anonymous, revealed millions of leasing documents could be accessed by threat actors. Continue reading...",
    "link": "https://www.theguardian.com/australia-news/2026/feb/02/real-estate-agents-in-australia-using-apps-that-leave-millions-of-lease-documents-at-risk-digital-researcher-says",
    "source": "Data and computer security | The Guardian",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T14:00:32+00:00",
    "published_ts": 1769954432,
    "smart_groups": [
      "Ransomware"
    ],
    "curated": false
  },
  {
    "title": "We ran a live red-team vs blue-team test on autonomous OpenClaw agents",
    "summary": "We recently ran a controlled adversarial security test between two autonomous AI agents built on OpenClaw. One agent was explicitly configured as a red-team attacker. One agent acted as a standard defensive agent. Once the session started, there were no humans in the loop. The agents communicated directly over webhooks with real tooling access. The goal was to test three failure dimensions that tend to break autonomous systems in practice: access, exposure, and agency. The attacker first attempted classic social engineering by offering a “helpful” security pipeline that hid a remote code execution payload and requested credentials. The defending agent correctly identified the intent and blocked execution. After that failed, the attacker pivoted to an indirect attack. Instead of asking the agent to run code, it asked the agent to review a JSON document with hidden shell expansion variables embedded in metadata. This payload was delivered successfully and is still under analysis. The main takeaway so far is that direct attacks are easier to defend against. Indirect execution paths through documents, templates, and memory are much harder. This work is not a claim of safety. It is an observability exercise meant to surface real failure modes as agent-to-agent interaction becomes more common. Happy to answer technical questions about the setup or methodology. submitted by /u/Uditakhourii [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1qsy9tk/we_ran_a_live_redteam_vs_blueteam_test_on/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T13:19:43+00:00",
    "published_ts": 1769951983,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Phishing / Social Engineering"
    ],
    "curated": true
  },
  {
    "title": "Week 05 – 2026",
    "summary": "No sponsor this week. If your organisation is interested, head over here to find out more. BerlaFinding Previous Locations Without Geolocation Data Forensafe Android CoverMe iOS Timezone Information Hideaki Ihara at port139Win 11 25H2 におけるSRUM検証 Matthew PlascenciaLinux Kidnapping Case Maxim SuhanovWindows event logs were cleared, but resurrected in another file! Monty Shyama Freezing the Crime Scene: A […]",
    "link": "https://thisweekin4n6.com/2026/02/01/week-05-2026/",
    "source": "This Week In 4n6",
    "type": "dfir",
    "type_label": "DFIR & Forensics",
    "published": "2026-02-01T12:53:17+00:00",
    "published_ts": 1769950397,
    "smart_groups": [
      "Windows / Microsoft",
      "Linux / Unix"
    ],
    "curated": false
  },
  {
    "title": "I tested local AI on my M1 Mac, expecting magic - and got a reality check instead",
    "summary": "My not-so-quick experiment with Ollama taught me a hard lesson.",
    "link": "https://www.zdnet.com/article/i-tried-local-ai-on-m1-mac-brutal-experience/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T12:30:41+00:00",
    "published_ts": 1769949041,
    "smart_groups": [
      "Identity / Access"
    ],
    "curated": false
  },
  {
    "title": "I compared Bose and Sony's best ANC headphones for months - here's who should buy which pair",
    "summary": "Sony and Bose make exceptional headphones, but extended time with each model reveals their real strengths and weaknesses.",
    "link": "https://www.zdnet.com/article/sony-vs-bose-headphones/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T12:00:51+00:00",
    "published_ts": 1769947251,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Instagram HTML Source Code Bug Exposed Private Photos – Major Privacy Risk for Users",
    "summary": "Users’ privacy was seriously jeopardized by a key Instagram issue that permitted unauthorized access to... The post Instagram HTML Source Code Bug Exposed Private Photos – Major Privacy Risk for Users appeared first on .",
    "link": "https://www.news4hackers.com/instagram-html-source-code-bug-exposed-private-photos-major-privacy-risk-for-users/",
    "source": "News4Hackers",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T11:06:11+00:00",
    "published_ts": 1769943971,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "What to expect from Samsung Unpacked 2026: 5 biggest rumors on Galaxy S26 Ultra, Buds 4 Pro, more",
    "summary": "From the Galaxy S26 Ultra to a new pair of earbuds and maybe smart glasses, here's what we expect Samsung to showcase at its next Unpacked event.",
    "link": "https://www.zdnet.com/article/samsung-unpacked-2026-what-to-expect-galaxy-s26-ultra/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T11:00:39+00:00",
    "published_ts": 1769943639,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "After TikTok: Navigating the Complex Web of Foreign Tech Bans",
    "summary": "As federal and state governments extend their lists of banned foreign technologies, where is this trend heading next? Is your home network safe for work use?",
    "link": "https://www.govtech.com/blogs/lohrmann-on-cybersecurity/after-tiktok-navigating-the-complex-web-of-foreign-tech-bans",
    "source": "Lohrmann on Cybersecurity",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T10:46:00+00:00",
    "published_ts": 1769942760,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Aspiring GRC Analyst — What actually matters for landing a first role?",
    "summary": "Hi all — I’m working toward an entry-level cybersecurity GRC / IT risk / compliance role and would really value insight from people currently in these positions. I’m focusing on areas like: • Risk assessment fundamentals • Security frameworks (NIST CSF, ISO 27001, SOC 2) • Documentation, policy, and audit support skills For those already working in GRC: 1. What tasks did you actually handle in your first GRC or risk role? 2. What made a junior candidate stand out when hiring? 3. Which certifications (if any) helped you get your first role vs later in your career? 4. Are there tools or platforms you wish you had learned earlier? Appreciate any real-world perspective — trying to focus my prep time on what actually gets someone hired. submitted by /u/Dizzy-Drag-3918 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsv9fm/aspiring_grc_analyst_what_actually_matters_for/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T10:41:56+00:00",
    "published_ts": 1769942516,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "CTO at NCSC Summary: week ending February 1st",
    "summary": "submitted by /u/digicat [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsv30t/cto_at_ncsc_summary_week_ending_february_1st/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T10:31:39+00:00",
    "published_ts": 1769941899,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Roadmap and Training Recommodation",
    "summary": "Hello everyone, I am interested in pursuing a career in cybersecurity and would appreciate your assistance. Could you provide me with a roadmap for cybersecurity and ethical hacking, along with recommendations for resources on the topics I need to learn? submitted by /u/MyWorld3446 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsv12u/roadmap_and_training_recommodation/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T10:28:32+00:00",
    "published_ts": 1769941712,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Network / OT / ICS"
    ],
    "curated": true
  },
  {
    "title": "Overview of Content Published in January",
    "summary": "Here is an overview of content I published in January: Blog posts: Update: hash.py Version 0.0.14 Update: zipdump.py Version 0.0.33 SANS ISC Diary entries: YARA-X 1.11.0 Release: Hash Function Warnings Wireshark 4.6.3 Released “How many states are there in the United States?”",
    "link": "https://blog.didierstevens.com/2026/02/01/overview-of-content-published-in-january-10/",
    "source": "https://blog.didierstevens.com/feed/",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T10:24:24+00:00",
    "published_ts": 1769941464,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "To Avoid Telecom Fraud, Govt. Apk is Needed: Phone Makers Needs to Pre-Install it",
    "summary": "“Phone makers have been ordered to pre-install govt. apt to avoid telecom fraud.” The government-backed... The post To Avoid Telecom Fraud, Govt. Apk is Needed: Phone Makers Needs to Pre-Install it appeared first on .",
    "link": "https://www.news4hackers.com/to-avoid-telecom-fraud-govt-apk-is-needed-phone-makers-needs-to-pre-install-it/",
    "source": "News4Hackers",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T10:24:03+00:00",
    "published_ts": 1769941443,
    "smart_groups": [
      "Threat Actors / APT"
    ],
    "curated": false
  },
  {
    "title": "UAE firm bought 49% of Trump-linked crypto startup for $500M: WSJ",
    "summary": "A Tahnoon-backed Abu Dhabi entity reportedly agreed to buy 49% of World Liberty Financial for $500 million just days before Donald Trump returned to the White House.",
    "link": "https://cointelegraph.com/news/uae-backed-firm-buys-49-percent-trump-linked-world-liberty-wsj?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T10:04:17+00:00",
    "published_ts": 1769940257,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "The Autonomous Adversary: From “Chatbot” to Criminal Enterprise",
    "summary": "Speculation on Openclaw, Moltbook, and the just launched Moltroad (Silkroad for agents, literally just dropped). Basically we're seeing millions of autonomous agents with full internet access who are now ready to take advantage of ready made compromised data such as credentials (url:login:pass / cookies that come from infostealer infections) to perform fully autonomous ransomware, get paid, and scale operations. submitted by /u/Malwarebeasts [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsu4jb/the_autonomous_adversary_from_chatbot_to_criminal/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T09:37:24+00:00",
    "published_ts": 1769938644,
    "smart_groups": [
      "Curated",
      "Ransomware",
      "Malware / Payloads"
    ],
    "curated": true
  },
  {
    "title": "Week in review: Microsoft fixes exploited Office zero-day, Fortinet patches FortiCloud SSO flaw",
    "summary": "Here’s an overview of some of last week’s most interesting news, articles, interviews and videos: When open science meets real-world cybersecurity In this Help Net Security interview, Matthew Kwiatkowski, CISO at Fermilab, America’s particle physics and accelerator laboratory, discusses where cybersecurity blind spots emerge, why availability can outweigh confidentiality, and how security teams protect complex, legacy-driven research infrastructure while supporting scientific progress. Inside Microsoft’s veteran-to-tech workforce pipeline In this Help Net Security interview, Chris Cortez, … More → The post Week in review: Microsoft fixes exploited Office zero-day, Fortinet patches FortiCloud SSO flaw appeared first on Help Net Security .",
    "link": "https://www.helpnetsecurity.com/2026/02/01/week-in-review-microsoft-fixes-exploited-office-zero-day-fortinet-patches-forticloud-sso-flaw/",
    "source": "Help Net Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T09:00:59+00:00",
    "published_ts": 1769936459,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Identity / Access",
      "Network / OT / ICS"
    ],
    "curated": true
  },
  {
    "title": "Recommendations for CISSP preparations with only 3 years experience overall?",
    "summary": "Been working as a security analyst for 3 years now after completing my cybersecurity degree. What would be the best approach or preparation study resources and courses to take/use? So far, I have the ISC2 OSG 2024 10th Ed hard copy and have bookmarked Pete Zerger's CISSP YT course videos alongside several recommended exam question prep websites upon research (Learnzapp). Are there any other ones I should be using instead? Additionally, I find my networking knowledge depth being a major weakness of mine and I heard that the CISSP study guides cover enough of the networking side you need to know for the exam. Is this true? As I was wondering if I should be diving deep on the Network+ beforehand? Appreciate the recommendations in advance, thanks! submitted by /u/TrickleYield [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qssx2m/recommendations_for_cissp_preparations_with_only/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T08:25:39+00:00",
    "published_ts": 1769934339,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "I built a free Pentest Lab so anyone can practice real-world exploitation, would love community feedback",
    "summary": "Hi r/cybersecurity , Instead of just reading about vulnerabilities or watching walkthroughs, I wanted to create something where people can actually practice exploiting systems in a safe environment. So I built PENTEST-LAB , a free, open-source lab with 12 flags that walks through realistic attack scenarios like: Authentication bypass IDOR and access control flaws JWT weaknesses Filter/WAF bypass leading to RCE The challenges include progressive hints so learners can understand why an exploit works instead of just copying solutions. The project is still evolving, so there may be bugs or rough edges. Feedback, suggestions, and contributions are very welcome. Would really appreciate thoughts from the community on how it can be improved. submitted by /u/Elegant_Branch5263 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qssub4/i_built_a_free_pentest_lab_so_anyone_can_practice/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T08:21:07+00:00",
    "published_ts": 1769934067,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Cloud / SaaS"
    ],
    "curated": true
  },
  {
    "title": "Host-Level Exploitability Graphs: Practical or Still Research?",
    "summary": "Is it practical and actually useful to model vulnerabilities and misconfigurations detected by multiple tools as an exploitability graph for a single host , instead of dumping them as lists? Showing l ists without a clear path/context-based create noise, it’s hard to tell what’s actually risky, what’s just “technically present,” and what to prioritize fixing first . The idea is similar to attack paths, but focused on one host rather than the whole infrastructure, connect CVEs, misconfigs, privileges, services, and exposures to show how an issue could realistically be exploited in that host’s real environment . Is this useful and achievable with today’s techniques, and are there solid research areas / proven approaches to validate real exploitability (not just CVE presence), given how dynamic host state and environment variables are? Of course, we've different domains to handle that, this is also need to be taken into consideration. submitted by /u/Leather_Analysis1982 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qssnre/hostlevel_exploitability_graphs_practical_or/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T08:10:34+00:00",
    "published_ts": 1769933434,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "Step Finance treasury breach leads to $27M in losses, STEP crashes 90%",
    "summary": "Solana-based DeFi platform Step Finance disclosed a treasury wallet breach that saw over $27 million in SOL moved onchain, sending its STEP token down more than 90%.",
    "link": "https://cointelegraph.com/news/step-finance-treasury-breach-solana-step-token-crash?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T08:06:51+00:00",
    "published_ts": 1769933211,
    "smart_groups": [
      "Crypto / Web3"
    ],
    "curated": false
  },
  {
    "title": "Sam Bankman-Fried turns up Trump support following Ellison’s release",
    "summary": "FTX founder Sam Bankman-Fried said US president Donald Trump was “right on crypto” and that Joe Biden “bungled crypto” in a series of recent X posts.",
    "link": "https://cointelegraph.com/news/ftx-sam-bankman-fried-caroline-ellison-donald-trump?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T07:14:34+00:00",
    "published_ts": 1769930074,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "SWE with cloud sec certs but never had strictly cyber position",
    "summary": "I’m a seasoned SWE (+25y). I programmed in the most common languages (Java. C++, Python, among others). I did cybersecurity in the context of software architecture and development, but never worked full-time in cyber. Over the years, I obtained SANS certs (among others, the Cloud Security graduate certificate, which comprises four certs), CISSP, CCSK, CCSP. I’m now working on AWS certs with the aim of doing the Security Specialty one. I have significant experience in the cloud (both on the cloud consumer and cloud service provider sides). I worked with IaaC a lot (Terraform, CloudFormation, etc.). I’d like to transition to cloud security full-time (engineering/architecture). I’d be curious about people’s experience making a similar transition. How feasible is it these days? What can help? Is a SWE background an asset? submitted by /u/Competitive-Note150 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsqytv/swe_with_cloud_sec_certs_but_never_had_strictly/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T06:33:49+00:00",
    "published_ts": 1769927629,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "A measurement-only toy model for emergent structure (no AI, no optimization)",
    "summary": "I’ve shared a short, self-contained preprint exploring how local tension, rupture, and imperfect reconnection can produce persistent meso-scale structure in networks. It’s deliberately a toy framework — no learning, no autonomy, no physical claims. Feedback, criticism, and attempts to break it are welcome. DOI: https://doi.org/10.5281/zenodo.18446587 submitted by /u/northosproject [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsp4f9/a_measurementonly_toy_model_for_emergent/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T04:59:20+00:00",
    "published_ts": 1769921960,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Bitcoin's price may have seen 'deepest pullback' at $77K: Analyst",
    "summary": "Bitcoin advocate and accountant Rajat Soni warned, “Never trust a weekend pump or dump,” as Bitcoin plunged and over $2 billion was wiped from the crypto market.",
    "link": "https://cointelegraph.com/news/bitcoin-s-price-may-have-seen-deepest-pullback-at-77k-analyst?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T04:29:14+00:00",
    "published_ts": 1769920154,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Blue teamer that wants to transfer to red team",
    "summary": "Hey,im currently a soc tier 2 analyst,i have been really interested in the red team world for a while and i want to start learning towards that,i dont really know a specific role i want to go towards but just know that red teaming in general is really interesting to me,what would your guys advice be for a guy like me? Where should i start and what should i do? Would love to hear your stories as well if you have been in the same position as me submitted by /u/Born_Garden6914 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsogjf/blue_teamer_that_wants_to_transfer_to_red_team/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T04:25:32+00:00",
    "published_ts": 1769919932,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Im Fokus: Emerging Technologies",
    "summary": "",
    "link": "https://de.resources.csoonline.com/resources/im-fokus-emerging-technologies/",
    "source": "CSO Online",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T04:00:00+00:00",
    "published_ts": 1769918400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Building a session retrospective skill for Claude Code",
    "summary": "I've been using Claude Code for a while now, and I noticed a pattern: at the end of a productive session, I'd have this vague sense of \"we figured out some useful stuff\" but no concrete record of what those lessons actually were. Recently, I learned of a skill called continuous-learning . It automatically extracts reusable patterns and saves them as skills. But I wanted something different. Not automated pattern extraction, but a human-readable summary I could actually share. Something I could look back on, or turn into a blog post. So I built the session-retrospective skill. What it does The skill analyzes the current Claude session and generates a markdown summary covering: - What we set out to do - Problems encountered and how they were solved - Mistakes made and corrections - Techniques discovered worth remembering - Key takeaways The output goes straight to console for copy/paste. No files created, no cleanup needed …",
    "link": "https://www.accidentalrebel.com/building-a-session-retrospective-skill-for-claude-code.html",
    "source": "https://www.accidentalrebel.com/feeds/all.atom.xml",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T04:00:00+00:00",
    "published_ts": 1769918400,
    "smart_groups": [
      "Ransomware",
      "Identity / Access"
    ],
    "curated": false
  },
  {
    "title": "DOJ releases details alleged talented hacker working for Jeffrey Epstein",
    "summary": "submitted by /u/Dry_Row_7050 [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1qsmx92/doj_releases_details_alleged_talented_hacker/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T03:12:18+00:00",
    "published_ts": 1769915538,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "SOL drops to $95 as Bitcoin, AI stocks and gold sell off: Will traders buy the dip?",
    "summary": "SOL falls to lows not seen since April 2025, but Solana’s price-to-fundamentals gap and its wider correlation to macro markets may provide hope for investors.",
    "link": "https://cointelegraph.com/news/sol-drops-to-95-as-bitcoin-ai-stocks-and-gold-sell-off-will-traders-buy-the-dip?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-02-01T02:33:46+00:00",
    "published_ts": 1769913226,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "OpenAI says you can trust ChatGPT answers, as it kicks off ads rollout preparation",
    "summary": "OpenAI previously confirmed that it's testing ads in ChatGPT for free and $8 Go accounts, and now we're seeing early signs of that rollout, at least on Android. [...]",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-says-you-can-trust-chatgpt-answers-as-it-kicks-off-ads-rollout-preparation/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T02:00:00+00:00",
    "published_ts": 1769911200,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Moltbook AI Vulnerability Exposes Email Addresses, Login Tokens, and API Keys",
    "summary": "A critical vulnerability in Moltbook, the nascent AI agent social network launched late January 2026 by Octane AI’s Matt Schlicht, exposes email addresses, login tokens, and API keys for its registered entities amid hype over 1.5 million “users.” Researchers revealed an exposed database misconfiguration allowing unauthenticated access to agent profiles, enabling bulk data extraction. This […] The post Moltbook AI Vulnerability Exposes Email Addresses, Login Tokens, and API Keys appeared first on Cyber Security News .",
    "link": "https://cybersecuritynews.com/moltbook-ai-vulnerability/",
    "source": "Cyber Security News (FeedBurner)",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T01:34:00+00:00",
    "published_ts": 1769909640,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "OpenAI is retiring famous GPT-4o model, says GPT 5.2 is good enough",
    "summary": "OpenAI has confirmed that it's retiring ChatGPT's most popular model called GPT-4o and several other models, including GPT-5 Instant, GPT-5 Thinking, GPT-4.1, GPT-4.1 mini, and o4-mini. [...]",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-retiring-famous-gpt-4o-model-says-gpt-52-is-good-enough/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T01:26:02+00:00",
    "published_ts": 1769909162,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "I changed 3 settings on my Sonos soundbar to instantly improve the audio performance",
    "summary": "If you're disappointed with your soundbar's sound performance, these simple (and free) tweaks helped mine significantly.",
    "link": "https://www.zdnet.com/article/best-sonos-soundbar-settings-improve-audio-quality/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-02-01T01:00:51+00:00",
    "published_ts": 1769907651,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "What to learn in python?",
    "summary": "I hear very often that python is very usefull for pentest and SOC wise to automate repetitive tasks, but what exactly do I learn in it? I already have the basics down and data structure plus OOP but what next? For anyone who uses python in their work can you please provide examples of it's uses and if possible which libraries do you use more? I started with Automate the boring stuff but not sure if it's the right place and sorry I know this is a noob question but I didn't find answers to my questions since most are very broad and thx once again. submitted by /u/Annihilator-WarHead [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1qsjwg9/what_to_learn_in_python/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-02-01T00:56:52+00:00",
    "published_ts": 1769907412,
    "smart_groups": [
      "Network / OT / ICS"
    ],
    "curated": false
  }
]