[
  {
    "title": "Flock and Urban Surveillance",
    "summary": "Some years ago, I had a frustrating and largely fruitless encounter with the politics of policing. As a member of an oversight commission, I was particularly interested in the regulation of urban surveillance. The Albuquerque Police Department, for reasons good and bad, has often been an early adopter of surveillance technology. APD deployed automated license plate readers, mounted on patrol cars and portable trailers, in 2013. Initially, the department kept a six-month history of license plate data. For six months, police could retrospectively search the database to reconstruct a vehicle, or person's, movements—at least, those movements that happened near select patrol cars and \"your speed is\" trailers. Lobbying by the American Civil Liberties Union and public pressure on APD and city council lead to a policy change to retain data for only 14 days, a privacy-preserving measure that the ACLU lauded as one of the best ALPR policies in the nation. Today, ALPR is far more common in Albuquerque. Lowering costs and a continuing appetite for solving social problems with surveillance technology means that some parts of the city have ALPR installed at every signalized intersection—every person's movements cataloged at a resolution of four blocks. The data is retained for a full year. Some of it is offered, as a service, to law enforcement agencies across the country. One of the most frustrating parts of the mass surveillance debate is the ability of law enforcement agencies and municipal governments to advance wide-scale monitoring programs, weather the controversy, and then ratchet up retention and sharing after public attention fades. For years, expansive ALPR programs spread through most American cities with little objection. In my part of the country, it seemed that the controversy over ALPR had been completely forgotten until one particularly significant ALPR vendor—Flock Safety—started repeatedly stepping in long-festering controversies with such wild abandon that they are clearly either idiots or entirely unconcerned about public perception. I try not to be too cynical but I am, unfortunately, more inclined to the latter. Companies like Flock know that they are in treacherous territory, morally and legally. They know that their customers are mostly governments or organizations with elected leaders that are subject to popular opinion. They know that helping Texas law enforcement track down abortion seekers in other states is a \"bad look.\" They know all of these things, but they do not particularly care. They don't have to care: decades of incipient corruption, legal and political maneuvering, and the routine inefficacy of municipal politics has created an environment where public opinion doesn't matter. I can't definitely tell you where public opinion lies on ALPR, although it seems like the average person might be mildly in support. From at least my experience, in my corner of the world, I will tell you this: it doesn't matter. Police departments and the means by which they purchase and field technology are so isolated from the political process that it is extremely difficult to imagine a scenario where voters could affect change. Year by year, city by city, the police become more dug in. Law enforcement agencies across the country have found that the most straightforward way to address privacy concerns around surveillance technology is to keep the department's purchase and deployment of that technology a secret. Most city governments at least passively support this approach. The vendors of surveillance systems facilitate, support, and even demand secrecy through their contract terms. More recently, Las Vegas and the Bay Area have offered a model even more opaque to public scrutiny: law enforcement surveillance technology is simply purchased by wealthy private donors, almost invariably from the software industry, and then either the systems or their use are donated to the city. If carefully designed, these programs can be completely exempt from public information rules. They can take the form, for example, of a business association that runs its own private surveillance state, involving the public and ostensibly accountable police only when an arrest is made. We are privatizing mass surveillance. Flock continues to generate enormous press, mostly on the back of persistent investigation by 404 Media. More recently, security researchers have published significant defects in the design of Flock's technology that can make the original video publicly accessible. Just about every time that someone looks into Flock, the company turns out to be less ethical, the users less concerned about compliance, the design of the system itself less competent than charitable viewers had assumed. I'm trying not to be a doomer for Christmas, but I am sometimes frustrated with Flock coverage because it can miss the entire history of this issue. I think that a more contextually complete discussion of urban surveillance could be useful. And I am sitting in a coffee shop, in a trendy part of town, looking out the window at a PTZ camera on the side of a traffic light. That camera, I know, is owned and operated by APD's Real Time Crime Center (RTCC). Between the police department itself, city agencies that participate in the RTCC, and businesses that volunteer real-time access to their surveillance, there are thousands of others like it. Courtesy of a transit station, there are at least a dozen within my view. Whether or not this is a good or bad idea, whether or not it is effective in reducing crime, whether or not it will be leveraged against political opposition; these are tricky questions. I suppose what worries me is that it feels like hardly anyone is asking them any more. It took Flock's remarkable ability to step on rakes and the apparent victory of fascism in national politics for anyone to remember that the construction of ubiquitous surveillance is a project that started many years ago, and that has proceeded largely unhindered ever since. Domestic Signals Intelligence Within the tech community, there has historically been much attention to the ability to track people by passively observing Bluetooth traffic. This technique has been widely used, both in commercial and government applications. There are popular \"smart city\" street lighting systems, for example, that allow every street light to passively collect signatures of the people passing underneath it. To my knowledge, these techniques are not actually very widely used by law enforcement. There are, perhaps, two reasons: one of mechanisms of government, the other of countermeasures. First, \"smart city\" data collection systems are usually funded and deployed by municipal works or environmental departments. While police could make arrangements for access to that data, those arrangements would require the kind of inter-agency Memoranda of Understanding that tend to lead to far more public scrutiny than police acquisitions of surveillance products. Besides, since they aren't deployed for law enforcement purposes, they're often not useful sources for the areas that law enforcement find most interesting: higher-crime areas that are usually lower-income and, thus, less likely to have working street lights at all—much less \"smart\" ones. Besides, smartphones have widely adopted randomization of Bluetooth and WiFi identifiers, and protocol revisions have reduced the number of identifiers transmitted in plaintext. Passive signals intelligence just doesn't work as well as it used to, at least at the capability level of a municipality. Talking about Bluetooth and WiFi on phones does raise the question of the \"phone\" part, the cellular interface, which is targeted by the family of devices often known as \"Stingrays\" after the trademark of a particular manufacturer. Fortunately, improvements in the security design of cellular protocols is making these less effective over time. Unfortunately, the technology continues to advance, sometimes undoing the improvements of newer GSM revisions. Federal and local law enforcement continue to purchase and use these devices, largely in secret, benefiting from a particular model of federal ownership/local use that makes it especially difficult to get a police department to even confirm or deny that they have ever deployed them. \"Stingrays\" or IMSI surveillance is mostly a shadow world of rumors and carefully worded non-denials. Despite technical measures against them, they are clearly still in use, and thus clearly still useful. Optics Out in the rest of the world, visual surveillance is more salient than radio. Early rollouts of police-operated surveillance, dating back to at least the 1970s, generated some controversy over privacy implications. Two things have since happened: first, law enforcement have relied on an increasing number of public-private partnerships and commercial vendors to gain access to surveillance without directly owning it. Second, police video surveillance has largely been normalized, and no longer faces much opposition or even public notice. One of the interesting changes here is one of visibility: police video surveillance has often edged in and out of public awareness to fit the politics. In periods of pro-privacy, anti-surveillance sentiment, departments rely more on voluntary arrangements for access to cameras installed by others. In periods of pro-police, anti-crime sentiment, departments install cameras with flashing lights and police badges. Both types tend to persist after the next change in the tide. The public usually knows little about these systems, a result of intentional opacity by police departments and a general lack of interest by the press. That leads to a lot of confusion. Where I live, we do have an extensive network of police-operated cameras on intersection traffic signal arms. And yet, if you ask the average person to identify a police surveillance camera, they will point to the camera for the traffic signal's video-based lane occupancy sensing every single time. That's not a a police camera, it's barely even a camera as the video is rarely retained. All of these people, it seems, have worked themselves into a sort paranoia where they think that every camera is an eye of the police. Well, the police are watching them, from about ten feet over. The \"speed dome\" PTZ cameras get so much less attention, perhaps because they are usually mounted on the pole further from sightline, or perhaps because they are of a type more common for commercial surveillance systems that we have learned to simply ignore. Video surveillance is an interesting topic to me, philosophically. I am largely unconcerned with the privacy implications of most video surveillance installations (such as the one on my own house) because, historically, the video was recorded locally and generally reviewed only when there was a specific reason. The simple fact that reviewing large amounts of video is so time consuming meant that the pervasive surveillance potential of video surveillance was, at one time not so long ago, quite limited. Of course, the age of the computer has somewhat changed that situation. There are two phenomenon of the automation of surveillance that I think should be considered separately: first, machine vision has improved to an extent that computers can automatically process surveillance video to extract events and identities. Second, the appified, everything-social-media attitude of consumer products creates new dynamics in access to surveillance data, and those dynamics are spreading upwards into the commercial segment. Machine Vision Historically, much of the attention to video pervasive surveillance has centered around facial recognition. Facial recognition has indeed been applied to video surveillance for years, but I think that the average person vastly overestimates how effective and widely used facial recognition is. The vast majority of currently installed surveillance cameras do not produce video of sufficient quality for facial recognition. That has less to do with the quality of the video itself (although that is poorer than you think for most real systems) and more to do with the way that surveillance cameras are used and installed. Most cameras are positioned high up with wide coverage of a room; this perspective is ideal for reconstructing a series of events but just about the worst case for facial recognition. For most surveillance cameras, human faces are small and at indirect angles. There is little geometry that you can extract from a face that is about ten pixels wide and subjected to aggressive h264 compression, which is how most surveillance video comes out. Practical facial recognition systems involve cameras installed specifically for that purpose, roughly at eye level where they will get close-up, straight-on images of people who pass by. Next time you visit a bank branch, look by the exit doors for a conspicuously thick height strip. Height strips by exit doors were invented to allow clerks to give police a more accurate description of a robber, but they have since evolved to serve largely as subterfuge. Somewhere around 5' 6\", you will notice a small hole, and behind that hole is a camera. Several manufacturers offer these and they seem very popular in financial services. Kroger is more to the point: they've just been installing dome cameras right at eye height on their exit doors, for at least a decade. When discussing surveillance, it's important to remember that the vast majority of real-world video surveillance systems are old, inexpensive, and poorly maintained. Even where cameras are installed specifically for a good view of faces, there probably isn't any facial recognition in use, most of the time. Facial recognition products are expensive and don't currently manifest many benefits unless the organization is large enough to have a security department to work with the resulting data, which requires a degree of operational maturity beyond most surveillance users (e.g. gas stations). All of that said, there are plenty of real-world facial recognition deployments. Rite Aid, for example, prominently rolled out facial recognition to flag known shoplifters at their stores... a rollout that went so poorly that it lead to a lawsuit and an FTC settlement including the end of the facial recognition program and a five-year moratorium on further attempts. This is not to say that facial recognition on video surveillance isn't legal (although in some states it isn't or at least requires a lot of disclosure), but there is definitely a degree of legal and reputational hazard involved. The ACLU has periodically conducted call-around surveys on use of facial recognition. The most notable trend is that most large chains now refuse to talk about it. I could be wrong, but my experience with corporate communications behavior leads to me to interpret a refusal to comment along these lines: Home Depot, for example, is a very large company that will have various initiatives underway, and either confirming or denying their use of facial recognition would probably be wrong in some cases and expose them to compliance or legal risk in others. I would bet good money that Home Depot has some facial recognition technology deployed at some locations, but knowing how slowly security technology tends to roll out in that kind of company and how complicated the legal and compliance situation can become, it's probably limited. They are probably acutely aware of the controversy surrounding this type of surveillance and, given the example of Rite Aid, the ways a rollout could go wrong. That means that surveillance will spread slowly. But it will spread. At this point, I think it is inevitable that facial recognition will become widely used in video surveillance. I just think the point at which \"facial recognition is everywhere\" remains some years away, due to all the normal reasons: technical limitations, slow-moving bureaucracies, and a somewhat complex and unclear regulatory situation. It will inevitably happen, for the same reasons as well: aggressive sales by facial recognition vendors. There are some sectors where facial recognition is very common, although I don't get the impression that retail is one of these yet. Casinos, for example—some of the larger Las Vegas casinos have reportedly had facial recognition systems in use for decades, and Nevada law is very permissive of them. Casinos are, of course, pretty much ideal users. Large institutions with a lot of financial risk and large, sophisticated security departments. Few other businesses outside of Target can compete with the size and sophistication of casino security departments. There's a whole lot of money flying around, and they can spend some of it on expensive per-camera licensing without much leadership objection. License Plate Reading Popular attention to facial recognition has mostly fallen away as industry and media focus has shifted to another application of machine vision that is, it turns out, a whole lot easier: license plates. License plates are designed for readability, and most states use retroreflective paints that give you an absolutely beautiful high-contrast image under coaxial (i.e. mounted alongside the camera) infrared illumination. There's not much that is easier to read by machine vision. Automated license plate readers have been available for quite a long time: US CBP had an experimental ALPR installation at a Texas border crossing in 1994. That system was actually deemed a failure and removed, but technology improved and there were permanent installations at larger border crossings by the end of the 1990s. For a long time, the dominant vendor of ALPR equipment in the US was Motorola. Motorola's product line remains popular for vehicle-mounted systems, but the high price of the cameras, controllers, and software package had a side benefit of limiting the pervasiveness of ALPR. The equipment was just too expensive to put up all over the place. In Albuquerque, for example, the ALPR program long consisted of Motorola systems mounted on portable \"your speed is\" trailers. The portable nature of these setups made the expense more worthwhile, and besides, portability has its own utilities: an APD detective once told me, for example, of how they would leave ALPR trailers in front of the houses of people suspected to lead criminal gangs. While there was value in the intelligence collection, the main motivation was intimidation: while you might call the \"your speed is\" trailers a concealed system, they're not all that subtle, and one supposes that most vehicle-based criminals (the main kind here) are aware that they function as the eyes of the police. At some point, in response to growing budgets or lowered costs I'm not sure, APD began installing fixed Motorola ALPR systems on the light arms of major intersections. I know of around a dozen installations of this type in Albuquerque, which is the beginning of a widespread capability to monitor public movements but not exactly the dystopian pervasive surveillance of Minority Report. ALPR works pretty well, but it is not perfect. Cameras need to be installed with fairly narrow optics aimed at the right spot, and infrared illumination makes reading far more reliable. Speaking of Las Vegas, I used to use a certain casino parking garage with an ALPR-based payment system with some regularity. It printed the license plate, as read by the ALPR, on the parking ticket, which is why I know that it was almost comically inept at reading my very legible California plate. It always got about half the characters wrong. I have gotten much better results in my own home experiments with budget equipment, so I figure that system must have been very poorly installed or maintained, but I'm sure there are plenty of others out there just like it. That's the tricky thing about video surveillance, from the \"blue team\" side of the house: people don't tend to pay a lot of attention to it until there's been an incident, at which point they find out that the lens has had mud on it for the last three months (a much bigger problem with ALPR cameras that used to be mounted pretty low to the ground for a better look angle). I bring this up because I think that people tend to vastly overestimate the quality of real-world video surveillance, and I like to take every opportunity to remind people that the main failure case of retail video surveillance used to be failure to replace the continuous-loop tape cassette before it was completely demagnetized by repeated recording. Now, in 2025, the continuous-loop tape cassettes are pretty much gone, but maintenance practices haven't improved. Lots of the cameras you see in public only barely work or don't work at all. So it goes. Flock In 2017, though, a VC-backed (and specifically YCombinator) company called Flock Safety introduced a bold new idea to ALPR: a Silicon Valley sales model. Flock's system is built to be low-cost, and the sensors are smaller, simpler, and cheaper than Motorola's. I suppose they might be less effective as a result, but a reduced \"catch\" rate doesn't really detract from mass-surveillance ALPR installations that much. Flock has also greatly expanded their customer base, emphasizing sales to private organizations as well as law enforcement and government. Speaking of Home Depot, for example, Home Depot seems to have installed their own Flock cameras in all of their parking lots. Lowes Home Improvement has done the same. I wanted to know more definitely how much Flock systems cost, because I suspected they were making significant inroads just through low pricing. It's a little tricky to say definitively because Flock is a \"call for quote\" kind of company and I think they offer contracts on different price bases. Scouring contracting documents, meeting notes, etc., it seems like a \"typical\" cost for a Flock camera is around $4,000 with about $3,000 a year in per-camera software licensing fees. That might seem expensive but it compares well to the five-figure prices I have heard associated with Motorola systems, especially since the Flock offering is more \"white glove\" with installation and maintenance packaged. Motorola systems are usually purchased through an integrator who adds their own considerable margin. Flock also designs their cameras to be amenable to solar power, which radically reduces install costs compared to Motorola systems that usually need a utility worker out to splice power from a streetlight. More even than a price reduction, it makes Flock cameras much more available to organizations like HOAs that control territory in a sense but do not have the full bucket truck or utility work order capabilities of a municipal government. Another recent innovation in ALPR is less traceable to Flock but certainly seems associated with them: flexible funding sources. Police departments have limited budgets with which to acquire new technology, and technology vendors have to compete with other budget priorities like salaries, vehicles, and black-on-black tactical vinyl jobs for those vehicles. ALPR seems especially attractive for public-private partnership mechanisms, so there are a lot of Flock installations that were funded by business associations, HOAs, neighborhood associations, and other \"indirect\" sources. Some of these systems are owned and operated by the police with only the funding donated, others are owned and operated by the private group that paid for them. This can result in curious deployment decisions: sometimes the lowest-crime neighborhoods are the most replete with ALPR, as they tend to be wealthier and more politically organized communities with the wherewithall to put up the money. The most important thing to understand about Flock, though, is that it has built on Amazon's concept of \"Ring neighbors\" to build a sort of nationwide, ALPR-centric Nextdoor. Flock customers can basically check a box that allows other Flock customers to access data from their sensors, and of course Flock strongly encourages users to turn sharing on. While there are some audit and access controls available on Flock data sharing, they seem like pretty minimal efforts that are often ignored. Flock sharing has generated a lot of press, especially with some dramatic examples like use by a Texas sheriff to locate an abortion patient and use by ICE/CBP to track suspects. These are both examples that raise one of the most alarming aspects of the Flock situation: many states and municipalities have laws in place that limit or at least monitor collaboration of local police with other police agencies and federal law enforcement. Some people find this surprising, but it's important to understand that the United States is a republic of nominally independent governments. Laws, policies, and priorities can vary greatly from jurisdiction to jurisdiction. There is a specific historical thread, related to the tracing of escaped slaves, that has made resource sharing between different law enforcement agencies a known area of moral and legal treachery for a very long time. And yet, it turns out, most Flock customers seem to have sharing turned on, possibly entirely without their knowledge. There are now multiple well-established cases of local law enforcement agencies violating state laws by having data sharing with ICE/CBP enabled. It is possible for Flock users to turn off or restrict sharing, but I think a lot of them honestly don't know that. Some state Attorneys General have ordered Flock users to disable sharing, some have restricted or banned Flock products entirely, but in general it's a very messy situation. It appears that a lack of care by law enforcement and other Flock customers, facilitate and no doubt encouraged by Flock's motivation towards \"network effect\" lock-in, has resulted in widespread and brazen violation of privacy laws that is only now making its way to the courts. In other words, the tech industry happened. Acoustics I will not spend much time here discussing wide-area acoustic surveillance like ShotSpotter, in part because I have written a bit about it before . It's a complex issue: a well-designed gunshot detection system would probably be a good thing, but I find SoundThinking (manufacturer of the ShotSpotter system) to be profoundly untrustworthy. Futures The changes we are already seeing will continue: ALPR will become more ubiquitous, facial recognition will advance further into the public sphere, and the tech industry will continue to centralize data and facilitate queries by law enforcement. There's a lot of money to me made out of the whole thing, and funding towards law enforcement or public safety purchases are usually politically safe. Pretty much everything is stacked in the direction of more pervasive surveillance in the United States. Do you find that upsetting? It seems that some people do, and some people do not. I am probably not as opposed to surveillance of public spaces as the most vocal privacy advocates, but I am also convinced that vendor-enabled mass surveillance technology like Flock is subject to enormous abuse and will inevitably undermine constitutional protections. Unfortunately, vocal organizing against mass surveillance has become pretty limited. The ACLU is doing a lot of good work in this area, but I don't see much public organizing. The best thing you can do is probably to advocate for transparency. The most alarming part of this whole thing, to me, is the way that police departments have brazenly structured purchases of surveillance technology to get around public record and approval requirements. Companies like Flock and SoundThinking encourage this, and write it into their contracts. The end result is that many police departments have installed cameras and microphones in all kinds of places, and will not disclose when, where, how many, or how they are used. We should not allow that kind of secrecy, but preventing it seems to require legislation. The federal situation seems like a loss, so the best pressure point might be to lobby for municipal or state legislation that will require police departments to disclose their surveillance programs. Even better would be a requirement for review and approval of surveillance purchases, but unfortunately that kind of rule often already exists and police departments still structure their purchase arrangements to avoid invoking it. I suppose the bottom line is this: keep bringing it up. Mass surveillance in the US often feels like a lost cause, but I suppose it's only lost if we give up. It doesn't take that many people showing up at a city council meeting to make something a priority to the councilors; and perhaps the police can only stonewall for so long. It's worth a shot.",
    "link": "https://computer.rip/2025-12-26-Flock-and-Urban-Surveillance.html",
    "source": "https://computer.rip/rss.xml",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-12-23T00:00:00+00:00",
    "published_ts": 1797984000,
    "smart_groups": [
      "Curated",
      "Ransomware",
      "Vulnerabilities / CVEs",
      "Cloud / SaaS",
      "Identity / Access",
      "Network / OT / ICS",
      "Crypto / Web3"
    ],
    "curated": true
  },
  {
    "title": "FY26 Q4 Data Due",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/fy26-q4-data-due",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-10-30T12:00:00+00:00",
    "published_ts": 1793361600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "FY26 Q3 Data Due",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/fy26-q3-data-due",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-07-31T12:00:00+00:00",
    "published_ts": 1785499200,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "FY26 Q2 Data Due",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/fy26-q2-data-due",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-04-24T12:00:00+00:00",
    "published_ts": 1777032000,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Publication of 2026 Chief FOIA Officer (CFO) Reports on agency websites due",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/publication-2026-chief-foia-officer-cfo-reports-agency-websites-due",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-03-16T12:00:00+00:00",
    "published_ts": 1773662400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Publication of FY25 Annual Reports on agency websites due",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/publication-fy25-annual-reports-agency-websites-due",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-03-01T12:00:00+00:00",
    "published_ts": 1772366400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Virtual Advanced Freedom of Information Act Training",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/virtual-advanced-freedom-information-act-training-0",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-02-04T12:00:00+00:00",
    "published_ts": 1770206400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "FY26 Q1 Data Due",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/fy26-q1-data-due",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-30T12:00:00+00:00",
    "published_ts": 1769774400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Agency Chief FOIA Officer (CFO) Reports due to OIP for review",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/agency-chief-foia-officer-cfo-reports-due-oip-review",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-30T12:00:00+00:00",
    "published_ts": 1769774400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Virtual Administrative Appeals, FOIA Compliance, and Customer Service Training",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/virtual-administrative-appeals-foia-compliance-and-customer-service-training",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-28T12:00:00+00:00",
    "published_ts": 1769601600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Virtual Privacy Considerations Training",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/virtual-privacy-considerations-training-1",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-21T12:00:00+00:00",
    "published_ts": 1768996800,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Virtual Exemption 4 and Exemption 5 Training",
    "summary": "",
    "link": "https://www.justice.gov/oip/event/virtual-exemption-4-and-exemption-5-training-1",
    "source": "US DOJ Cybercrime News",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-13T12:00:00+00:00",
    "published_ts": 1768305600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "7 rules to follow when setting up a home security camera - and where you should never install one",
    "summary": "Follow these critical tips to boost your security camera's performance and avoid common setup mistakes.",
    "link": "https://www.zdnet.com/article/7-security-camera-rules-experts-recommend/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-02T02:00:47+00:00",
    "published_ts": 1767319247,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "My new favorite keychain tool gets just about any job done - at a reasonable price",
    "summary": "The K3 Ultramulti EDC keychain tool is multifunctional, combining a flashlight, laser pointer, and lighter into one convenient device.",
    "link": "https://www.zdnet.com/article/k3-ultramulti-edc-keychain-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-02T01:43:56+00:00",
    "published_ts": 1767318236,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Akylade Cert - thoughts?",
    "summary": "I just ran across Akylade's certification and am wondering if anyone has completed one? Or had any thoughts pertaining to them? Are they worth it? Etc.❓️⁉️❓️ I noticed that the study book is written by Jason Dion which has been around as a trainer in the cyber field for a while. Resource: https://www.akylade.com/ Thank you advance for any thoughts. ✨️Happy New Year!!!!✨️ submitted by /u/GiaChickie [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1l4bv/akylade_cert_thoughts/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-02T01:21:31+00:00",
    "published_ts": 1767316891,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "Can you recommend any good free pen testing tools I can use for a small web app?",
    "summary": "submitted by /u/atamagno [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1kpgy/can_you_recommend_any_good_free_pen_testing_tools/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-02T01:02:27+00:00",
    "published_ts": 1767315747,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Turkmenistan rings in new year with crypto exchanges, miners",
    "summary": "Turkmenistan has started the year with a bang, with new laws legalizing the operation of crypto exchanges and crypto miners kicking in on Jan 1.",
    "link": "https://cointelegraph.com/news/turkmenistan-crypto-exchanges-trading-now-legal?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-02T00:37:58+00:00",
    "published_ts": 1767314278,
    "smart_groups": [
      "Cloud / SaaS",
      "Crypto / Web3"
    ],
    "curated": false
  },
  {
    "title": "Passed SC900, want to go for SC200 but I have no experience in SOC",
    "summary": "I heard that there is a big jump between SC900 and SC200, of course the first one is basic and the second one is intermediate, but I'm thinking about taking it in the near future. Is it possible to pass it without experience as SOC analyst? How to get experience in tools like Defender, sentinel if I have no possibility to do it at work? I know there Is free Azure trial for 30 days, but I'm not sure if month is enough.. please be honest with me :) submitted by /u/Wide-Signature-1491 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1k3as/passed_sc900_want_to_go_for_sc200_but_i_have_no/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-02T00:35:38+00:00",
    "published_ts": 1767314138,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "Windows Defender Support Logs",
    "summary": "I ran across a LinkedIn post the other day that mentioned using Windows Defender Support Logs (actually, I think the post referred to them as \"diagnostic\" logs). These logs are found in the following folder: C:\\ProgramData\\Microsoft\\Windows Defender\\Support\\ ...and follow the naming convention: MpWppTracing-YYYYMMDD-HHMMSS-00000003-fffffffeffffffff.bin The post mentions using strings to parse the files, but I was wondering if there was a parser available, and like Deadpool, I figured I'd go looking...and I found something called mplog_parser . I've had a few opportunities to pull down some of these files from endpoints, but nothing has popped out as being related to the incident in question. That's okay, though...I'll keep this one in my kit, and I'll have to give the parser from Github a shot.",
    "link": "http://windowsir.blogspot.com/2026/01/windows-defender-support-logs.html",
    "source": "Windows Incident Response",
    "type": "dfir",
    "type_label": "DFIR & Forensics",
    "published": "2026-01-02T00:20:00+00:00",
    "published_ts": 1767313200,
    "smart_groups": [
      "Windows / Microsoft"
    ],
    "curated": false
  },
  {
    "title": "Grab Bag",
    "summary": "This started out as a bit of an end-of-the-year grab bag of posts, but I don't like simply linking to things, dropping links with no explanation as to why; instead, I'd rather share the why behind what I found interesting about the post or article. And don't worry...I know after 2025, there are folks out there expecting a flaming bag full of dog poop dropped off on their doorstep, but rest assured...this isn't that. Anyway, as I was working on this post, it just sort of rolled into 2026, so I'll start off my first post of the year with a grab bag of things I found interesting right there at the end of 2025. What's in your Registry? CloudSEK recently shared this write-up on Silver Fox ; what I found most interesting was from \"Stage 4 - Valley RAT\", \"Stage 2\". Apparently, Valley RAT maintains configuration information in the following Registry path: HKCU\\Console In addition, downloaded plugins are stored in the following path: HKCU\\Console\\0\\d33f351a4aeea5e608853d1a56661059 All of this means that not only can you get a great deal of info, and develop a great deal of intel from the entries themselves, but they're also tied to a specific user account. When creating a timeline, paths like those used by the Valley RAT should really stand out. Speaking of Registry and persistence, DeceptIQ shared this write-up on Registry persistence on 27 Dec 2025. As long as I've been working with Windows systems...going back to about 1995, much further if we're talking about \"using\"...this isn't something that I've ever heard of, nor have I run across anything like this. Interestingly enough, the authors didn't just talk about the technique and reference it, but they also linked to a means for creating an NTUSER.MAN file, and even shared how the whole process might look. Information Sharing If you're interested in how shellcode is \"used\" on Windows systems, Valli-Nayagam Chokkalingam over at Adversary Craft shared this \"101\" write-up that you might find useful. I can't say that the write-up leads to viable detection methodologies, as ultimately, finding the shellcode amounts to seeing the bytes in Explorer.exe process memory. However, it is a good \"101\" level write-up for folks to start developing familiarity with the topic. A bit of \"saving the best for last\", but keeping up the \"info sharing\" theme, Brett shared a look back to the early days of DF/IR, and how it was built on PDFs and coffee . I remember those days, because at one point I was writing some of those PDFs, and reading many others. I was reading a lot of the docs that got shared not only to get the information from them, but also to help develop my writing style so that what I wrote up would be entertaining and useful to others. One of the thoughts that Brett's post brought to mind is how we consume information has changed over time. Like Brett said, it used to be PDFs, and in some cases, meeting for coffee (or beer/adult beverages). I started blogging in 2004 because at the time, it seemed like a great way to share information, in one easy-to-reach, easy-to-find location. I know that even since then, there have been folks who've been really successful with YouTube channels, some even getting to the point where they're sponsored. Also, training courses, even those that are self-paced and available online, have been available for some time. In his book Call Sign Chaos , Mattis said that \"our own personal experiences are not enough to sustain us.\" While this statement was directed at warfighters, it remains true for other endeavors, as well, and in particular, the various aspects of cybersecurity. Mattis talked about reading thousands of books, and even described his own reading to expand his knowledge ahead of a campaign. Brett taled about PDFs as a means of sharing knowledge and experiences. In both cases, it's incumbent upon someone to write, to document their experiences and share that knowledge.",
    "link": "http://windowsir.blogspot.com/2026/01/grab-bag.html",
    "source": "Windows Incident Response",
    "type": "dfir",
    "type_label": "DFIR & Forensics",
    "published": "2026-01-02T00:20:00+00:00",
    "published_ts": 1767313200,
    "smart_groups": [
      "Windows / Microsoft",
      "Web / API Security"
    ],
    "curated": false
  },
  {
    "title": "Phoenix/Tucson Cybersecurity Communities",
    "summary": "Wondering if anyone is aware of any Cybersecurity communities in Arizona? Im from Colorado and we have a bunch here but struggling to find something like a Cyber Symposium event or First Friday type of communities in Arizona. Potentially looking to move there and want to talk to some pros out there to see what their experience has been like. submitted by /u/cxerphax [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1jav1/phoenixtucson_cybersecurity_communities/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-02T00:00:44+00:00",
    "published_ts": 1767312044,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Here’s what happened in crypto today",
    "summary": "Need to know what happened in crypto today? Here is the latest news on daily trends and events impacting Bitcoin price, blockchain, DeFi, NFTs, Web3 and crypto regulation.",
    "link": "https://cointelegraph.com/news/what-happened-in-crypto-today?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T22:03:06+00:00",
    "published_ts": 1767304986,
    "smart_groups": [
      "Crypto / Web3"
    ],
    "curated": false
  },
  {
    "title": "Losses from crypto hacks down 60% in December: PeckShield",
    "summary": "Although monetary losses declined, users still lost tens of millions of dollars to common cybersecurity exploits like address poisoning scams.",
    "link": "https://cointelegraph.com/news/losses-crypto-hacks-down-60-december?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T22:02:07+00:00",
    "published_ts": 1767304927,
    "smart_groups": [
      "Curated",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "Breaking Into Cybersecurity - PSW #907",
    "summary": "Our field is booming! Cybersecurity jobs are projected to grow 33 percent through 2033, far outpacing the average 4 percent growth across all jobs. (And yes, those stats could be made up, but they sound nice, eh?) Yet newcomers often feel paralyzed by where to start. The truth? There's no single \"right path,\" but there are proven strategies that work. The field needs people at all levels, and you don't need a four-year degree to break in. We'll discuss all the details, including a list of projects for beginners in Cybersecurity, plus plenty of non-technical suggestions! Visit https://www.securityweekly.com/psw for all the latest episodes! Show Notes: https://securityweekly.com/psw-907",
    "link": "https://podcast.securityweekly.com/breaking-into-cybersecurity-psw-907",
    "source": "Security Weekly Podcast Network (Audio)",
    "type": "podcasts",
    "type_label": "Podcasts & YouTube",
    "published": "2026-01-01T22:00:00+00:00",
    "published_ts": 1767304800,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "Defender just decided N-ABLE is malware for anyone who might be getting called :)",
    "summary": "this company man Defender detected active 'Trojan:Win32/SalatStealer.NZ!MTB' in process 'software-scanner.exe' MSP Agent Core submitted by /u/catdickNBA [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1fxss/defender_just_decided_nable_is_malware_for_anyone/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T21:40:25+00:00",
    "published_ts": 1767303625,
    "smart_groups": [
      "Curated",
      "Malware / Payloads"
    ],
    "curated": true
  },
  {
    "title": "Flow advances recovery plan, raises exchange concerns after $3.9M exploit",
    "summary": "The plan to address a multimillion-dollar exploit continued with \"phase two progress\" on EVM after it scrapped a plan to roll back the blockchain.",
    "link": "https://cointelegraph.com/news/flow-recovery-plan-exchange-exploit?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T21:38:49+00:00",
    "published_ts": 1767303529,
    "smart_groups": [
      "Curated",
      "Ransomware",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "Unmasking Github Users: How to Identify the Person Behind Any Github Profile",
    "summary": "submitted by /u/0x68616469 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1f7qq/unmasking_github_users_how_to_identify_the_person/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T21:11:03+00:00",
    "published_ts": 1767301863,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "How Webflow Helps Companies Move Faster Without Sacrificing Brand Control",
    "summary": "Conventional development frequently results in a trade-off between speed and brand consistency, which harms reputation by causing delays…",
    "link": "https://hackread.com/webflow-companies-sacrificing-brand-control/",
    "source": "HackRead",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T21:04:39+00:00",
    "published_ts": 1767301479,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "How do I learn web exploitation / networking for CTFs?",
    "summary": "I want to participate in CTFs. One of the categories is obviously web exploitation and such. I have tried Natas and some CTFs on picoCTF, but understood, that I don't actually have the knowledge to do the tasks there. What are some free resources, where I could learn it? submitted by /u/Norker_g [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1f0ly/how_do_i_learn_web_exploitation_networking_for/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T21:03:00+00:00",
    "published_ts": 1767301380,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "I'm looking for a soc L1 job",
    "summary": "‏I applied for many opportunities, but I didn't reach any interview. If there is anything wrong in my resume, please tell me the possible modifications. submitted by /u/EconomyBig9246 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1ei75/im_looking_for_a_soc_l1_job/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T20:42:04+00:00",
    "published_ts": 1767300124,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "What actually worked for reducing alert fatigue in your SOC — not theoretically, but in practice?",
    "summary": "I keep seeing two extremes discussed: “Tune detections harder” “Automate more with playbooks/SOAR” Both help, but I’ve also watched teams make things worse doing either one too aggressively — missed incidents on one side, or new layers of noisy automation on the other. For teams that actually saw measurable improvement (less burnout, fewer false escalations, clearer incident timelines): What specifically moved the needle? Examples I’m curious about: changes to escalation criteria correlation strategies that actually worked playbooks that reduced noise instead of adding steps what didn’t work that everyone says should how you measured success (beyond “it feels quieter”) Not looking for vendor pitches — genuinely interested in what helped real analysts get their focus back. submitted by /u/frankfooter32 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1ed3o/what_actually_worked_for_reducing_alert_fatigue/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T20:36:19+00:00",
    "published_ts": 1767299779,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Bypassing windows login page?",
    "summary": "Ok not sure if this works on all pcs with all security enabled but it might you never know. This just gets rid of the passkey. Hold shift, press power then click restart Click troubleshoot –>troubleshoot → advanced options Command prompt and type “notepad” Open file at top left then open Click on This PC Click the Windows (C:) or whatever drive has your Windows install on it Click system 32 change file type to all files Look for Utilman or search for Utilman.exe Rename it to “Utilman2” Find the file Cmd (the command prompt file) Rename it to Utilman Exit all of it, get back to the bluescreen page Click continue and reset Back on your login page click the little “accessibility” man in bottom right Cmd prompt opens, type “net user” Find your admin user Then type “net user *” might be administrator might be something else Press enter and it will show a password reset, just click enter for now, you can go back and change it later Back on login page, click the enter button where you would type your passcode You should be in submitted by /u/Beneficial_Plenty250 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1dleh/bypassing_windows_login_page/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T20:05:16+00:00",
    "published_ts": 1767297916,
    "smart_groups": [
      "Ransomware",
      "Windows / Microsoft"
    ],
    "curated": false
  },
  {
    "title": "The Most Anticipated Games of 2026",
    "summary": "2026 is shaping up to be a huge year for games, with major sequels, long-awaited releases, and big new projects already lined up.",
    "link": "https://decrypt.co/352479/most-anticipated-games-2026",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T20:01:05+00:00",
    "published_ts": 1767297665,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "No alerts doesn't mean you're secure. Sometimes it means you're blind",
    "summary": "I’ve seen a lot of environments proudly showing \"all green\" dashboards. No alerts, no incidents, no noise. In reality, many of those environments had disabled logs, muted detections, alert fatigue tuning that never got revisited, or massive blind spots in SaaS and cloud. Silence felt good. It wasn’t safety. In DFIR and SOC work, the scariest phrase I hear isn't \"we're under attack”, it's \"we don’t see anything\". Curious how others here think about this. How do you tell the difference between a genuinely quiet environment and one thats just missing visibility? (I wrote a longer breakdown here if anyone wants it: link ) submitted by /u/eliasgraywrites [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1dhbj/no_alerts_doesnt_mean_youre_secure_sometimes_it/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T20:00:55+00:00",
    "published_ts": 1767297655,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "Bitcoin options boom raises fears of capped BTC upside",
    "summary": "Bitcoin cash-and-carry trades faded toward the end of the year, leading funds to shift to Bitcoin options for yield. Is the strategy putting a cap on BTC price?",
    "link": "https://cointelegraph.com/news/bitcoin-options-under-fire-as-covered-calls-take-center-stage?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T20:00:00+00:00",
    "published_ts": 1767297600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Meta possibly trying to fool regulators over scam ads?",
    "summary": "If true, this is disturbing and does not support transparency, to say the least. Meta (Facebook and Instagram) has a lot of scam ads, but it is claimed that they intentionally made them less findable for regulators, while let customers continue to get them. https://www.reuters.com/investigations/meta-created-playbook-fend-off-pressure-crack-down-scammers-documents-show-2025-12-31/ submitted by /u/rogeragrimes [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1d8ni/meta_possibly_trying_to_fool_regulators_over_scam/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T19:51:05+00:00",
    "published_ts": 1767297065,
    "smart_groups": [
      "Ransomware"
    ],
    "curated": false
  },
  {
    "title": "Ethereum co-founder pitches DApps as solution to 2025 Cloudflare outage",
    "summary": "Outages with Cloudflare and Amazon Web Services caused brief massive outages in 2025, affecting several cryptocurrency platforms.",
    "link": "https://cointelegraph.com/news/vitalik-buterin-ethereum-dapps-solution-cloudflare?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T19:41:28+00:00",
    "published_ts": 1767296488,
    "smart_groups": [
      "Cloud / SaaS",
      "Crypto / Web3"
    ],
    "curated": false
  },
  {
    "title": "OpenAI is offering $20 ChatGPT Plus for free to some users",
    "summary": "If you're already subscribed to ChatGPT Plus, which costs $20, you can request OpenAI to cancel your subscription, and it may offer one month of free usage. [...]",
    "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openai-is-offering-20-chatgpt-plus-for-free-to-some-users/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T19:18:54+00:00",
    "published_ts": 1767295134,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "If North Korean Cybercrime Was a Startup, How Much Would it be Worth?",
    "summary": "With 2025 coming to a close I thought it would be interesting to examine how much money was stolen by state-sponsored hackers in North Korea, and how that compares to revenue figures of Silicon Valley startups. submitted by /u/Ancient_Geologist589 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1bnwj/if_north_korean_cybercrime_was_a_startup_how_much/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T18:49:45+00:00",
    "published_ts": 1767293385,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Bitcoin RSI demands breakout as exec says 'RIP' to 4-year BTC price cycle",
    "summary": "Bitcoin entered a \"new era\" as the 2025 yearly candle closed red, said analysis, with BTC price volatility signals firing into the new year.",
    "link": "https://cointelegraph.com/news/bitcoin-rsi-demands-breakout-exec-says-rip-4-year-btc-price-cycle?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T18:27:46+00:00",
    "published_ts": 1767292066,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Crypto’s 2026 investment playbook: Bitcoin, stablecoin infrastructure, tokenized assets",
    "summary": "After a volatile 2025, investors are rethinking crypto cycles. Here are three investment themes that will shape the market’s next phase in 2026.",
    "link": "https://cointelegraph.com/news/crypto-investment-themes-2026-bitcoin-stablecoins-tokenized-assets?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T18:00:00+00:00",
    "published_ts": 1767290400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Happy New Year, Mark Cuban: Judge dismisses lawsuit over Voyager Digital",
    "summary": "The class-action suit, filed against Cuban and others in August 2022 shortly after Voyager filed for bankruptcy, alleged “false representations and other deceptive conduct.“",
    "link": "https://cointelegraph.com/news/voyager-digital-mark-cuban-mavericks-lawsuit-dismissed?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T17:21:34+00:00",
    "published_ts": 1767288094,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "Crypto Crystal Ball 2026: Are We Headed for Bitcoin and Crypto Winter?",
    "summary": "Bitcoin at $200,000? Massive volatility? Experts predict where the markets are headed—and it's probably not another winter.",
    "link": "https://decrypt.co/352209/crypto-crystal-ball-2026-headed-bitcoin-winter",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T17:01:03+00:00",
    "published_ts": 1767286863,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Detailed Analysis - MongoBleed (CVE-2025-14847): Memory Corruption in MongoDB",
    "summary": "Spent few days analysing MongoDB, please summarize the analysis and findings. (Note I spend more time writing exploits, have dyslexia, and I'm not a native English, an LLM proofreads some sections, if this offends you, stop reading) MongoBleed, tracked as CVE-2025-14847, an unauthenticated memory disclosure vulnerability affecting MongoDB across multiple major versions. It allows remote clients to extract uninitialized heap memory from the MongoDB process using nothing more than valid compressed wire-protocol messages. This is not native RCE . It is a memory leak. it does not leave a lot of traces, It is silent, repeatable, and reachable before authentication. At internet scale, that combination matters more than exploit glamour. TL;DR for engineering teams What broke MongoDB’s zlib decompression path trusts attacker-controlled length metadata. Impact Unauthenticated heap memory disclosure. What leaks Raw process memory fragments including credentials, tokens, config strings, runtime metadata, and recently processed data. Auth required None. Noise level Low. No crashes. No malformed packets. Minimal logs. Exposure 213,490 publicly reachable MongoDB instances observed via Shodan on 29 Dec 2025. Fix Upgrade immediately or disable zlib compression. Reality check Public PoC exists. Scanning is trivial. Exploitation effort is low (links below on the exploit lab, explaination and scanners if you want to find yours Links - Full Detailed Blog: https://phoenix.security/mongobleed-vulnerability-cve-2025-14847/ - Exploit explanation and lab: https://youtu.be/EZ4euRyDI8I - Exploit Description (llm generated from article): https://youtu.be/lxfNSICAaSc - Github Exploit for Mongobleed: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847/tree/main - Github Scanner for web: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847/tree/main/scanner - Github Scanner for Code: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847/tree/main/code-sca Affected versions MongoDB Server Vulnerable versions Fixed versions 8.2.x 8.2.0 – 8.2.2 8.2.3 8.0.x 8.0.0 – 8.0.16 8.0.17 7.0.x 7.0.0 – 7.0.27 7.0.28 6.0.x 6.0.0 – 6.0.26 6.0.27 5.0.x 5.0.0 – 5.0.31 5.0.32 4.4.x 4.4.0 – 4.4.29 4.4.30 4.2.x All EOL 4.0.x All EOL 3.6.x All EOL SAAS version of MongoDB is already patched Technical anatomy MongoDB supports network-level message compression. When a client negotiates compression, each compressed message includes an uncompressedSize field. The vulnerable flow looks like this: Client sends a syntactically valid compressed MongoDB wire-protocol message Message declares an inflated uncompressedSize MongoDB allocates a heap buffer of that declared size zlib inflates only the real payload into the start of the buffer The remaining buffer space stays uninitialized MongoDB treats the entire buffer as valid BSON BSON parsing walks past real data into leftover heap memory Memory gets leaked out, not a lot of IOC to detect Root cause (code-level) The vulnerability originates in MongoDB’s zlib message decompression logic: src/mongo/transport/message_compressor_zlib.cpp In the vulnerable implementation, the decompression routine returned: return {output.length()}; output.length() represents the allocated buffer size , not the number of bytes actually written by ::uncompress(). If the attacker declares a larger uncompressedSize than the real decompressed payload, MongoDB propagates the allocated size forward. Downstream BSON parsing logic consumes memory beyond the true decompression boundary. The fix replaces this with: return length; length is the actual number of bytes written by the decompressor. Additional regression tests were added in message_compressor_manager_test.cpp to explicitly reject undersized decompression results with ErrorCodes::BadValue. This closes the disclosure path. Why is this reachable pre-auth Compression negotiation occurs before authentication. The exploit does not require: malformed compression streams memory corruption primitives race conditions timing dependencies It relies on: attacker-controlled metadata valid compression Incorrect length propagation Any network client can trigger it, hence is super easy to deploy Exploitation reality A working proof of concept exists and is public, more details: Original PoC by Joe Desimone https://github.com/joe-desimone/mongobleed/ Technical analysis and reproduction details https://doublepulsar.com/merry-christmas-day-have-a-mongodb-security-incident-9537f54289eb Github Exploit for Mongobleed: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847/tree/main Github Scanner for web: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847/tree/main/scanner Scanner for Code: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847/tree/main/code-sca The PoC: negotiates compression sends crafted compressed messages iterates offsets dumps leaked memory fragments to disk and saves it locally No credentials required. No malformed packets. Repeatable probing. What actually leaks Heap memory is messy. That is the point. Observed and expected leak content includes: database credentials SCRAM material session tokens API keys WiredTiger config strings file paths container metadata client IPs and connection details fragments of recently processed documents The PoC output already shows real runtime artifacts. This is not RCE, but steals pieces of memory, which is not as bad as RCE but still very dangerous (Heartbleed anyone) MongoBleed does not provide native remote code execution. There is no instruction pointer control. No shellcode injection. No crash exploitation. What it provides is privilege discovery . Memory disclosure enables: credential reuse token replay service-to-service authentication CI/CD compromise cloud control plane access A leaked Kubernetes token is better than RCE. A leaked CI token is persistent RCE. A leaked cloud role is full environment control. This is RCE-adjacent through legitimate interfaces. How widespread is this MongoDB is everywhere. Shodan telemetry captured on 29 December 2025 shows: 213,490 publicly reachable MongoDB instances Version breakdown (port 27017): Version Count Query All versions 201,659 product:\"MongoDB\" port:27017 8.2.x 3,164 \"8.2.\" 8.0.x (≠8.0.17) 13,411 \"8.0.\" -\"8.0.17\" 7.0.x (≠7.0.28) 19,223 \"7.0.\" -\"7.0.28\" 6.0.x (≠6.0.27) 3,672 \"6.0.\" -\"6.0.27\" 5.0.x (≠5.0.32) 1,887 \"5.0.\" -\"5.0.32\" 4.4.x (≠4.4.30) 3,231 \"4.4.\" -\"4.4.30\" 4.2.x 3,138 \"4.2.\" 4.0.x 3,145 \"4.0.\" 3.6.x 1,145 \"3.6.\" Most are directly exposed on the default port, not shielded behind application tiers. Core behaviors that matter Unauthenticated Any client can trigger it. Remote and repeatable Memory offsets can be probed over time. Low noise No crashes. Logs stay quiet. Data agnostic Whatever was on the heap becomes fair game. This favors patient actors and automation. Detection guidance IOC Identification Network-level signals Look for: Inbound traffic to port 27017 compressed MongoDB messages Repeated requests with: large declared uncompressedSize small actual payloads high request frequency without auth attempts Process-level signals Watch for: elevated CPU on mongod without query load repeated short-lived connections memory allocation spikes abnormal BSON parsing warnings Post-leak fallout Check for: new MongoDB users role changes admin command usage anomalies auth attempts from unfamiliar IPs API key failures cloud IAM abuse new outbound connections If you see filesystem artifacts or shells, you are already past exploitation. Temporary protections If you cannot upgrade immediately: Disable zlib compression Remove zlib from networkMessageCompressors Restrict network access Remove direct internet exposure Enforce allowlists These are stopgaps. The bug lives in the server - hence patch Tooling and validation A full test suite is available, combining: exploit lab (vulnerable + patched instances) network scanner code scanner for repos and Dockerfiles Repository: https://github.com/Security-Phoenix-demo/mongobleed-exploit-CVE-2025-14847 This allows: safe reproduction exposure validation pre-deployment detection Why this one matters MongoBleed does not break crypto it breaks data and memory The database trusts client-supplied lengths. Attackers live for that assumption. Databases are part of your application attack surface. Infrastructure bugs leak application secrets. Vulnerability management without reachability is incomplete. Patch this. Then ask why it was reachable. submitted by /u/Diligent-Side4917 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q18utv/detailed_analysis_mongobleed_cve202514847_memory/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T16:58:09+00:00",
    "published_ts": 1767286689,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Cloud / SaaS",
      "Web / API Security",
      "Identity / Access"
    ],
    "curated": true
  },
  {
    "title": "Trust Wallet browser extension knocked offline by Chrome Store 'bug,' CEO says",
    "summary": "The Trust Wallet update includes a feature to help victims of the $7 million Christmas hack submit reimbursement claims for lost funds.",
    "link": "https://cointelegraph.com/news/trust-wallet-ceo-google-chrome-browser-extension-delayed?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T16:57:03+00:00",
    "published_ts": 1767286623,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Cybersecurity pros admit to moonlighting as ransomware scum",
    "summary": "submitted by /u/NISMO1968 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q18mqq/cybersecurity_pros_admit_to_moonlighting_as/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T16:48:54+00:00",
    "published_ts": 1767286134,
    "smart_groups": [
      "Curated",
      "Ransomware"
    ],
    "curated": true
  },
  {
    "title": "Trust Wallet confirms second Shai-Hulud supply-chain attack, $8.5M in crypto stolen",
    "summary": "Trust Wallet says a second Shai-Hulud supply-chain attack likely compromised its Chrome extension, leading to the theft of about $8.5M in crypto. Trust Wallet linked a second Shai-Hulud supply-chain attack to its Chrome extension hack, which resulted in the theft of about $8.5 million in crypto assets. The investigation reveals that the attacker independently developed […]",
    "link": "https://securityaffairs.com/186398/hacking/trust-wallet-confirms-second-shai-hulud-supply-chain-attack-8-5m-in-crypto-stolen.html",
    "source": "Security Affairs",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T16:16:23+00:00",
    "published_ts": 1767284183,
    "smart_groups": [
      "Curated"
    ],
    "curated": true
  },
  {
    "title": "The biggest cybersecurity and cyberattack stories of 2025",
    "summary": "2025 was a big year for cybersecurity, with cyberattacks, data breaches, threat groups reaching new notoriety levels, and, of course, zero-day flaws exploited in breaches. Some stories, though, were more impactful or popular with our readers than others. This article explores 15 of the biggest cybersecurity stories of 2025. [...]",
    "link": "https://www.bleepingcomputer.com/news/security/the-biggest-cybersecurity-and-cyberattack-stories-of-2025/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T16:15:26+00:00",
    "published_ts": 1767284126,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Cloud / SaaS",
      "Data Breaches / Leaks"
    ],
    "curated": true
  },
  {
    "title": "Secure Integration of AI in Critical Systems",
    "summary": "submitted by /u/Savings-Escape6663 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q17lf3/secure_integration_of_ai_in_critical_systems/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T16:05:21+00:00",
    "published_ts": 1767283521,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Help me choose my next security cert",
    "summary": "I don’t like to do a lot of certifications so I am confused which certification to go for. I am already eWPTX, CRTP, CCSK certified with 4.5 YOE in this field. I am currently into Pentesting and product security and I eventually plan to go on to principal architect roles or lead product security roles. Help me choose between - CISSP OSCP+ AWS Security Speciality submitted by /u/Parvinhisprime [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q17dyn/help_me_choose_my_next_security_cert/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T15:56:39+00:00",
    "published_ts": 1767282999,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "ThreatsDay Bulletin: GhostAd Drain, macOS Attacks, Proxy Botnets, Cloud Exploits, and 12+ Stories",
    "summary": "The first ThreatsDay Bulletin of 2026 lands on a day that already feels symbolic — new year, new breaches, new tricks. If the past twelve months taught defenders anything, it’s that threat actors don’t pause for holidays or resolutions. They just evolve faster. This week’s round-up shows how subtle shifts in behavior, from code tweaks to job scams, are rewriting what “cybercrime” looks like in",
    "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ghostad-drain-macos.html",
    "source": "The Hacker News",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T15:52:00+00:00",
    "published_ts": 1767282720,
    "smart_groups": [
      "Curated",
      "Exploit / PoC",
      "Malware / Payloads"
    ],
    "curated": true
  },
  {
    "title": "Architecture mistakes to avoid",
    "summary": "Just joined a new company (~5k employees) and tasked with re-architecting the cybersecurity toolchain. It’s my first time architecting end-to-end (previous set up was immature). What tools/features make your life harder than it should be? why? so i don’t make the same mistakes. Or what workflows/interesting architecture hacks between tools did you create that you are proud of and made your life easier submitted by /u/CharacterAttitude831 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q172e4/architecture_mistakes_to_avoid/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T15:42:38+00:00",
    "published_ts": 1767282158,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Top 10 High-Risk Vulnerabilities Of 2025 that Exploited in the Wild",
    "summary": "The cybersecurity landscape in 2025 has been marked by an unprecedented surge in critical vulnerabilities, with over 21,500 CVEs disclosed in the first half of the year alone, representing a 16-18% increase compared to 2024. Among these, a select group of vulnerabilities stands out due to their exceptional severity, active exploitation in the wild, and […] The post Top 10 High-Risk Vulnerabilities Of 2025 that Exploited in the Wild appeared first on Cyber Security News .",
    "link": "https://cybersecuritynews.com/10-high-risk-vulnerabilities-of-2025/",
    "source": "Cyber Security News (FeedBurner)",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T15:23:04+00:00",
    "published_ts": 1767280984,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "A 2026 lessons learned Question",
    "summary": "What’s a good advice you would offer to yourself as a SOC Analyst L1 or having been one at some point (please mention if you’re (you were) MSSP)? What good practices really did change the game for you? What would you have done differently? Do you check daily hack news, mitre attack, etc? What’s a daily routine step(s) for you that helped you, doesn’t need to be a career related one? submitted by /u/Professional-Pin9823 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q16j6b/a_2026_lessons_learned_question/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T15:19:28+00:00",
    "published_ts": 1767280768,
    "smart_groups": [
      "Identity / Access"
    ],
    "curated": false
  },
  {
    "title": "New GlassWorm malware wave targets Macs with trojanized crypto wallets",
    "summary": "A fourth wave of the \"GlassWorm\" campaign is targeting macOS developers with malicious VSCode/OpenVSX extensions that deliver trojanized versions of crypto wallet applications. [...]",
    "link": "https://www.bleepingcomputer.com/news/security/new-glassworm-malware-wave-targets-macs-with-trojanized-crypto-wallets/",
    "source": "BleepingComputer",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T15:18:23+00:00",
    "published_ts": 1767280703,
    "smart_groups": [
      "Curated",
      "Malware / Payloads"
    ],
    "curated": true
  },
  {
    "title": "Am I ready to do Security+?",
    "summary": "submitted by /u/ExpensiveAd734 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q15xzv/am_i_ready_to_do_security/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T14:53:20+00:00",
    "published_ts": 1767279200,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "The Story of a Perfect Exploit Chain: Six Bugs That Looked Harmless Until They Became Pre-Auth RCE in a Security Appliance",
    "summary": "submitted by /u/wtfse [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1q15r3i/the_story_of_a_perfect_exploit_chain_six_bugs/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T14:44:14+00:00",
    "published_ts": 1767278654,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "Anatomy of a $1.6B Failure: The Change Healthcare Forensic Autopsy",
    "summary": "The Change Healthcare breach wasn't just a \"hack\"—it was a textbook example of how M&A technical debt and a \"trusted perimeter\" model can paralyze an entire national industry. I’ve put together a deep-dive forensic breakdown of exactly how the architecture failed. The TL;DR on the Architectural Breakdown: The Entry Point: A legacy Citrix remote access portal that was never fully migrated to modern identity governance. [ 05:02 ] The Fatal Flaw: Zero MFA. Valid credentials were used to walk right through the \"front door\" without a single challenge. [ 01:27 , 06:54 ] The 9-Day Dwell Time: Attackers spent over a week \"living off the land,\" blending into normal admin traffic to map domain controllers and move laterally. [ 07:30 , 08:02 ] Exfiltration Scale: Approximately 6TB of data (touching 1 in 3 US patient records) was stolen before the encryption payload was even detonated. [ 02:30 , 08:26 ] The Reliability Paradox: The systemic outage was actually triggered by the containment effort. Severing the \"infected limb\" logically and physically also killed the essential transaction engines and redundancy systems that were too tightly coupled to the primary infrastructure. [ 09:13 , 09:30 ] Key Takeaways for Senior Engineers & Architects: Identity is the New Perimeter: Firewalls are irrelevant if your IdP is weak. Without MFA on every single external entry point, you don’t have a perimeter; you have a welcome mat. [ 12:05 , 12:30 ] The M&A Quarantine Rule: Assume any acquired network is already compromised. Treat it as \"hostile internet\" until every endpoint meets your security baseline. Do not bridge the networks prematurely. [ 12:43 , 12:58 ] Complexity is the Sanctuary of the Adversary: The more complex your legacy footprint, the more shadows there are for attackers to hide in. Simplification isn't just an operational goal—it’s a security mandate. [ 13:06 , 13:24 ] Full Video Breakdown with Network Topology Visuals: https://www.youtube.com/watch?v=8Gvlb5rWvao submitted by /u/CornerNo3079 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q15nuo/anatomy_of_a_16b_failure_the_change_healthcare/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T14:40:02+00:00",
    "published_ts": 1767278402,
    "smart_groups": [
      "Identity / Access"
    ],
    "curated": false
  },
  {
    "title": "React2Shell under attack: RondoDox Botnet spreads miners and malware",
    "summary": "RondoDox botnet exploits the critical React2Shell flaw (CVE-2025-55182) to infect vulnerable Next.js servers with malware and cryptominers. CloudSEK researchers warn that the RondoDox botnet is exploiting the critical React2Shell flaw (CVE-2025-55182) to drop malware and cryptominers on vulnerable Next.js servers. “CloudSEK’s report details a persistent nine-month RondoDoX botnet campaign targeting IoT devices and web applications. Recently, the […]",
    "link": "https://securityaffairs.com/186386/uncategorized/react2shell-under-attack-rondodox-botnet-spreads-miners-and-malware.html",
    "source": "Security Affairs",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T14:31:42+00:00",
    "published_ts": 1767277902,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Malware / Payloads"
    ],
    "curated": true
  },
  {
    "title": "r/netsec monthly discussion & tool thread",
    "summary": "Questions regarding netsec and discussion related directly to netsec are welcome here, as is sharing tool links. Rules & Guidelines Always maintain civil discourse. Be awesome to one another - moderator intervention will occur if necessary. Avoid NSFW content unless absolutely necessary. If used, mark it as being NSFW. If left unmarked, the comment will be removed entirely. If linking to classified content, mark it as such. If left unmarked, the comment will be removed entirely. Avoid use of memes. If you have something to say, say it with real words. All discussions and questions should directly relate to netsec. No tech support is to be requested or provided on r/netsec . As always, the content & discussion guidelines should also be observed on r/netsec . Feedback Feedback and suggestions are welcome, but don't post it here. Please send it to the moderator inbox. submitted by /u/albinowax [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1q15fud/rnetsec_monthly_discussion_tool_thread/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T14:29:32+00:00",
    "published_ts": 1767277772,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "The XRP Army got everything except $5 price: Will 2026 deliver?",
    "summary": "XRP scored every major win in 2025 with the SEC case resolved and spot ETFs launched, yet the price crashed 50%, with the $5 target remaining elusive.",
    "link": "https://cointelegraph.com/news/xrp-army-got-everything-asked-for-except-5-xrp-will-2026-deliver?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T14:15:00+00:00",
    "published_ts": 1767276900,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Base’s creator coin experiment meets resistance after Nick Shirley launch",
    "summary": "Base’s push into creator coins is facing mounting criticism from traders and builders after Nick Shirley’s token on Zora spiked to about a $9 million valuation and then promptly slumped.",
    "link": "https://cointelegraph.com/news/base-creator-coin-experiment-meets-resistance?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T14:06:19+00:00",
    "published_ts": 1767276379,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "All of Trump’s Pardons of Prominent Crypto Figures—So Far",
    "summary": "The pardons cemented crypto as both an economic force and a partisan issue in Washington.",
    "link": "https://decrypt.co/348546/trump-crypto-pardons-2025",
    "source": "Decrypt",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T14:01:03+00:00",
    "published_ts": 1767276063,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "Crypto privacy in 2026: Compliance-friendly tools take center stage",
    "summary": "Crypto privacy is approaching an inflection point as relevant lawsuits near their conclusions and developers pivot toward designs that ensure privacy while appeasing regulators.",
    "link": "https://cointelegraph.com/news/crypto-privacy-in-2026-compliance-friendly-tools-take-center-stage?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T14:00:00+00:00",
    "published_ts": 1767276000,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "Note to Self: 2027 Says Thank You",
    "summary": "Imagine you did everything right this year and your future self sent a thank-you note",
    "link": "https://www.security.com/expert-perspectives/note-self-2027",
    "source": "Broadcom – Symantec Blogs",
    "type": "vendors",
    "type_label": "Vendors & Product Blogs",
    "published": "2026-01-01T14:00:00+00:00",
    "published_ts": 1767276000,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Best Way to Build an Active Directory Pentest Lab on Linux? (KVM vs VirtualBox)",
    "summary": "I want to learn Active Directory pentesting , and I’m thinking of starting from the IT / administration side first to build solid fundamentals. I’m a Linux user , and I want to set up a small lab with: Windows Server 2019 (Domain Controller) Windows 10 client My question is about virtualization on Linux: What is the better option for this kind of lab? virt-manager (QEMU/KVM) VirtualBox I care about: Stability Networking flexibility (AD, DNS, LDAP, Kerberos) Performance Realism for pentesting scenarios Any recommendations or lab setup tips are appreciated. submitted by /u/zicotito [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q14j6i/best_way_to_build_an_active_directory_pentest_lab/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T13:45:16+00:00",
    "published_ts": 1767275116,
    "smart_groups": [
      "Windows / Microsoft",
      "Linux / Unix"
    ],
    "curated": false
  },
  {
    "title": "SOL accumulation tops crypto trends on New Year’s Day: Santiment",
    "summary": "Whale accumulation across Solana tokens is headlining crypto-related social buzz as 2026 begins, according to data from Santiment.",
    "link": "https://cointelegraph.com/news/solana-whale-accumulation-santiment-crypto-trends-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T13:29:34+00:00",
    "published_ts": 1767274174,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Bithumb flags $200M in dormant crypto assets across 2.6M inactive accounts",
    "summary": "Millions of long-inactive users still hold crypto at Bithumb, highlighting how early retail capital can remain untouched for years.",
    "link": "https://cointelegraph.com/news/bithumb-dormant-crypto-assets-200m-inactive-accounts?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T13:25:27+00:00",
    "published_ts": 1767273927,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "I changed 6 settings on my Roku TV to instantly improve its performance",
    "summary": "There are a number of ways to optimize your TV's operating system for faster performance. Here are my go-tos.",
    "link": "https://www.zdnet.com/article/best-roku-tv-settings-change-improve-performance/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T13:00:48+00:00",
    "published_ts": 1767272448,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Can Solana shed its memecoin image in 2026?",
    "summary": "Solana’s bid to move beyond memecoins will depend on whether its upgrades can deliver predictable execution for serious onchain finance.",
    "link": "https://cointelegraph.com/news/can-solana-shed-memecoin-image-2026?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T13:00:00+00:00",
    "published_ts": 1767272400,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "built an SSRF prevention library",
    "summary": "nullspace - ssrf protection for node.js blocks private ips, cloud metadata, loopback handles encoding tricks (0x7f000001 = 127.0.0.1) dns rebinding protection built-in zero deps github : [ https://github.com/bymehul/nullspace ] submitted by /u/Inner-Combination177 [link] [comments]",
    "link": "https://www.reddit.com/r/netsec/comments/1q13m87/built_an_ssrf_prevention_library/",
    "source": "/r/netsec",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T12:56:33+00:00",
    "published_ts": 1767272193,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Tired of LLM scrapers eating your AWS bandwidth? Here is how to block them using WAF.",
    "summary": "Has anyone else noticed a massive spike in bot traffic recently? Between GPTBot, CCBot, and the dozen other AI scrapers, it’s getting harder to keep site performance stable and AWS costs down. I recently spent some time digging into AWS WAF configurations to specifically target these scrapers without breaking legitimate SEO crawlers (like Googlebot). I found that the best approach is a mix of: Enabling the AWS Managed Rules (Bot Control). Setting up custom rules for specific AI User-Agents. Implementing rate limiting to catch the \"stealthy\" aggressive bots. I wrote a detailed breakdown of the exact WAF rules and implementation steps here: https://sergiiblog.com/devsecops-on-aws-defend-against-llm-scrapers-bot-traffic/ Curious to hear—is anyone else seeing a big impact on their cloud bill from these bots, or are you just letting them crawl? submitted by /u/sergii-demianchuk [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q11qcw/tired_of_llm_scrapers_eating_your_aws_bandwidth/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T11:01:04+00:00",
    "published_ts": 1767265264,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "This new Linux desktop runs like an app on your existing desktop - and I highly recommend it",
    "summary": "Portable and modular, Orbitiny runs on top of your existing window manager - such as KDE Plasma or GNOME - like a regular app.",
    "link": "https://www.zdnet.com/article/orbitiny-portable-modular-unique-linux-desktop/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T11:01:01+00:00",
    "published_ts": 1767265261,
    "smart_groups": [
      "Linux / Unix"
    ],
    "curated": false
  },
  {
    "title": "This AirTag alternative fits in my wallet and works just as well with Android phones",
    "summary": "Rolling Square's AirCard Pro Dual features one of the loudest buzzers I've tested, along with glow-in-the-dark inserts.",
    "link": "https://www.zdnet.com/article/rolling-square-aircard-dual-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T11:00:46+00:00",
    "published_ts": 1767265246,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Are there no jobs in cybersec or am i looking at the wrong places",
    "summary": "submitted by /u/adocrox [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q111px/are_there_no_jobs_in_cybersec_or_am_i_looking_at/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T10:16:40+00:00",
    "published_ts": 1767262600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "The most premium work laptop I tested in 2025 lets you finally ditch Wi-Fi for good",
    "summary": "Microsoft's Surface Laptop 5G combines a positively premium build with an always-on connection.",
    "link": "https://www.zdnet.com/article/microsoft-surface-laptop-5g-review/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T10:00:58+00:00",
    "published_ts": 1767261658,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "WhatsApp Crypt Tool to Encrypt and Decrypt WhatsApp Backups",
    "summary": "An open-source solution for handling encrypted WhatsApp backups. The wa-crypt-tools suite, hosted on GitHub, decrypts and encrypts .crypt12, .crypt14, and .crypt15 files from WhatsApp and WhatsApp Business, provided users supply the required key file or 64-character key.​ wa-crypt-tools simplifies access to WhatsApp’s end-to-end encrypted backups, which store chat histories, media, and metadata in SQLite databases […] The post WhatsApp Crypt Tool to Encrypt and Decrypt WhatsApp Backups appeared first on Cyber Security News .",
    "link": "https://cybersecuritynews.com/whatsapp-crypt-tool/",
    "source": "Cyber Security News (FeedBurner)",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T10:00:36+00:00",
    "published_ts": 1767261636,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Web / API Security"
    ],
    "curated": true
  },
  {
    "title": "Enterprise Spotlight: Setting the 2026 IT agenda",
    "summary": "IT leaders are setting their operations strategies for 2026 with an eye toward agility, flexibility, and tangible business results. Download the January 2026 issue of the Enterprise Spotlight from the editors of CIO, Computerworld, CSO, InfoWorld, and Network World and learn about the trends and technologies that will drive the IT agenda in the year ahead.",
    "link": "https://us.resources.csoonline.com/resources/download-the-2026-it-agenda-spotlight-report/",
    "source": "CSO Online",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T10:00:00+00:00",
    "published_ts": 1767261600,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Happy New Year!",
    "summary": "Heartfelt thanks to the DEF CON community for your support in 2025. Here's hoping your 2026 exceeds your dreams. We've got big plans for the New Year. In addition to DC34 in Las Vegas we're returning to Bahrain and adding DEF CON Singapore. New CTF runners. More trainings. We're excited and we hope you are, too. Keep in touch with us for updates and deadlines. Look out for each other. See you soon.",
    "link": "https://defcon.org/html/links/dc-news.html#newyear26",
    "source": "https://defcon.org/defconrss.xml",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T09:40:37+00:00",
    "published_ts": 1767260437,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Tether snaps up another 8,888 BTC, now fifth-largest Bitcoin wallet",
    "summary": "Tether closed out 2025 with an 8,888 BTC purchase, increasing its disclosed Bitcoin holdings to more than 96,000 BTC.",
    "link": "https://cointelegraph.com/news/tether-buys-another-8-888-btc?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T09:40:16+00:00",
    "published_ts": 1767260416,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Two U.S. CyberSecurity Pros Plead Guilty for Working as ALPHV/BlackCat Affiliates",
    "summary": "A federal court in the Southern District of Florida has accepted guilty pleas from two cybersecurity professionals who used their expertise to conduct ransomware attacks rather than stop them. Ryan Goldberg, 40, from Georgia, and Kevin Martin, 36, from Texas, pleaded guilty to conspiracy to commit extortion through ransomware operations. Between April and December 2023, […] The post Two U.S. CyberSecurity Pros Plead Guilty for Working as ALPHV/BlackCat Affiliates appeared first on Cyber Security News .",
    "link": "https://cybersecuritynews.com/u-s-cybersecurity-pros-plead-guilty-as-alphv-blackcat-affiliates/",
    "source": "Cyber Security News (FeedBurner)",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T09:39:39+00:00",
    "published_ts": 1767260379,
    "smart_groups": [
      "Curated",
      "Ransomware"
    ],
    "curated": true
  },
  {
    "title": "RondoDox Botnet Exploits Critical React2Shell Flaw to Hijack IoT Devices and Web Servers",
    "summary": "Cybersecurity researchers have disclosed details of a persistent nine-month-long campaign that has targeted Internet of Things (IoT) devices and web applications to enroll them into a botnet known as RondoDox. As of December 2025, the activity has been observed leveraging the recently disclosed React2Shell (CVE-2025-55182, CVSS score: 10.0) flaw as an initial access vector, CloudSEK said in an",
    "link": "https://thehackernews.com/2026/01/rondodox-botnet-exploits-critical.html",
    "source": "The Hacker News",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T09:19:00+00:00",
    "published_ts": 1767259140,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Malware / Payloads"
    ],
    "curated": true
  },
  {
    "title": "Favorite New or Underrated Products",
    "summary": "As we enter the New Year I’m looking to potentially bring in some new tools/products into my company. What new products that you tried in the past year do you love or existing products you think are underrated and worth evaluating? Why? Or are there some that I should absolutely avoid and not waste my time on (e.g. over promised and under delivered) submitted by /u/AnyDistance9238 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q1037d/favorite_new_or_underrated_products/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T09:11:37+00:00",
    "published_ts": 1767258697,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Trader bags $1M from ‘abnormal’ BROCCOLI714 memecoin activity on Binance",
    "summary": "A trader claimed to have made $1 million by timing a long-short trade after spotting abnormal activity by a market maker account on Binance, while the exchange denied any security breach.",
    "link": "https://cointelegraph.com/news/trader-1m-profit-binance-market-maker-broccoli714?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T08:37:00+00:00",
    "published_ts": 1767256620,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Infosecurity's Top 10 Cybersecurity Stories of 2025",
    "summary": "Explore Infosecurity Magazine’s most-read cybersecurity stories of 2025, from major vendor shake-ups and zero-day exploits to AI-driven threats and supply chain attacks",
    "link": "https://www.infosecurity-magazine.com/news/infosecurity-top-10-stories-2025/",
    "source": "Infosecurity Magazine – News",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T08:30:00+00:00",
    "published_ts": 1767256200,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC"
    ],
    "curated": true
  },
  {
    "title": "Interviewers, hiring managers, and leads: do you look for, prefer, or value any data science or machine learning skills in highly technical positions you oversee? Does it influence your decision or make candidates stand out in any way?",
    "summary": "First, I want to point out that AI/ML does not refer to LLMs, either their use/development of, or ability to integrate them into their own particular skill set. I'm referring to the use of unsupervised learning, clustering, embeddings, regression analysis, pattern detection, time series analysis...you know, that stuff. I'm a senior level analyst (threat hunter) that specializes in data science and machine learning. I picked up the additional skills while learning how to hunt through data to detect anomalies and how to differentiate them from normal behaviors but I use those as analytical tools. To paint a clearer picture, I code out these models and representations myself rather than using typical tools and bolted-on capabilities in existing SIEMs, so it's still much more into the weeds in the DS side. I mention that above to ask if those types of skills are sought after while looking through applications and resumes. I rarely see them in many job postings that aren't DS-specific roles. Personally, I see these skills as highly desirable in a top-tier analyst when paired with a competency and exposure to many of the most common tools and platforms in modern security operations because most of secops is reactive with extra time being available to proficient analysts who can knock out alerts quickly and efficiently. That extra time should be spent digging through data, low-level alerts, and logs, looking for anything that might have been missed. It doesn't need to be said that that is a lot of data to dive into. The bottleneck is analysts' ability to parse the information and correlate. And here is where I find those DS/ML skills really paying off. Sure, there's some bootstrapping time invested in building out a pipeline but once that is done (correctly) and it's put to use, it hoovers in data and spits out knowledge objects useful for hunting and meta-analysis. Sorry if it sounds like I'm on a soapbox, I was trying to explain the benefits of having the skills. Rather than relying on LLMs or bolted-on AI agents in security appliances to find the things that are missed, having a human involved in that process is necessary and would be an advantageous posture. Someone who isn't knowledgeable doesn't help because you don't know what you don't know (ie, lacking threat hunting and/or DS skills) and also, we know that LLMs hallucinate. I'm not dogging chatbots and intelligent agents, I'm just trying to block the \"yea, we use AI (LLMs) for that\" argument. Getting back to the original question--are those skills a plus for the roles you are looking to fill? Would you pass up a candidate if they had those skills over a similar candidate who didn't? Are leads in your organization looking to bring both cyber analytical and DS/ML skills together into a single role? Plainly stated: everyone has heard that the mythical unicorn would be amazing to have on their team but is anyone out there willing to actually capture and embrace one? submitted by /u/WadeEffingWilson [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0zbir/interviewers_hiring_managers_and_leads_do_you/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T08:19:34+00:00",
    "published_ts": 1767255574,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Experiences with Cyolo vs BeyondTrust / CyberArk for OT remote access?",
    "summary": "Hey all, I'm an OT engineer at a manufacturing company, and we're rethinking how we handle remote access to our OT environment. Today we're still primarily relying on VPNs + jump servers , which works… but comes with all the usual headaches: vendor access delays, poor visibility into sessions, and constant friction with IT/security. We're now evaluating a proper secure remote access (SRA) solution and have been looking seriously at BeyondTrust and CyberArk , since they're the most established names. That said, we've also had a few conversations with Cyolo . On paper, their approach seems much more OT-friendly (identity-based, application-level access, less network complexity), but they're obviously far less known than the prominent PAM vendors. Before we go further, I wanted to ask the community: Has anyone here actually deployed Cyolo in an OT/manufacturing environment? How does it compare in practice vs BeyondTrust or CyberArk? Any gotchas, limitations, or things you wish you knew earlier? Appreciate any real-world feedback—good or bad. submitted by /u/SAK-1996 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0z4a5/experiences_with_cyolo_vs_beyondtrust_cyberark/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T08:05:40+00:00",
    "published_ts": 1767254740,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Mobile fraud on the rise in South Africa",
    "summary": "As South Africans take advantage of the ease and convenience of the digital financial world, it has become increasingly more simple for threat actors to take advantage. Deceiving the average individual has become rather simple for cybercriminals as the internet brings them a wealth of information. All it takes is one or two rather official […] The post Mobile fraud on the rise in South Africa appeared first on Da Vinci Cybersecurity: Leading Cyber Security Services in South Africa. .",
    "link": "https://davinciforensics.co.za/cybersecurity/digital-financial-fraud-south-africa/",
    "source": "Davinci Forensics – Cybersecurity",
    "type": "dfir",
    "type_label": "DFIR & Forensics",
    "published": "2026-01-01T08:05:00+00:00",
    "published_ts": 1767254700,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Pluralistic: The Post-American Internet (01 Jan 2026)",
    "summary": "Today's links The Post-American Internet: My speech from Hamburg's Chaos Communications Congress. Hey look at this: Delights to delectate. Object permanence: Error code 451; Public email address Mansplaining Lolita; NSA backdoor in Juniper Networks; Don't bug out; Nurses whose shitty boss is a shitty app. Upcoming appearances: Where to find me. Recent appearances: Where I've been. Latest books: You keep readin' em, I'll keep writin' 'em. Upcoming books: Like I said, I'll keep writin' 'em. Colophon: All the rest. The Post-American Internet (permalink) On December 28th, I delivered a speech entitled \"A post-American, enshittification-resistant internet\" for 39C3, the 39th Chaos Communications Congress in Hamburg, Germany. This is the transcript of that speech. https://archive.org/download/doctorow-39c3/39c3-1421-eng-A_post-American_enshittification-resistant_internet.mp4 Many of you know that I'm an activist with the Electronic Frontier Foundation – EFF. I'm about to start my 25th year there. I know that I'm hardly unbiased, but as far as I'm concerned, there's no group anywhere on Earth that does the work of defending our digital rights better than EFF. I'm an activist there, and for the past quarter-century, I've been embroiled in something I call \"The War on General Purpose Computing.\" If you were at 28C3, 14 years ago, you may have heard me give a talk with that title. Those are the trenches I've been in since my very first day on the job at EFF, when I flew to Los Angeles to crash the inaugural meeting of something called the \"Broadcast Protection Discussion Group,\" an unholy alliance of tech companies, media companies, broadcasters and cable operators. They'd gathered because this lavishly corrupt American congressman, Billy Tauzin, had promised them a new regulation – a rule banning the manufacture and sale of digital computers, unless they had been backdoored to specifications set by that group, specifications for technical measures to block computers from performing operations that were dispreferred by these companies' shareholders. That rule was called \"the Broadcast Flag,\" and it actually passed through the American telecoms regulator, the Federal Communications Commission. So we sued the FCC in federal court, and overturned the rule. We won that skirmish, but friends, I have bad news, news that will not surprise you. Despite wins like that one, we have been losing the war on the general purpose computer for the past 25 years. Which is why I've come to Hamburg today. Because, after decades of throwing myself against a locked door, the door that leads to a new, good internet, one that delivers both the technological self-determination of the old, good internet, and the ease of use of Web 2.0 that let our normie friends join the party, that door has been unlocked. Today, it is open a crack. It's open a crack! And here's the weirdest part: Donald Trump is the guy who's unlocked that door. Oh, he didn't do it on purpose! But, thanks to Trump's incontinent belligerence, we are on the cusp of a \"Post-American Internet,\" a new digital nervous system for the 21st century. An internet that we can build without worrying about America's demands and priorities. Now, don't get me wrong, I'm not happy about Trump or his policies. But as my friend Joey DaVilla likes to say \"When life gives you SARS, you make sarsaparilla.\" The only thing worse than experiencing all the terror that Trump has unleashed on America and the world would be going through all that and not salvaging anything out of the wreckage. That's what I want to talk to you about today: the post-American Internet we can wrest from Trump's chaos. A post-American Internet that is possible because Trump has mobilized new coalition partners to join the fight on our side. In politics, coalitions are everything. Any time you see a group of people suddenly succeeding at a goal they have been failing to achieve, it's a sure bet that they've found some coalition partners, new allies who don't want all the same thing as the original forces, but want enough of the same things to fight on their side. That's where Trump came from: a coalition of billionaires, white nationalists, Christian bigots, authoritarians, conspiratorialists, imperialists, and self-described \"libertarians\" who've got such a scorching case of low-tax brain worms that they'd vote for Mussolini if he'd promise to lower their taxes by a nickel. And what's got me so excited is that we've got a new coalition in the War on General Purpose Computers: a coalition that includes the digital rights activists who've been on the lines for decades, but also people who want to turn America's Big Tech trillions into billions for their own economy, and national security hawks who are quite rightly worried about digital sovereignty. My thesis here is that this is an unstoppable coalition. Which is good news! For the first time in decades, victory is in our grasp. # So let me explain: 14 years ago, I stood in front of this group and explained the \"War on General Purpose Computing.\" That was my snappy name for this fight, but the boring name that they use in legislatures for it is \"anticircumvention,\" Under anticircumvention law, it's a crime to alter the functioning of a digital product or service, unless the manufacturer approves of your modification, and – crucially – this is true whether or not your modification violates any other law. Anticircumvention law originates in the USA: Section 1201 of the Digital Millennium Copyright Act of 1998 establishes a felony punishable by a five year prison sentence and a $500,000 fine for a first offense for bypassing an \"access control\" for a copyrighted work. So practically speaking, if you design a device or service with even the flimsiest of systems to prevent modification of its application code or firmware, it's a felony – a jailable felony – to modify that code or firmware. It's also a felony to disclose information about how to bypass that access control, which means that pen-testers who even describe how they access a device or system face criminal liability. Under anticircumvention law any manufacturer can trivially turn their product into a no-go zone, criminalizing the act of investigating its defects, criminalizing the act of reporting on its defects, and criminalizing the act of remediating its defects. This is a law that Jay Freeman rightly calls \"Felony Contempt of Business Model.\" Anticircumvention became the law of the land in 1998 when Bill Clinton signed the DMCA. But before you start snickering at those stupid Americans, know this: every other country in the world has passed a law just like this in the years since. Here in the EU, it came in through Article 6 of the 2001 EU Copyright Directive. Now, it makes a certain twisted sense for the US to enact a law like this, after all, they are the world's tech powerhouse, home to the biggest, most powerful tech companies in the world. By making it illegal to modify digital products without the manufacturer's permission, America enhances the rent-extracting power of the most valuable companies on US stock exchanges. But why would Europe pass a law like this? Europe is a massive tech importer. By extending legal protection to tech companies that want to steal their users' data and money, the EU was facilitating a one-way transfer of value from Europe to America. So why would Europe do this? Well, let me tell you about the circumstances under which other countries came to enact their anticircumvention laws and maybe you'll spot a pattern that will answer this question. Australia got its anticircumvention law through the US-Australia Free Trade Agreement, which obliges Australia to enact anticircumvention law. Canada and Mexico got it through the US-Mexico-Canada Free Trade Agreement, which obliges Canada and Mexico to enact anticircumvention laws. Andean nations like Chile got their anticircumvention laws through bilateral US free trade agreements, which oblige them to enact anticircumvention laws. And the Central American nations got their anticircumvention laws through CAFTA – The Central American Free Trade Agreement with the USA – which obliges them to enact anticircumvention laws, too. I assume you've spotted the pattern by now: the US trade representative has forced every one of its trading partners to adopt anticircumvention law, to facilitate the extraction of their own people's data and money by American firms. But of course, that only raises a further question: Why would every other country in the world agree to let America steal its own people's money and data, and block its domestic tech sector from making interoperable products that would prevent this theft? Here's an anecdote that unravels this riddle: many years ago, in the years before Viktor Orban rose to power, I used to guest-lecture at a summer PhD program in political science at Budapest's Central European University. And one summer, after I'd lectured to my students about anticircumvention law, one of them approached me. They had been the information minister of a Central American nation during the CAFTA negotiations, and one day, they'd received a phone-call from their trade negotiator, calling from the CAFTA bargaining table. The negotiator said, \"You know how you told me not to give the Americans anticircumvention under any circumstances? Well, they're saying that they won't take our coffee unless we give them anticircumvention. And I'm sorry, but we just can't lose the US coffee market. Our economy would collapse. So we're going to give them anticircumvention. I'm really sorry.\" That's it. That's why every government in the world allowed US Big Tech companies to declare open season on their people's private data and ready cash. The alternative was tariffs. Well, I don't know if you've heard, but we've got tariffs now! I mean, if someone threatens to burn your house down unless you follow their orders, and then they burn your house down anyway, you don't have to keep following their orders. So…Happy Liberation Day? So far, every country in the world has had one of two responses to the Trump tariffs. The first one is: \"Give Trump everything he asks for (except Greenland) and hope he stops being mad at you.\" This has been an absolute failure. Give Trump an inch, he'll take a mile. He'll take fucking Greenland. Capitulation is a failure. But so is the other tactic: retaliatory tariffs. That's what we've done in Canada (like all the best Americans, I'm Canadian). Our top move has been to levy tariffs on the stuff we import from America, making the things we buy more expensive. That's a weird way to punish America! It's like punching yourself in the face as hard as you can, and hoping the downstairs neighbor says \"Ouch!\" And it's indiscriminate. Why whack some poor farmer from a state that begins and ends with a vowel with tariffs on his soybeans. That guy never did anything bad to Canada. But there's a third possible response to tariffs, one that's just sitting there, begging to be tried: what about repealing anticircumvention law? If you're a technologist or an investor based in a country that's repealed its anticircumvention law, you can go into business making disenshittificatory products that plug into America's defective tech exports, allowing the people who own and use those products to use them in ways that are good for them, even if those uses make the company's shareholders mad. Think of John Deere tractors: when a farmer's John Deere tractor breaks down, they are expected to repair it, swapping in new parts and assemblies to replace whatever's malfing. But the tractor won't recognize that new part and will not start working again, not until the farmer spends a couple hundred bucks on a service callout from an official John Deere tractor repair rep, whose only job is to type an unlock code into the tractor's console, to initialize the part and pair it with the tractor's main computing unit. Modding a tractor to bypass this activation step violates anticircumvention law, meaning farmers all over the world are stuck with this ripoff garbage, because their own government will lock up anyone who makes a tractor mod that disables the parts-pairing check in this American product. So what if Canada repealed Bill C-11, the Copyright Modernization Act of 2012 (that's our anticircumvention law)? Well, then a company like Honeybee, which makes tractor front-ends and attachments, could hire some smart University of Waterloo computer science grads, and put 'em to work jailbreaking the John Deere tractor's firmware, and offer it to everyone in the world. They could sell the crack to anyone with an internet connection and a payment method, including that poor American farmer whose soybeans we're currently tariffing. It's hard to convey how much money is on the table here. Take just one example: Apple's App Store. Apple forces all app vendors into using its payment processor, and charges them a 30 percent commission on every euro spent inside of an app. 30 percent! That's such a profitable business that Apple makes $100 billion per year on it. If the EU repeals Article 6 of the Copyright Directive, some smart geeks in Finland could reverse-engineer Apple's bootloaders and make a hardware dongle that jailbreaks phones so that they can use alternative app stores, and sell the dongle – along with the infrastructure to operate an app store – to anyone in the world who wants to go into business competing with Apple for users and app vendors. Those competitors could offer a 90% discount every crafter on Etsy, every performer on Patreon, every online news outlet, every game dev, every media store. Offer them a 90% discount on payments, and still make $10b/year. Maybe Finland will never see another Nokia, but Nokia's a tough business to be in. You've got to make hardware, which is expensive and risky. But if the EU legalizes jailbreaking, then Apple would have to incur all the expense and risk of making and fielding hardware, while those Finnish geeks could cream off the $100b Apple sucks out of the global economy in an act of a disgusting, rip-off rent-seeking. As Jeff Bezos said to the publishers: \"Your margin is my opportunity.\" With these guys, it's always \"disruption for thee, but not for me.\" When they do it to us, that's progress. When we do it to them, it's piracy, and every pirate wants to be an admiral. Well, screw that. Move fast and break Tim Cook's things. Move fast and break kings! It's funny: I spent 25 years getting my ass kicked by the US Trade Representative (in my defense, it wasn't a fair fight). I developed a kind of grudging admiration for the skill with which the USTR bound the entire world to a system of trade that conferred parochial advantages to America and its tech firms, giving them free rein to loot the world's data and economies. So it's been pretty amazing to watch Trump swiftly and decisively dismantle the global system of trade and destroy the case for the world continuing to arrange its affairs to protect the interests of America's capital class. I mean, it's not a path I would have chosen. I'd have preferred no Trump at all to this breakthrough. But I'll take this massive own-goal if Trump insists. I mean, I'm not saying I've become an accelerationist, but at this point, I'm not exactly not an accelerationist. Now, you might have heard that governments around the world have been trying to get Apple to open its App Store, and they've totally failed at this. When the EU hit Apple with an enforcement order under the Digital Markets Act, Apple responded by offering to allow third party app stores, but it would only allow those stores to sell apps that Apple had approved of. And while those stores could use their own payment processors, Apple would charge them so much in junk fees that it would be more expensive to process a payment using your own system, and if Apple believed that a user's phone had been outside of the EU for 21 days, they'd remotely delete all that user's data and apps. When the EU explained that this would not satisfy the regulation, Apple threatened to pull out of the EU. Then, once everyone had finished laughing, Apple filed more than a dozen bullshit objections to the order hoping to tie this up in court for a decade, the way Google and Meta did for the GDPR. It's not clear that the EU can force Apple to write code that opens up the iOS platform for alternative app stores and payment methods, but there is one thing that the EU can absolutely do with 100% reliability, any time they want: the EU can decide not to let Apple use Europe's courts to shut down European companies that defend European merchants, performers, makers, news outlets, game devs and creative workers, from Apple's ripoff, by jailbreaking phones. All the EU has to do is repeal Article 6 of the Copyright Directive, and, in so doing, strip Apple of the privilege of mobilizing the European justice system to shore up Apple's hundred billion dollar annual tax on the world's digital economy. The EU company that figures out how to reliably jailbreak iPhones will have customers all over the world, including in the USA, where Apple doesn't just use its veto over which apps you can run on your phone to suck 30% out of every dollar you spend, but where Apple also uses its control over the platform to strip out apps that protect Apple's customers from Trump's fascist takeover. Back in October, Apple kicked the \"ICE Block\" app out of the App Store. That's an app that warns the user if there's a snatch squad of masked ICE thugs nearby looking to grab you off the street and send you to an offshore gulag. Apple internally classified ICE kidnappers as a \"protected class,\" and then declared the ICE Block infringed on the rights of these poor, beset ICE goons. And speaking of ICE thugs, there are plenty of qualified technologists who have fled the US this year, one step ahead of an ICE platoon looking to put them and their children into a camp. Those skilled hackers are now living all over the world, joined by investors who'd like to back a business whose success will be determined by how awesome its products are, and not how many $TRUMP coins they buy. Apple's margin could be their opportunity. Legalizing jailbreaking, raiding the highest margin lines of business of the most profitable companies in America is a much better response to the Trump tariffs than retaliatory tariffs. For one thing, this is a targeted response: go after Big Tech's margins and you're mounting a frontal assault on the businesses whose CEOs each paid a million bucks to sit behind Trump on the inauguration dais. Raiding Big Tech's margins is not an attack on the American people, nor on the small American businesses that are ripped off by Big Tech. It's a raid on the companies that screw everyday Americans and everyone else in the world. It's a way to make everyone in the world richer at the expense of these ripoff companies. It beats the shit out of blowing hundreds of billions of dollars building AI data-centers in the hopes that someday, a sector that's lost nearly a trillion dollars shipping defective chatbots will figure out a use for GPUs that doesn't start hemorrhaging money the minute they plug them in. So here are our new allies in the war on general-purpose computation: businesses and technologists who want to make billions of dollars raiding Big Tech's margins, and policymakers who want their country to be the disenshittification nation – the country that doesn't merely protect its people's money and privacy by buying jailbreaks from other countries, but rather, the country that makes billions of dollars selling that privacy and pocketbook-defending tech to the rest of the world. That's a powerful alliance, but those are not the only allies Trump has pushed into our camp. There's another powerful ally waiting in the wings. Remember last June, when the International Criminal Court in the Hague issued an arrest warrant for the génocidaire Benjamin Netanyahu, and Trump denounced the ICC, and then the ICC lost its Outlook access, its email archives, its working files, its address books, its calendars? Microsoft says they didn't brick the ICC – that it's a coincidence. But when it comes to a he-said/Clippy-said between the justices of the ICC and the convicted monopolists of Microsoft, I know who I believe. This is exactly the kind of infrastructural risk that we were warned of if we let Chinese companies like Huawei supply our critical telecoms equipment. Virtually every government ministry, every major corporation, every small business and every household in the world have locked themselves into a US-based, cloud-based service. The handful of US Big Tech companies that supply the world's administrative tools are all vulnerable to pressure from the Trump admin, and that means that Trump can brick an entire nation. The attack on the ICC was an act of cyberwarfare, like the Russian hackers who shut down Ukrainian power-generation facilities, except that Microsoft doesn't have to hack Outlook to brick the ICC – they own Outlook. Under the US CLOUD Act of 2018, the US government can compel any US-based company to disclose any of its users' data – including foreign governments – and this is true no matter where that data is stored. Last July, Anton Carniaux, Director of Public and Legal Affairs at Microsoft France, told a French government inquiry that he \"couldn't guarantee\" that Microsoft wouldn't hand sensitive French data over to the US government, even if that data was stored in a European data-center. And under the CLOUD Act, the US government can slap gag orders on the companies that it forces to cough up that data, so there'd be no way to even know if this happened, or whether it's already happened. It doesn't stop at administrative tools, either: remember back in 2022, when Putin's thugs looted millions of dollars' worth of John Deere tractors from Ukraine and those tractors showed up in Chechnya? The John Deere company pushed an over-the-air kill signal to those tractors and bricked 'em. John Deere is every bit as politically vulnerable to the Trump admin as Microsoft is, and they can brick most of the tractors in the world, and the tractors they can't brick are probably made by Massey Ferguson, the number-two company in the ag-tech cartel, which is also an American company and just as vulnerable to political attacks from the US government. Now, none of this will be news to global leaders. Even before Trump and Microsoft bricked the ICC they were trying to figure out a path to \"digital sovereignty.\" But the Trump administration's outrageous conduct and rhetoric over past 11 months has turned \"digital sovereignty\" from a nice-to-have into a must-have. So finally, we're seeing some movement, like \"Eurostack,\" a project to clone the functionality of US Big Tech silos in free/open source software, and to build EU-based data-centers that this code can run on. But Eurostack is heading for a crisis. It's great to build open, locally hosted, auditable, trustworthy services that replicate the useful features of Big Tech, but you also need to build the adversarial interoperability tools that allow for mass exporting of millions of documents, the sensitive data-structures and edit histories. We need scrapers and headless browsers to accomplish the adversarial interoperability that will guarantee ongoing connectivity to institutions that are still hosted on US cloud-based services, because US companies are not going to facilitate the mass exodus of international customers from their platform. Just think of how Apple responded to the relatively minor demand to open up the iOS App Store, and now imagine the thermonuclear foot-dragging, tantrum-throwing and malicious compliance they'll come up with when faced with the departure of a plurality of the businesses and governments in a 27-nation bloc of 500,000,000 affluent consumers. Any serious attempt at digital sovereignty needs migration tools that work without the cooperation of the Big Tech companies. Otherwise, this is like building housing for East Germans and locating it West Berlin. It doesn't matter how great the housing is, your intended audience is going to really struggle to move in unless you tear down the wall. Step one of tearing down that wall is killing anticircumvention law, so that we can run virtual devices that can be scripted, break bootloaders to swap out firmware and generally seize the means of computation. So this is the third bloc in the disenshittification army: not just digital rights hippies like me; not just entrepreneurs and economic development wonks rubbing their hands together at the thought of transforming American trillions into European billions; but also the national security hawks who are 100% justified in their extreme concern about their country's reliance on American platforms that have been shown to be totally unreliable. This is how we'll get a post-American internet: with an unstoppable coalition of activists, entrepreneurs and natsec hawks. This has been a long time coming. Since the post-war settlement, the world has treated the US as a neutral platform, a trustworthy and stable maintainer of critical systems for global interchange, what the political scientists Henry Farrell and Abraham Newman call the \"Underground Empire.\" But over the past 15 years, the US has systematically shattered global trust in its institutions, a process that only accelerated under Trump. Take transoceanic fiber optic cables: the way the transoceanic fiber routes were planned, the majority of these cables make landfall on the coasts of the USA where the interconnections are handled. There's a good case for this hub-and-spoke network topology, especially compared to establishing direct links between every country. That's an Order(N^2) problem: directly linking each of the planet Earth's 205 countries to every other country would require 20,910 fiber links. But putting all the world's telecoms eggs in America's basket only works if the US doesn't take advantage of its centrality, and while many people worried about what the US could do with the head-ends of the world's global fiber infra, it wasn't until Mark Klein's 2006 revelations about the NSA's nation-scale fiber optic taps in AT&T's network, and Ed Snowden's 2013 documents showing the global scale of this wiretapping, that the world had to confront the undeniable reality that the US could not be trusted to serve as the world's fiber hub. It's not just fiber. The world does business in dollars. Most countries maintain dollar accounts at the Fed in New York as their major source of foreign reserves. But in 2005, American vulture capitalists bought up billions of dollars worth of Argentinian government bonds after the sovereign nation of Argentina had declared bankruptcy. They convinced a judge in New York to turn over the government of Argentina's US assets to them to make good on loans that these debt collectors had not issued, but had bought up at pennies on the dollar. At that moment, every government in the world had to confront the reality that they could not trust the US Federal Reserve with their foreign reserves. But what else could they use? Without a clear answer, dollar dominance continued, but then, under Biden, Putin-aligned oligarchs and Russian firms lost access to the SWIFT system for dollar clearing. This is when goods – like oil – are priced in dollars, so that buyers only need to find someone who will trade their own currency for dollars, which they can then swap for any commodity in the world. Again, there's a sound case for dollar clearing: it's just not practical to establish deep, liquid pairwise trading market for all of the world's nearly 200 currencies, it's another O(N^2) problem. But it only works if the dollar is a neutral platform. Once the dollar becomes an instrument of US foreign policy – whether or not you agree with that policy – it's no longer a neutral platform, and the world goes looking for an alternative. No one knows what that alternative's going to be, just as no one knows what configuration the world's fiber links will end up taking. There's kilometers of fiber being stretched across the ocean floor, and countries are trying out some pretty improbable gambits as dollar alternatives, like Ethiopia revaluing its sovereign debt in Chinese renminbi. Without a clear alternative to America's enshittified platforms, the post-American century is off to a rocky start. But there's one post-American system that's easy to imagine. The project to rip out all the cloud connected, backdoored, untrustworthy black boxes that power our institutions, our medical implants, our vehicles and our tractors; and replace it with collectively maintained, open, free, trustworthy, auditable code. This project is the only one that benefits from economies of scale, rather than being paralyzed by exponential crises of scale. That's because any open, free tool adopted by any public institution – like the Eurostack services – can be audited, localized, pen-tested, debugged and improved by institutions in every other country. It's a commons, more like a science than a technology, in that it is universal and international and collaborative. We don't have dueling western and Chinese principles of structural engineering. Rather, we have universal principles for making sure buildings don't fall down, adapted to local circumstances. We wouldn't tolerate secrecy in the calculations used to keep our buildings upright, and we shouldn't tolerate opacity in the software that keeps our tractors, hearing aids, ventilators, pacemakers, trains, games consoles, phones, CCTVs, door locks, and government ministries working. The thing is, software is not an asset, it's a liability. The capabilities that running software delivers – automation, production, analysis and administration – those are assets. But the software itself? That's a liability. Brittle, fragile, forever breaking down as the software upstream of it, downstream of it, and adjacent to it is updated or swapped out, revealing defects and deficiencies in systems that may have performed well for years. Shifting software to commons-based production is a way to reduce the liability that software imposes on its makers and users, balancing out that liability among many players. Now, obviously, tech bosses are totally clueless when it comes to this. They really do think that software is an asset. That's why they're so fucking horny to have chatbots shit out software at superhuman speeds. That's why they think it's good that they've got a chatbot that \"produces a thousand times more code than a human programmer.\" Producing code that isn't designed for legibility and maintainability, that is optimized, rather, for speed of production, is a way to incur tech debt at scale. This is a neat encapsulation of the whole AI story: the chatbot can't do your job, but an AI salesman can convince your boss to fire you and replace you with a chatbot that can't do your job. Your boss is an easy mark for that chatbot hustler because your boss hates you. In their secret hearts, bosses understand that if they stopped coming to work, the business would run along just fine, but if the workers stopped showing up, the company would grind to a halt. Bosses like to tell themselves that they're in the driver's seat, but really, they fear that they're strapped into the back seat playing with a Fisher Price steering wheel. For them, AI is a way to wire the toy steering wheel directly into the company's drive-train. It's the realization of the fantasy of a company without workers. When I was walking the picket line in Hollywood during the writer's strike, a writer told me that you prompt an AI the same way a studio boss gives shitty notes to a writer's room: \"Make me ET, but make it about a dog, and give it a love interest, and a car-chase in the third act.\" Say that to a writer's room and they will call you a fucking idiot suit and tell you \"Why don't you go back to your office and make a spreadsheet, you nitwit. The grownups here are writing a movie.\" Meanwhile, if you give that prompt to a chatbot, it will cheerfully shit out a script exactly to spec. The fact that this script will be terrible and unusable is less important than the prospect of a working life in which no one calls you a fucking idiot suit. AI dangles the promise of a writer's room without writers, a movie without actors, a hospital without nurses, a coding shop without coders. When Mark Zuckerberg went on a podcast and announced that the average American had three friends, but wanted 15 friends, and that he could solve this by giving us chatbots instead of friends, we all dunked on him as an out-of-touch billionaire Martian who didn't understand the nature of friendship. But the reality is that for Zuck, your friends are a problem. Your friends' interactions with you determine how much time you spend on his platforms, and thus how many revenue-generating ads he can show you. Your friends stubbornly refuse to organize their relationship with you in a way that maximizes the return to his shareholders. So Zuck is over there in Menlo Park, furiously fantasizing about replacing your friends with chatbots, because that way, he can finally realize the dream of a social media service without any socializing. Rich, powerful people are, at root, solipsists. The only way to amass a billion dollars is to inflict misery and privation on whole populations. The only way to look yourself in the mirror after you've done that, is to convince yourself that those people don't matter, that, in some important sense, they aren't real. Think of Elon Musk calling everyone who disagrees with him an \"NPC,” or all those \"Effective Altruists,\" who claimed the moral high ground by claiming to care about 53 trillion imaginary artificial humans who will come into existence in 10,000 years at the expense of extending moral consideration to people alive today. Or think of how Trump fired all the US government scientists, and then announced the \"Genesis\" program, declaring that the US would begin generating annual \"moonshot\"-scale breakthroughs, with a chatbot. It's science without scientists. Chatbots can't really do science, but from Trump's perspective, they're still better than scientists, because a chatbot won't ever tell him not to stare at an eclipse, or not to inject bleach. A chatbot won't ever tell him that trans people exist, or that the climate emergency is real. Powerful people are suckers for AI, because AI fuels the fantasy of a world without people: just a boss and a computer, and no ego-shattering confrontations with people who know how to do things telling you \"no.\" AI is a way to produce tech debt at scale, to replace skilled writers with defective spicy autocomplete systems, to lose money at a rate not seen in living memory. Now, compare that with the project of building a post-American internet: a project to reduce tech debt, to unlock America's monopoly trillions and divide them among the world's entrepreneurs (for whom they represent untold profits), and the world's technology users (for whom they represent untold savings); all while building resiliency and sovereignty. Now, some of you are probably feeling pretty cynical about this right now. After all, your political leaders have demonstrated decades of ineffectual and incompetent deference to the US, and an inability to act, even when the need was dire. If your leaders couldn't act decisively on the climate emergency, what hope do we have of them taking this moment seriously? But crises precipitate change. Remember when another mad emperor – Vladimir Putin – invaded Ukraine, and Europe experienced a dire energy shortage? In three short years, the continent's solar uptake skyrocketed. The EU went from being 15 years behind in its energy transition, to ten years ahead of schedule. Because when you're shivering the dark, a lot of fights you didn't think were worth it are suddenly existential battles you can't afford to lose. Sure, no one wants to argue with a tedious neighbor who has an aesthetic temper tantrum at the thought of a solar panel hanging from their neighbor's balcony. But when it's winter, and there's no Russian gas, and you're shivering in the dark, then that person can take their aesthetic objection to balcony solar, fold it until it's all corners, and shove it right up their ass. Besides, we don't need Europe to lead the charge on a post-American internet by repealing anticircumvention. Any country could do it! And the country that gets there first gets to reap the profits from supplying jailbreaking tools to the rest of the world, it gets to be the Disenshittification Nation, and everyone else in the world gets to buy those tools and defend themselves from US tech companies' monetary and privacy plunder. Just one country has to break the consensus, and the case for every country doing so is the strongest it's ever been. It used to be that countries that depended on USAID had to worry about losing food, medical and cash supports if they pissed off America. But Trump killed USAID, so now that's a dead letter. Meanwhile, America's status as the planet's most voracious consumer has been gutted by decades of anti-worker, pro-billionaire policies. Today, the US is in the grips of its third consecutive \"K-shaped\" recovery, that's an economic rally where the rich get richer, and everyone else gets poorer. For a generation, America papered over that growing inequality with easy credit, with everyday Americans funding their consumption with credit cards and second and third mortgages. So long as they could all afford to keep buying, other countries had to care about America as an export market. But a generation of extraction has left the bottom 90% of Americans struggling to buy groceries and other necessities, carrying crushing debt from skyrocketing shelter, education and medical expenses that they can't hope to pay down, thanks to 50 years of wage stagnation. The Trump administration has sided firmly with debt collectors, price gougers, and rent extractors. Trump neutered enforcement against rent-fixing platforms like Realpage, restarted debt payments for eight million student borrowers, and killed a plan to make live-saving drugs a little cheaper, leaving Americans to continue to pay the highest drug prices in the world. Every dollar spent servicing a loan is a dollar that can't go to consumption. And as more and more Americans slip into poverty, the US is gutting programs that spend money on the public's behalf, like SNAP, the food stamps program that helps an ever-larger slice of the American public stave off hunger. America is chasing the \"world without people\" dream, where working people have nothing, spend nothing, and turn every penny over to rentiers who promptly flush that money into the stock market, shitcoins, or gambling sites. But I repeat myself. Even the US military – long a sacrosanct institution – is being kneecapped to enrich rent-seekers. Congress just killed a military \"right to repair\" law. So now, US soldiers stationed abroad will have to continue the Pentagon's proud tradition of shipping materiel from generators to jeeps back to America to be fixed by their manufacturers at a 10,000% markup, because the Pentagon routinely signs maintenance contracts that prohibit it from teaching a Marine how to fix an engine. The post-American world is really coming on fast. As we repeal our anticircumvention laws, we don't have to care what America thinks, we don't have to care about their tariffs, because they're already whacking us with tariffs; and because the only people left in the US who can afford to buy things are rich people, who just don't buy enough stuff. There's only so many Lambos and Sub-Zeros even the most guillotineable plute can usefully own. But what if European firms want to go on taking advantage of anticircumvention laws? Well, there's good news there, too. \"Good news,\" because the EU firms that rely on anticircumvention are engaged in the sleaziest, most disgusting frauds imaginable. Anticircumvention law is the reason that Volkswagen could get away with Dieselgate. By imposing legal liability on reverse-engineers who might have discovered this lethal crime, Article 6 of the Copyright Directive created a chilling effect, and thousands of Europeans died, every year. Today, Germany's storied automakers are carrying on the tradition of Dieselgate, sabotaging their cars to extract rent from drivers. From Mercedes, which rents you the accelerator pedal in your luxury car, only unlocking the full acceleration curve of your engine if you buy a monthly subscription; to BMW, which rents you the automated system that automatically dims your high-beams if there's oncoming traffic. Legalize jailbreaking and any mechanic in Europe could unlock those subscription features for one price, and not share any of that money with BMW and Mercedes. Then there's Medtronic, a company that pretends it is Irish. Medtronic is the world's largest med-tech company, having purchased all their competitors, and then undertaken the largest \"tax-inversion\" in history, selling themselves to a tiny Irish firm, in order to magick their profits into a state of untaxable grace, floating in the Irish Sea. Medtronic supplies the world's most widely used ventilators, and it booby-traps them the same way John Deere booby-traps its tractors. After a hospital technician puts a new part in a Medtronic ventilator, the ventilator's central computing unit refuses to recognize the part until it completes a cryptographic handshake, proving that an authorized Medtronic technician was paid hundreds of euros to certify a repair that the hospital's own technician probably performed. It's just a way to suck hundreds of euros out of hospitals every time a ventilator breaks. This would be bad enough, but during the covid lockdowns, when every ventilator was desperately needed, and when the planes stopped flying, there was no way for a Medtronic tech to come and bless the hospital technicians' repairs. This was lethal. It killed people. There's one more European company that relies on anticircumvention that I want to discuss here, because they're old friends of CCC: that's the Polish train company Newag. Newag sabotages its own locomotives, booby-trapping them so that if they sense they have been taken to a rival's service yard, the train bricks itself. When the train operator calls Newag about this mysterious problem, the company \"helpfully\" remotes into the locomotive's computers, to perform \"diagnostics,\" which is just sending a unbricking command to the vehicle, a service for which they charge 20,000 euros. Last year, Polish hackers from the security research firm Dragon Sector presented on their research into this disgusting racket in this very hall, and now, they're being sued by Newag under anticircumvention law, for making absolutely true disclosures about Newag's deliberately defective products. So these are the European stakeholders for anticircumvention law: the Dieselgate killers, the car companies who want to rent you your high-beams and accelerator, the med-tech giant that bricked all the ventilators during the pandemic, and the company that tied Poland to the train-tracks. I relish the opportunity to fight these bastards in Brussels, as they show up and cry \"Won't someone think of the train saboteurs?\" The enshittification of technology – the decay of the platforms and systems we rely on – has many causes: the collapse of competition, regulatory capture, the smashing of tech workers' power. But most of all, enshittification is the result of anticircumvention law's ban on interoperability. By blocking interop, by declaring war on the general-purpose computer, our policy-makers created an enshittogenic environment that rewarded companies for being shitty, and ushered in the enshittocene, in which everything is turning to shit. Let's call time on enshittification. Let's seize the means of computation. Let's build the drop-in, free, open, auditable alternatives to the services and firmware we rely on. Let's end the era of silos. I mean, isn't it fucking weird how you have to care which network someone is using if you want to talk to them? Instead of just deciding who you want to talk to? The fact that you have to figure out whether the discussion you're trying to join is on Twitter or Bluesky, Mastodon or Instagram – that is just the most Prodigy/AOL/Compuserve-ass way of running a digital world. I mean, 1990 called and they want their walled gardens back Powerful allies are joining our side in the War on General Purpose Computation. It's not just people like us, who've been fighting for this whole goddamned century, but also countries that want to convert American tech's hoarded trillions into fuel for a single-use rocket that boosts their own tech sector into a stable orbit. It's national security hawks who are worried about Trump bricking their ministries or their tractors, and who are also worried – with just cause – about Xi Jinping bricking all their solar inverters and batteries. Because, after all, the post-American internet is also a post-Chinese internet! Nothing should be designed to be field updatable without the user's permission. Nothing critical should be a black box. Like I said at the start of this talk, I have been doing this work for 24 years at the Electronic Frontier Foundation, throwing myself at a door that was double-locked and deadbolted, and now that door is open a crack and goddammit, I am hopeful. Not optimistic. Fuck optimism! Optimism is the idea that things will get better no matter what we do. I know that what we do matters. Hope is the belief that if we can improve things, even in small ways, we can ascend the gradient toward the world we want, and attain higher vantage points from which new courses of action, invisible to us here at our lower elevation, will be revealed. Hope is a discipline. It requires that you not give in to despair. So I'm here to tell you: don't despair. All this decade, all over the world, countries have taken up arms against concentrated corporate power. We've had big, muscular antitrust attacks on big corporations in the US (under Trump I and Biden); in Canada; in the UK; in the EU and member states like Germany, France and Spain; in Australia; in Japan and South Korea and Singapore; in Brazil; and in China. This is a near-miraculous turn of affairs. All over the world, governments are declaring war on monopolies, the source of billionaires' wealth and power. Even the most forceful wind is invisible. We can only see it by its effects. What we're seeing here is that whenever a politician bent on curbing corporate power unfurls a sail, no matter where in the world that politician is, that sail fills with wind and propels the policy in ways that haven't been seen in generations. The long becalming of the fight over corporate power has ended, and a fierce, unstoppable wind is blowing. It's not just blowing in Europe, or in Canada, or in South Korea, Japan, China, Australia or Brazil. It's blowing in America, too. Never forget that as screwed up and terrifying as things are in America, the country has experienced, and continues to experience, a tsunami of antitrust bills and enforcement actions at the local, state and federal level. And never forget that the post-American internet will be good for Americans. Because, in a K-shaped, bifurcated, unequal America, the trillions that American companies loot from the world don't trickle down to Americans. The average American holds a portfolio of assets that rounds to zero, and that includes stock in US tech companies. The average American isn't a shareholder in Big Tech, the average American is a victim of Big Tech. Liberating the world from US Big Tech is also liberating America from US Big Tech. That's been EFF's mission for 35 years. It's been my mission at EFF for 25 years. If you want to get involved in this fight – and I hope you do – it can be your mission, too. You can join EFF, and you can join groups in your own country, like Netzpolitik here in Germany, or the Irish Council for Civil Liberties, or La Quadrature du Net in France, or the Open Rights Group in the UK, or EF Finland, or ISOC Bulgaria, XNet, DFRI, Quintessenz, Bits of Freedom, Openmedia, FSFE, or any of dozens of organizations around the world. The door is open a crack, the wind is blowing, the post-American internet is upon us: a new, good internet that delivers all the technological self-determination of the old, good internet, and the ease of use of Web 2.0 so that our normie friends can use it, too. And I can't wait for all of us to get to hang out there. It's gonna be great. Hey look at this (permalink) The Enshittifinancial Crisis https://www.wheresyoured.at/the-enshittifinancial-crisis/ Austrian Supreme Court: Meta must give users full access to their data https://noyb.eu/en/austrian-supreme-court-meta-must-give-users-full-access-their-data the myth of merit in the managerial class https://backofmind.substack.com/p/the-myth-of-merit-in-the-managerial ECI, Ethical Computing Initiative https://aol.codeberg.page/eci/ BMW Patents Proprietary Screws That Only Dealerships Can Remove https://carbuzz.com/bmw-roundel-logo-screw-patent/ Object permanence (permalink) #20yrsago Online sf mag Infinite Matrix goes out with a bang – new Gibson, Rucker, Kelly https://web.archive.org/web/20060101120510/https://www.infinitematrix.net/ #20yrsago Wil McCarthy’s wonderful “Hacking Matter” as a free download https://web.archive.org/web/20060103052051/http://wilmccarthy.com/hm.htm #15yrsago Papa Sangre: binaural video game with no video https://web.archive.org/web/20101224170833/http://www.papasangre.com/ #15yrsago DDoS versus human rights organizations https://cyber.harvard.edu/publications/2010/DDoS_Independent_Media_Human_Rights #15yrsago Why I have a public email address https://www.theguardian.com/technology/2010/dec/21/keeping-email-address-secret-spambots #15yrsago How the FCC failed the nation on Net Neutrality https://web.archive.org/web/20101224075655/https://www.salon.com/technology/network_neutrality/index.html?story=/tech/dan_gillmor/2010/12/21/fcc_network_neutrality #15yrsago Bankster robberies: Bank of America and friends wrongfully foreclose on customers, steal all their belongings https://www.nytimes.com/2010/12/22/business/22lockout.html?_r=1&amp;hp #10yrsago India’s deadly exam-rigging scandal: murder, corruption, suicide and scapegoats https://www.theguardian.com/world/2015/dec/17/the-mystery-of-indias-deadly-exam-scam #10yrsago Copyright infringement “gang” raided by UK cops: 3 harmless middle-aged karaoke fans https://arstechnica.com/tech-policy/2015/12/uk-police-busts-karaoke-gang-for-sharing-songs-that-arent-commercially-available/ #10yrsago IETF approves HTTP error code 451 for Internet censorship https://web.archive.org/web/20151222155906/https://motherboard.vice.com/read/the-http-451-error-code-for-censorship-is-now-an-internet-standard #10yrsago Billionaire Sheldon Adelson secretly bought newspaper, ordered all hands to investigate judges he hated https://web.archive.org/web/20151220081546/http://www.reviewjournal.com/news/las-vegas/judge-adelson-lawsuit-subject-unusual-scrutiny-amid-review-journal-sale #10yrsago Tax havens hold $7.6 trillion; 8% of world’s total wealth https://web.archive.org/web/20160103142942/https://www.nybooks.com/articles/2016/01/14/parking-the-big-money/ #10yrsago Mansplaining Lolita https://lithub.com/men-explain-lolita-to-me/ #10yrsago Lifelock admits it lied in its ads (again), agrees to $100M fine https://web.archive.org/web/20151218000258/https://consumerist.com/2015/12/17/identity-theft-company-lifelock-once-again-failed-to-actually-keep-identities-protected-must-pay-100m/ #10yrsago Uninsured driver plows through gamer’s living-room wall and creams him mid-Fallout 4 https://www.gofundme.com/f/helpforbenzo #10yrsago Juniper Networks backdoor confirmed, password revealed, NSA suspected https://www.wired.com/2015/12/juniper-networks-hidden-backdoors-show-the-risk-of-government-backdoors/ #10yrsago A survivalist on why you shouldn’t bug out https://waldenlabs.com/10-reasons-not-to-bug-out/ #1yrago Nurses whose shitty boss is a shitty app https://pluralistic.net/2024/12/18/loose-flapping-ends/#luigi-has-a-point #1yrago Proud to be a blockhead https://pluralistic.net/2024/12/21/blockheads-r-us/#vocational-awe Upcoming appearances (permalink) Denver: Enshittification at Tattered Cover Colfax, Jan 22 https://www.eventbrite.com/e/cory-doctorow-live-at-tattered-cover-colfax-tickets-1976644174937 Colorado Springs: Guest of Honor at COSine, Jan 23-25 https://www.firstfridayfandom.org/cosine/ Ottawa: Enshittification at Perfect Books, Jan 28 https://www.instagram.com/p/DS2nGiHiNUh/ Toronto: Enshittification and the Age of Extraction with Tim Wu, Jan 30 https://nowtoronto.com/event/cory-doctorow-and-tim-wu-enshittification-and-extraction/ Recent appearances (permalink) The Enshitification Life Cycle with David Dayen (Organized Money) https://www.buzzsprout.com/2412334/episodes/18399894 Enshittificaition on The Last Show With David Cooper: https://www.iheart.com/podcast/256-the-last-show-with-david-c-31145360/episode/cory-doctorow-enshttification-december-16-2025-313385767 (Digital) Elbows Up (OCADU) https://vimeo.com/1146281673 How to Stop “Ensh*ttification” Before It Kills the Internet (Capitalisn't) https://www.youtube.com/watch?v=34gkIvYiHxU Enshittification on The Daily Show https://www.youtube.com/watch?v=d2e-c9SF5nE Latest books (permalink) \"Canny Valley\": A limited edition collection of the collages I create for Pluralistic, self-published, September 2025 \"Enshittification: Why Everything Suddenly Got Worse and What to Do About It,\" Farrar, Straus, Giroux, October 7 2025 https://us.macmillan.com/books/9780374619329/enshittification/ \"Picks and Shovels\": a sequel to \"Red Team Blues,\" about the heroic era of the PC, Tor Books (US), Head of Zeus (UK), February 2025 (https://us.macmillan.com/books/9781250865908/picksandshovels). \"The Bezzle\": a sequel to \"Red Team Blues,\" about prison-tech and other grifts, Tor Books (US), Head of Zeus (UK), February 2024 (thebezzle.org). \"The Lost Cause:\" a solarpunk novel of hope in the climate emergency, Tor Books (US), Head of Zeus (UK), November 2023 (http://lost-cause.org). \"The Internet Con\": A nonfiction book about interoperability and Big Tech (Verso) September 2023 (http://seizethemeansofcomputation.org). Signed copies at Book Soup (https://www.booksoup.com/book/9781804291245). \"Red Team Blues\": \"A grabby, compulsive thriller that will leave you knowing more about how the world works than you did before.\" Tor Books http://redteamblues.com. \"Chokepoint Capitalism: How to Beat Big Tech, Tame Big Content, and Get Artists Paid, with Rebecca Giblin\", on how to unrig the markets for creative labor, Beacon Press/Scribe 2022 https://chokepointcapitalism.com Upcoming books (permalink) \"Unauthorized Bread\": a middle-grades graphic novel adapted from my novella about refugees, toasters and DRM, FirstSecond, 2026 \"Enshittification, Why Everything Suddenly Got Worse and What to Do About It\" (the graphic novel), Firstsecond, 2026 \"The Memex Method,\" Farrar, Straus, Giroux, 2026 \"The Reverse-Centaur's Guide to AI,\" a short book about being a better AI critic, Farrar, Straus and Giroux, June 2026 Colophon (permalink) Today's top sources: Currently writing: \"The Reverse Centaur's Guide to AI,\" a short book for Farrar, Straus and Giroux about being an effective AI critic. LEGAL REVIEW AND COPYEDIT COMPLETE. \"The Post-American Internet,\" a short book about internet policy in the age of Trumpism. PLANNING. A Little Brother short story about DIY insulin PLANNING This work – excluding any serialized fiction – is licensed under a Creative Commons Attribution 4.0 license. That means you can use it any way you like, including commercially, provided that you attribute it to me, Cory Doctorow, and include a link to pluralistic.net. https://creativecommons.org/licenses/by/4.0/ Quotations and images are not included in this license; they are included either under a limitation or exception to copyright, or on the basis of a separate license. Please exercise caution. How to get Pluralistic: Blog (no ads, tracking, or data-collection): Pluralistic.net Newsletter (no ads, tracking, or data-collection): https://pluralistic.net/plura-list Mastodon (no ads, tracking, or data-collection): https://mamot.fr/@pluralistic Medium (no ads, paywalled): https://doctorow.medium.com/ Twitter (mass-scale, unrestricted, third-party surveillance and advertising): https://twitter.com/doctorow Tumblr (mass-scale, unrestricted, third-party surveillance and advertising): https://mostlysignssomeportents.tumblr.com/tagged/pluralistic \"When life gives you SARS, you make sarsaparilla\" -Joey \"Accordion Guy\" DeVilla READ CAREFULLY: By reading this, you agree, on behalf of your employer, to release me from all obligations and waivers arising from any and all NON-NEGOTIATED agreements, licenses, terms-of-service, shrinkwrap, clickwrap, browsewrap, confidentiality, non-disclosure, non-compete and acceptable use policies (\"BOGUS AGREEMENTS\") that I have entered into with your employer, its partners, licensors, agents and assigns, in perpetuity, without prejudice to my ongoing rights and privileges. You further represent that you have the authority to release me from any BOGUS AGREEMENTS on behalf of your employer. ISSN: 3066-764X",
    "link": "https://pluralistic.net/2026/01/01/39c3/",
    "source": "https://pluralistic.net/feed/",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T08:01:32+00:00",
    "published_ts": 1767254492,
    "smart_groups": [
      "Curated",
      "Ransomware",
      "Vulnerabilities / CVEs",
      "Cloud / SaaS",
      "Malware / Payloads",
      "Web / API Security",
      "Identity / Access",
      "Network / OT / ICS",
      "Crypto / Web3"
    ],
    "curated": true
  },
  {
    "title": "Why ss is preferred over netstat on modern Linux systems",
    "summary": "On modern Linux systems, ss is preferred over netstat for inspecting socket information. ss retrieves socket data directly from the kernel via netlink, while netstat parses /proc and processes it in userspace. This design makes ss faster and capable of exposing more detailed socket state information. Example: ss -tulnp Curious if anyone still relies on netstat for legacy or compatibility reasons. submitted by /u/forgecode1337 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0yp26/why_ss_is_preferred_over_netstat_on_modern_linux/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T07:38:07+00:00",
    "published_ts": 1767253087,
    "smart_groups": [
      "Linux / Unix"
    ],
    "curated": false
  },
  {
    "title": "Final nail in the 4-year cycle? BTC ends year after halving in the red",
    "summary": "Following the 2012 halving, Bitcoin surged to end the following year at a new high; and a similar pattern played out in 2016 and again in 2020.",
    "link": "https://cointelegraph.com/news/is-bitcoin-four-year-cycle-dead-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T06:30:06+00:00",
    "published_ts": 1767249006,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Investors funnel $32B into US crypto ETFs despite year-end pullback",
    "summary": "BlackRock has further separated itself from competitors in the crypto ETF market in 2025, with its Bitcoin and Ether funds, IBIT and ETHA, accounting for the majority of net inflows.",
    "link": "https://cointelegraph.com/news/us-spot-crypto-etfs-see-32-billion-inflows-2025?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T06:25:53+00:00",
    "published_ts": 1767248753,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "4 crypto comebacks from 2025 that could help shape the year ahead",
    "summary": "From Ross Ulbricht’s pardon to Ripple’s SEC victory, here’s a list of crypto’s most celebrated turnarounds this year and what they mean for the year ahead.",
    "link": "https://cointelegraph.com/news/4-crypto-comebacks-2025-shaping-the-next-year?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T05:57:58+00:00",
    "published_ts": 1767247078,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "How To Browse Faster and Get More Done Using Adapt Browser",
    "summary": "As web browsers evolve into all-purpose platforms, performance and productivity often suffer. Feature overload, excessive background processes, and fragmented workflows can slow down browsing sessions and introduce unnecessary friction, especially for users who rely on the browser as a primary work environment. This article explores how adopting a lightweight, task-focused browser, like",
    "link": "https://thehackernews.com/2026/01/how-to-browse-fast-using-a-lightweight-browser.html",
    "source": "The Hacker News",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T05:47:00+00:00",
    "published_ts": 1767246420,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Sysadmin to Security Analyst tips",
    "summary": "Just got an interview with my internal SOC team. I applied for Security Analyst 1 position. Only been with the company 8 months but Ive been making SOC connections at work. I'm a sysadmin at an MSP. I really want to transition to into security. Any interview tips to assist and have me stand out? submitted by /u/DeadCryptoKid [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0wqkk/sysadmin_to_security_analyst_tips/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T05:32:49+00:00",
    "published_ts": 1767245569,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Crypto forces to compound in 2026, accelerating adoption: Coinbase",
    "summary": "Coinbase’s head of research said the forces that drove crypto in 2025, such as regulation, ETFs, stablecoins and tokenization, will only get stronger in the coming year.",
    "link": "https://cointelegraph.com/news/crypto-forces-compound-2026-adoption?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T04:58:31+00:00",
    "published_ts": 1767243511,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "A supplier outage turned into a security incident halfway through incident response",
    "summary": "I work on the internal security team at a regulated payments company. We process card transactions for other businesses, so outages immediately hit revenue and compliance nerves at the same time. The incident response bridge was opened when a supplier that handles part of our transaction routing began timing out during peak volume. At the beginning it was framed as an availability issue, with transactions backing up and pressure building to provide a clear restoration timeline to the business. I joined because the integration touches regulated data, but the expectation was still that security would stay in the background unless something obviously malicious surfaced. About half an hour in, while people were debating rollback options, I started looking at the logs we were sharing. The retry traffic looked wrong. Requests were hitting endpoints that are not part of the documented production path. The supplier kept repeating that nothing had changed and that they were failing over internally to keep service alive. What they did not mention until later was that the failover path routes through an older service we thought was decommissioned. It still worked, which is why no alarms fired, but it bypasses one of our monitoring layers and handles data differently. We never designed it to run under load, let alone during an incident. At that point I said out loud that this stopped being a clean outage. The response was immediate pushback. Procurement jumped in to say the supplier had already been reviewed and approved. Someone referenced the third-party record and said Panorays showed no active issues, like that settled the question. The score had not changed, so in their minds the risk had not either. I am watching live traffic move through a path we do not actively control while the incident is still in progress and recovery speed has become the dominant concern. Everyone else wants to keep the scope narrow so the bridge can be closed and the issue treated as resolved. I am stuck trying to explain why a system behaving exactly as it was never meant to behave cannot just be dismissed as operational noise. How do I push to reclassify this without being remembered as the person who delayed recovery and forced old approval decisions back into active dispute? submitted by /u/Dismal_Marzipan1430 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0vpuq/a_supplier_outage_turned_into_a_security_incident/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T04:31:20+00:00",
    "published_ts": 1767241880,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  },
  {
    "title": "Best phishing awareness platforms for 2025/2026: addressing realism gaps in internal security training.",
    "summary": "Over the last few years, phising awareness platforms and simulation softwares have become standard across orgs of all sizes. Most security teams now run phishing simulations, tracks and measures employees through dashboard and reports. Despite this, real world phishing attacks and business email compromise incidents continue to succeed. A common issue is that many phishing programs rely heavily on external phishing templates, training employees to recognize patterns rather than make decisions in realistic workplace scenarios. Approval request, shared docs, internal messages remain a frequent source of security fail. These attacks closely mirror everyday workflows and are often underrepresented in traditional phishing awareness training. As phishing techniques evolve in 2026, including AI generated phishing and highly targeted spear phishing, the gap between phishing simulations metrics and real risk is becoming harder to ignore. Reduced risk rates do not always translate into improved security behaviour. We are currently evaluating phishing awareness software and prevention platforms, looking for approaches that move beyond template driven simulations and focus on realistic phishing scenarios, internal and external context, and measurable reduction in human risk. Interested to hearhow others are addressing internal phishing threats today, whether by extending existing tools or exploring newer phishing awareness platforms designed around realism and less focusing on scores. submitted by /u/Ok-Author-6130 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0vl03/best_phishing_awareness_platforms_for_20252026/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T04:23:36+00:00",
    "published_ts": 1767241416,
    "smart_groups": [
      "Curated",
      "Ransomware",
      "Vulnerabilities / CVEs",
      "Network / OT / ICS",
      "Phishing / Social Engineering"
    ],
    "curated": true
  },
  {
    "title": "How to get into AI governance",
    "summary": "Hey everyone. Happy new year. I want some advice from everyone on how to get into AI governance field. I am working at AWS in Containers profile and has background in Security. Is there any certifications (if any) or course or project I can start with ? TIA submitted by /u/psiparadox [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0vcml/how_to_get_into_ai_governance/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T04:10:06+00:00",
    "published_ts": 1767240606,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "Trust Wallet Chrome Extension Hack Drains $8.5M via Shai-Hulud Supply Chain Attack",
    "summary": "Trust Wallet confirmed a supply chain attack let hackers push a malicious Chrome extension update, draining $8.5 million from 2,520 wallets.",
    "link": "https://lifeboat.com/blog/2025/12/trust-wallet-chrome-extension-hack-drains-8-5m-via-shai-hulud-supply-chain-attack",
    "source": "Lifeboat – Cybercrime & Malcode",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-01T03:10:33+00:00",
    "published_ts": 1767237033,
    "smart_groups": [
      "Curated"
    ],
    "curated": true
  },
  {
    "title": "DarkSpectre Browser Extension Campaigns Exposed After Impacting 8.8 Million Users Worldwide",
    "summary": "The threat actor behind two malicious browser extension campaigns, ShadyPanda and GhostPoster, has been attributed to a third attack campaign codenamed DarkSpectre that has impacted 2.2 million users of Google Chrome, Microsoft Edge, and Mozilla Firefox. The activity is assessed to be the work of a Chinese threat actor that Koi Security is tracking under […]",
    "link": "https://lifeboat.com/blog/2025/12/darkspectre-browser-extension-campaigns-exposed-after-impacting-8-8-million-users-worldwide",
    "source": "Lifeboat – Cybercrime & Malcode",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-01T03:10:22+00:00",
    "published_ts": 1767237022,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Researchers Spot Modified Shai-Hulud Worm Testing Payload on npm Registry",
    "summary": "A new Shai-Hulud npm strain and a fake Jackson Maven package show how attackers abuse trusted dependencies to steal secrets and spread malware.",
    "link": "https://lifeboat.com/blog/2025/12/researchers-spot-modified-shai-hulud-worm-testing-payload-on-npm-registry",
    "source": "Lifeboat – Cybercrime & Malcode",
    "type": "cybercrime",
    "type_label": "Cybercrime, Darknet & Leaks",
    "published": "2026-01-01T03:09:48+00:00",
    "published_ts": 1767236988,
    "smart_groups": [
      "Malware / Payloads"
    ],
    "curated": false
  },
  {
    "title": "Private messaging faces threats from AI, limited user awareness: Session execs",
    "summary": "Session’s Chris McCabe and Alex Linton tell Cointelegraph that AI-integrated devices could bypass messaging encryption, creating privacy and security issues.",
    "link": "https://cointelegraph.com/news/ai-privacy-threats-future-private-messaging-session?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T02:16:50+00:00",
    "published_ts": 1767233810,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Critical vulnerability in IBM API Connect could allow authentication bypass",
    "summary": "IBM is urging customers to quickly patch a critical vulnerability in its API Connect platform that could allow remote attackers to bypass authentication. The company describes API Connect as a full lifecycle application programming interface (API) gateway used “to create, test, manage, secure, analyze, and socialize APIs.” It particularly touts it as a way to “unlock the potential of agentic AI” by providing a central point of control for access to AI services via APIs. The platform also includes API Agent, which automates tasks across the API lifecycle using AI. A key component is a customizable self-service portal that allows developers to easily onboard themselves, and to discover and consume multiple types of API, including SOAP, REST, events, ASyncAPIs, GraphQL, and others. The flaw, tracked as CVE-2025-13915 , affects IBM API Connect versions 10.0.8.0 through 10.0.8.5, and version 10.0.11.0, and could give unauthorized access to the exposed applications, with no user interaction required. An architectural assumption is broken “CVE-2025-13915 is not best understood as a security bug,” said Sanchit Vir Gogia , chief analyst at Greyhound Research. “It is better understood as a moment where a long standing architectural assumption finally breaks in the open. The assumption is simple and deeply embedded in enterprise design: If traffic passes through the API gateway, identity has been enforced and trust has been established. This vulnerability proves that assumption can fail completely.” He noted that the classification of the weakness, which maps to CWE-305 , is important because it rules out a whole class of what he called comforting explanations. “This is not stolen credentials. It is not role misconfiguration. It is not a permissions mistake,” he said. “The authentication enforcement itself can be circumvented.” When that happens, he explained, downstream services do not simply face elevated risk, they lose the foundation on which their access decisions were built because they do not revalidate identity. They were never designed to; they inherit trust. “Once enforcement fails upstream, inherited trust becomes unearned trust, and the exposure propagates silently,” he said. “This class of vulnerability aligns with automation, broad scanning, and opportunistic probing rather than careful targeting.” Interim fixes provided IBM said that the issue was discovered during internal testing, and it has provided interim fixes for each affected version of the software, with individual update details for VMware, OCP/CP4I, and Kubernetes. The only mitigation suggested for the flaw, according to IBM’s security bulletin , is this: “Customers unable to install the interim fix should disable self-service sign-up on their Developer Portal if enabled, which will help minimize their exposure to this vulnerability.” The company also notes in its installation instructions for the fixes that the image overrides described in the document must be removed when upgrading to the next release or fixpack. This, said Gogia, further elevates the risk. “That is not a cosmetic detail,” he noted. “Management planes define configuration truth, lifecycle control, and operational authority across the platform. When remediation touches this layer, the vulnerability sits close to the control core, not at an isolated gateway edge. That raises both blast radius and remediation risk.” This is because errors in these areas can turn into prolonged exposure or service instability. “[Image overrides] also introduce a governance hazard: Image overrides create shadow state; if they are not explicitly removed later, they persist quietly,” he pointed out. “Over time, they drift out of visibility, ownership, and audit scope. This is how temporary fixes turn into long term risk.” Most valuable outcome: Learning He added that the operational challenges involved in remediation are not so much in knowing what has to be done, but in doing it fast enough without breaking the business. And, he said, API governance now needs to include up to date inventories of APIs, their versions, dependencies, and exposure points, as well as monitoring of behavior. “The most valuable outcome here is not closure,” Gogia observed. “It is learning. Enterprises should ask what would have happened if this flaw had been exploited quietly for weeks. Which services would have trusted the gateway implicitly? Which logs would have shown abnormal behavior? Which teams would have noticed first? Those answers reveal whether trust assumptions are visible or invisible. Organizations that stop at patching will miss a rare opportunity to strengthen resilience before the next control plane failure arrives.” This article originally appeared on InfoWorld .",
    "link": "https://www.csoonline.com/article/4112265/critical-vulnerability-in-ibm-api-connect-could-allow-authentication-bypass-2.html",
    "source": "CSO Online",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T01:55:48+00:00",
    "published_ts": 1767232548,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs",
      "Exploit / PoC",
      "Cloud / SaaS",
      "Web / API Security",
      "Crypto / Web3"
    ],
    "curated": true
  },
  {
    "title": "CFTC director who made Bitcoin futures possible returns as chief of staff",
    "summary": "Amir Zaidi’s return signals a strengthening of crypto oversight as the agency prepares for new digital asset laws.",
    "link": "https://cointelegraph.com/news/cftc-division-director-who-made-bitcoin-futures-possible-returns-as-chief-of-staff?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T01:49:03+00:00",
    "published_ts": 1767232143,
    "smart_groups": [
      "Cloud / SaaS"
    ],
    "curated": false
  },
  {
    "title": "India’s central bank urges countries to prioritize CBDCs over stablecoins",
    "summary": "Only three CBDCs have been successfully launched around the world so far, in Nigeria, the Bahamas and Jamaica, although many jurisdictions are considering it.",
    "link": "https://cointelegraph.com/news/india-central-bank-cbdc-vs-stablecoins?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T01:26:40+00:00",
    "published_ts": 1767230800,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "How to disable ACR on your TV (and why doing so makes such a big difference)",
    "summary": "Your Samsung, LG, and even Sony TV comes with notable privacy risks. Here's how to avoid one of the biggest with just a few steps.",
    "link": "https://www.zdnet.com/article/how-to-disable-acr-on-tv-why/",
    "source": "ZDNet – Security",
    "type": "general",
    "type_label": "General Security & Blogs",
    "published": "2026-01-01T01:00:45+00:00",
    "published_ts": 1767229245,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Digital ID, CBDCs risk turning US into ‘surveillance state’: US rep",
    "summary": "US Representative Warren Davidson said the stablecoin-focused GENIUS Act may backfire on Americans by stripping them of their financial freedom and privacy.",
    "link": "https://cointelegraph.com/news/us-risks-becoming-surveillance-state-cbdc-digital-id?utm_source=rss_feed&utm_medium=rss&utm_campaign=rss_partner_inbound",
    "source": "Cointelegraph.com News",
    "type": "crypto",
    "type_label": "Crypto & Blockchain Security",
    "published": "2026-01-01T00:36:21+00:00",
    "published_ts": 1767227781,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Do you think jobs in Cybersecurity are at risk because of AI",
    "summary": "As AI keeps advancing in IT, jobs in many IT related fields are being eliminated. Do you think Cybersecurity jobs (to some extent) are also at risk of being partially eliminated? What are your thoughts and views. submitted by /u/tgfzmqpfwe987cybrtch [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0rj6u/do_you_think_jobs_in_cybersecurity_are_at_risk/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T00:35:06+00:00",
    "published_ts": 1767227706,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "NYC Mayoral Inauguration officially bans Flipper Zero and Raspberry Pi devices",
    "summary": "Saw this interesting bit of \"security theater\" for NYC's 2026 mayoral inauguration. The official banned items list explicitly names Flipper Zero and Raspberry Pi devices alongside weapons and explosives. The ironic part? Laptops and smartphones aren't banned. So you can't bring a Pi, but you can bring a laptop running Kali, or a phone with NetHunter. It's a pretty clear case of singling out specific tools based on their reputation rather than their actual capability. Event organizers haven't explained why they were singled out. Feels like a policy written by someone who knows just enough to recognize the names of these devices, but not enough to understand what they actually do. submitted by /u/tutezapf [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0r2gj/nyc_mayoral_inauguration_officially_bans_flipper/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T00:10:19+00:00",
    "published_ts": 1767226219,
    "smart_groups": [],
    "curated": false
  },
  {
    "title": "Transitioning to cybersecurity with a TS clearance but non technical background?",
    "summary": "Hello! So I’m starting a new position soon at a government contractor. This company hires for A LOT of cyber security roles, but my job is entirely different. I have a PhD in experimental psychology and am working on assessments, helping carry out behavioral research studies for the federal government. I’m excited about this and I love the role, and I’ll be making low 6 figures. However, this role is not exactly common and I worry about what I would do next if I were to get laid off. Cybersecurity seems to be a lucrative field pay wise, and with my TS clearance I think I would be a sought after candidate. Plus, the cybersecurity roles will pay very well! I think this role will be quite stable for 4-5 years. In the meantime, evening and stuff, I’d like to start learning cyber security. I’d consider myself a fairly smart person but I have a very minimal coding background, just a bit of R. If some could point me down a path or to some resources that would be really great! Thank you! submitted by /u/ilikesquirrrels1990 [link] [comments]",
    "link": "https://www.reddit.com/r/cybersecurity/comments/1q0r1i0/transitioning_to_cybersecurity_with_a_ts/",
    "source": "/r/cybersecurity",
    "type": "osint",
    "type_label": "OSINT, Communities & Subreddits",
    "published": "2026-01-01T00:08:58+00:00",
    "published_ts": 1767226138,
    "smart_groups": [
      "Curated",
      "Vulnerabilities / CVEs"
    ],
    "curated": true
  }
]